[
  {
    "title": "MARKET WRAP: Sensex ends at record closing high, up 282 pts; RIL up 4%",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Jul 12 2018 | 8:15 AM IST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/article/markets/markets-live-bse-sensex-nse-nifty-indices-cpi-iip-trade-war-rupee-118071200123_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxQVy12dnk4NWdUYmJVUlJWWGxzZVFIeUNJT0k2cnU2M3k5Tzc4RTRyd0dyN241Y2NGMGFoNzAxZ3hSeUI0WTh5NElOX0s3MGk5cDE0QTNrUXBOUDlGNDVjb1dLelJQU2JQbnp1ZTczQmxNWEhpUTBSTVNmVXBmTmpkbkxKVlVXSE8zdE1JOHRlV2ltWWZoS1Z5ODJ6MFRPS1JUSTA0bWlmLVg4c2stLWI4WHpIRHFuWm9UVUxfUUk2WFVfLVBaNi1JUnlTd1d1ajFQ0gHWAUFVX3lxTFBLSlJhU2R1T2hsZWNkdkhaazN3dGhISnlGY3ZQdExnNnhydlBlVF96cklHMGcxZnBRdjQyMG1JdFNNMHpqUDJMSXM5Ul9iYWdtY0RXdDFWN2VsUnRNQXV4VUc5aE9VSUc0RXJSSDZjTVkzUjExdkJvRG9MdUp6b3ZiRGlnVEVzaFd4aENYeklpZ2JNOE9maS1mWW9ITzloV3hMVkJRQ0xMNl9MS1RTSXZjRmZ0aFVsU2JMaDRORUY1SGY5NFR3MW9zRFViRDJ6OC1ZWkt3WEE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 491,
    "word_count": 83,
    "gnews_title": "MARKET WRAP: Sensex ends at record closing high, up 282 pts; RIL up 4% - Business Standard",
    "published_date": "12/07/2018",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Closing bell: Sensex drops 179 points, Nifty settles below 10,600",
    "body": "DBS sees rupee falling past 71/dollar on rising oilhttps://t.co/u5YoOb51Mm US curbs on oil imports from Iran is a new worry for Indiahttps://t.co/EMUTHiUawW Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/Money/zpAa5lIStRq6UxUPXrNwrN/Stock-Market-LIVE-Trade-concerns-hammer-global-stocks-Rupe.html",
    "original_url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPY1hTMG5RbFVKOHBtYXhkbEdsN1U4RENMTldpRVAwRFQyNHJIOEdCU2hXRlBsdnR6QkJwVnhZay1WSUZoRWNZRFhlUF9HbjNwNzBzdEw4VTNCWEhucGNFc1F6R1NtQ0N2WjZEM1YwSTI5WUVwNVpBREhHbl8zZEprbnJrbWZUanVKZmFTY1AzdFNLOFJCb2hvZ3VyeHV3YVJKTEZIbm9ILXdVYnNJM0tUZ2NrOFdEcmxx?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 377,
    "word_count": 55,
    "gnews_title": "Closing bell: Sensex drops 179 points, Nifty settles below 10,600 - Mint",
    "published_date": "28/06/2018",
    "publisher": "Mint",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "MARKET WRAP: Indices end flat on the last day of Samvat 2074; PCJ tanks 12%",
    "body": "Photo: Shutterstock.com Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Nov 06 2018 | 8:02 AMIST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/article/markets/markets-live-sensex-nifty-q2-earnings-sbi-rupee-crude-oil-asia-118110600108_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQUHNzTUFlTlBtUy1qbXBYZ09TUGs0eGY4TGNqTUUweTY5ZDA4SDZ0QVBwVGhtNmtlN0pDUnhWRE5OMWVoN2hfaEF4UkNiZHhfWWxUVmhRS3UzcWdKNWtXcm5MZTM2U19qbjNTbmp1Smt2cjR0cjJEbVVrbkMtZGNOb1gtV3ZWM3hjOGVCYmdDam9DbFVfeGJ1V0FvY0J1TF9DcTZydllNMGw5TFIyM2dST3EtcmY3cUlmYnI2Zk1mdDlLR0xneEdlNmkyX2vSAdIBQVVfeXFMTi1yT25RUXBTaUFxYlZWaHprOXE5bjFzZEQ3WEtoQlhVQjAyQk5JTFVlSVUtOUFBeEZYQ2FCVTM4SllTWXE0RDRaeko5cnl0VjkzRW1PeEUxWFUzTWdjd3RhMnBzS2FNR1piNWIzVFVZaTZ1SXBKMnY2OGhaQUtzT21XVWVFZVZvaGJaU3Y5SW85UldxajlBcWcxQzQ4M0loMDVJZHNBYlBTZm1HS2RMM08yZFVQOFJKRzhNcVQ5OHBtNnNwZzBOMU9ORktmVzRlM1dR?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 513,
    "word_count": 83,
    "gnews_title": "MARKET WRAP: Indices end flat on the last day of Samvat 2074; PCJ tanks 12% - Business Standard",
    "published_date": "06/11/2018",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Nifty closes Day 1 of July series above 10,700, Sensex zooms 386 points on global cues",
    "body": "An evening walk down Dalal Street: Sensex starts July series with fireworks! Nifty reclaims 10,700 The S&P BSE Sensex rose 385 points or 1.10 percent at 35,423.48 while the Nifty50 surged 1.18 percent or 125.20 points at 10,714.30. However, for the week, Nifty closed down by about 1 percent.... Read More",
    "url": "https://www.moneycontrol.com/news/business/markets/nifty-closes-day-1-of-july-series-above-10700-sensex-zooms-386-points-on-global-cues-2650081.html",
    "original_url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxOV0JsMFVpejV4V3NYbnpDcFZnV29uMzV3elRmR1J2RFNaOTVYbDN0VHl3X3dUUktXQWhPUGZWSFk3ZGloemNlUGgzYzRFZk02SkxDdEhHZ0JOMnBDZURjRnNvYmhzSFN3Yy1TTm9CQ1JvR3QzcFdoZ1g1YWV1Q0g5bTdUMEVjblRRbkJvb1NUdFdsUzAyZDYycGpoVTg3a3ZTenMxWDJKZzNodk5HcV9DTVZmTG9hTDhOVmY0T1ZTdjB1dlVmOWVDYks4NWlwQ05NMFhLZGRJeHQzb0ZmZ1VvaDB30gHnAUFVX3lxTE5iM09BamkyU05FRnZVZVZGVXItR1c3bkxxSHFodktZNmQ0eWJ3Y00yeG1tTXRrTGNVdFl6VlV0ckpuOTlTLTRoVkp0RkpaLTNNX0VZLUlVRkxhbV9kVTBzOFhuOFpwczJWbElIM1plSThTelZNOWJkVk5TYWpFTWM1YTduYkY0Tk1Kc2N0WEV2QXFsdS11WG1BdDc1dnNBRy1KVGRmbDJUNi01RV9OeUVVOFJsTnFhU0g1OVl5ZW9oSXA0eEV6eWs1NVMyR2hoZno0N2tNSnlHTjNUaGlWZUJnbjdfWEZVRQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 305,
    "word_count": 51,
    "gnews_title": "Nifty closes Day 1 of July series above 10,700, Sensex zooms 386 points on global cues - Moneycontrol",
    "published_date": "29/06/2018",
    "publisher": "Moneycontrol",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Share market HIGHLIGHTS: Sensex down 806 pts, Nifty ends below 10,600; rupee at record low; OMCs bled up to 21%",
    "body": "Share market HIGHLIGHTS: Bloodbath in the domestic equity markets continued for the second consecutive session on Thursday, with the BSE Sensex slumping 953 points to an intra-day low of 35,022.12 points and the Nifty slipping below the 10,600-level. The Indian stock market indices closed at four-month lows as macro concerns like a weak rupee, widening current account deficit, negative global cues, rising crude oil prices and capital outflows continued to weigh heavy on investors’ risk-taking appetite. On Thursday, the BSE Sensex plunged 806.47 points or 2.24% to close at 35,169.16 points. The NSE Nifty closed 259 points or 2.39% lower at 10,599.25 points. The Bank Nifty tanked 1% to close at 24,819.30 points. The Indian rupee slumped to a fresh record low of 73.8175 per US dollar intra-day. Mukesh Ambani -led Reliance Industries slumped over 7% and was among the top drags on both the Sensex and Nifty indices. All the sectoral indices on the NSE slipped into the negative territory led by pharma, IT, FMCG , financial services, banks, and auto. Reliance alone wiped off 275 points from the Sensex index, followed by HDFC Bank (-143.93 points), TCS (-105.94), Infosys (-82.23), ITC ( -63.05) and HDFC (-40.44). Oil marketing companies stocks cracked up to 21% after the government on Thursday announced Rs 2.50/litre relief on petrol and diesel prices. The government has cut excise duty on petrol and diesel by Rs 1.50 per litre. OMCs will cut fuel prices by Rs 1 per litre, the government announced on Thursday. ICICI Bank shares surged 4% after Chanda Kocchar on Tuesday announced her resignation as the bank’s MD and CEO with immediate effect. Read Next Tuesday momentum: Nifty steady above 24,700, Sensex up 280 points Markets slide: Nifty near 24,600, Sensex down 130 points; Banks under pressure Markets under pressure: Nifty near 25,000, Sensex down 115 points; Tata Motors slips 2% Live Blog Share Market Live Updates: Sensex, Nifty, Indian Rupee vs US Dollar, Latest Stock Market News, NSE, BSE Highlights 16:00 (IST) 04 Oct 2018 Volatility may remain for a couple of weeks more: Bonanza Portfolio Ltd \"Range for nifty is 10,500 to 11,000. We may see some more moves by RBI on Friday and Government too which may give some relief temporarily. Bank nifty may hold for a while till RBI policy but stocks are under pressure and interest rate hike will cause pressure on earning for NBFC and HFC as well as companies having a debt driven Capex plans. Some relief rally may come by measures like Saudi Arab agreeing to increase production, fuel price cools off, Government steps and short covering too in next week from 10500 level to 10700-10750 level. Volatility may remain for a couple of weeks more.\" -- Pritam Deuskar, Fund Manager, Bonanza Portfolio Ltd 15:56 (IST) 04 Oct 2018 NSE LIVE! Nifty ends below 10,600; check out top gainers and losers The NSE Nifty closed Thursday's trade at 10,599.25 points, down 259 points or 2.39%. Check out top five gainers and losers on the nifty today: 15:52 (IST) 04 Oct 2018 BSE live! Check out the top gainers/losers on the BSE ICICI Bank was the top gainers on the Sensex, while Reliance Industries was the top drag. Check out other gainers and losers: 15:41 (IST) 04 Oct 2018 FPIs are selling in emerging markets which is visible in India also: Kotak Securities \"The Sensex & Nifty has fallen sharply on the back of selling witnessed across all Asian markets. Since most Asian markets are importers of crude the impact of rising crude prices and rising Dollar Index will weigh on their Trade Balance. Amongst Asian markets India is the highest importer of crude after China hence the impact on India’s Trade Deficit is very high. FPIs are selling in emerging markets which is visible in India also. Nifty has broken the 200 DMA placed at 10,777, which has intensified the selling from market participants. Also, heavy weights like Reliance and few more stocks that had led the last 1200 points rally in Nifty from 10,500 to 11,700 are the ones that are correction sharply hence the impact is higher in today’s fall. If Nifty sustain below the 200 DMA for more than a week then the floor can shift to 10,000 on the downside.\" -- Rusmik Oza, Senior VP (Head of Fundamental Research), Kotak Securities 15:39 (IST) 04 Oct 2018 CLOSING BELL: Sensex closes 800 points lower, Nifty ends at 10,599; OMCs bleed The Sensex provisionally closed Thursday's trade at 35,169.16 points, down 806.47 points or 2.24%. The Nifty closed below the 10,600 level at 10,599.25 points, down 259 points or 2.39%. OMCs bled after government announced relief measures for petrol, diesel prices. 15:31 (IST) 04 Oct 2018 BLOODBATH in MARKETS extends after government announces relief measures for petrol, diesel prices The Sensex fell over 900 points after The government on Tuesday announced Rs 2.50/litre relief on petrol and diesel prices. The NSE Nifty fell over 300 points. 15:25 (IST) 04 Oct 2018 BREAKING: Centre to ask states to cut VAT on petrol, diesel by Rs 2.5/l The government on Thursday said it will ask states to cut VAT by Rs 2.5/litre on petrol, diesel prices. Read full story here: Big decision by Modi government on fuel prices; announces Rs 2.5 per litre relief on petrol, diesel 15:21 (IST) 04 Oct 2018 BREAKING: Government cuts excise duty on petrol, diesel The government on Thursday announced Rs 2.50/litre relief on petrol and diesel prices. The government has cut excise duty on petrol and diesel by Rs 1.50 per litre. OMCs to cut fuel prices by Rs 1 per litre, the government announced on Thursday. 13:57 (IST) 04 Oct 2018 BREAKING: Chanda Kocchar quits with immediate effect Chanda Kocchar has quit as the MD and CEO of ICICI Bank on Thursday with immediate effect. The board on Thursday accepted Kocchar's request to seek early retirement. The board has appointed Sandeep Bakshi as MD, CEO for 5 years w.e.f. October 3. Shares of ICICI Bank were trading 2.80% higher at Rs 312.10 on the BSE. 13:45 (IST) 04 Oct 2018 Timely apt decisions from the Govt/RBI could help in turning around sentiments in bond and equity markets: HDFC Securities \"Equity markets in India fell more than 2% on Thursday and breached its 200DEMA (10777) in the process as of 12.30 pm. Markets fell with above average volumes, suggesting selling by institutional players mainly in hitherto stronger shares including IT services, Reliance Inds, some private Banks and insurance companies. Traders seemed to have taken cues from the technical breach and build short positions in select counters.\" \"Key issues concerning the markets include the direction of the Rupee which is the past month’s worst performing emerging market currency having fallen to a new record low of 73.90 earlier in the session. On Thursday however the Rupee showed some signs of stability in the first half the session. Market participants are pinning their hope on the Reserve Bank of India and government taking necessary measures to arrest the decline in the value of the Rupee.\" \"Most Asian markets are down sharply in response to the spike in U.S. Treasury yields to levels unseen since 2011, which makes it challenging for other asset classes to attract buying. 10 Year yields in the US touched 3.17 on Wednesday and has inched up further on Thursday. Crude prices which have touched a 4 year high is another reason for concern for our markets as it affects the macros and then indirectly the growth rate of the economy. Trade war situation seems to be escalating lately which could impact global trade and its consequent effect on the Indian economy.\" \"The Govt has been proactive and trying to tackle the situation keeping fiscal discipline in mind. Timely apt decisions (a series of them) from the Govt/RBI could help in turning around the sentiments in the bond and equity markets even as one hopes that the global situation does not worsen much in the near term. While the Indian markets are now much cheaper than a month back, analysts will have to rework their earnings estimates based on the recent developments locally and across the globe.\" - Deepak Jasani, Head of Retail Research, HDFC Securities 13:34 (IST) 04 Oct 2018 Rupee continues to trade weak, now at 73.66/$ The Indian rupee continued to trade on a weak note amid rising crude oil prices and negative domestic equity markets on Thursday and traded at 73.6362 against the US dollar. The rupee traded a little recovered from its fresh record low of 73.8175/$. 13:29 (IST) 04 Oct 2018 Dollar perched at 6-week highs on U.S. yield surge The dollar held at a six-week high on Thursday as an overnight jump in U.S. Treasury yields on the back of strong data prompted investors to add long bets in the greenback against higher-yielding and emerging market currencies, reported Reuters. Yields on benchmark ten-year U.S. Treasury yields jumped nearly 12 basis points on Wednesday, climbing to 3.23 percent, its highest levels since mid-2011 after private payrolls data was stronger than forecasts. 13:28 (IST) 04 Oct 2018 Global market UPDATE: European shares weighed down by defensives; banks get yield boost European shares fell in early trade on Thursday, led lower by defensive stocks, while banks tracked gains by their U.S. peers after strong data lifted Treasury yields to their highest since mid-2011, said a Reuters report. The pan-European STOXX 600 benchmark index was down 0.5 percent by 0726 GMT. Germany's DAX also declined 0.5 percent and the UK's FTSE fell 0.6 percent. Defensive companies including consumer and healthcare stocks were the main drag on the STOXX. Shares in British American Tobacco, Nestle and Novartis were down between 0.6 and 3.7 percent. Their losses were partly offset by gains among banks , which tend to benefit from rising rates and bond yields. German lenders Commerzbank and Deutsche Bank were up 1.9 and 1.5 percent respectively, as German 10-year bond yields hit a 4-1/2 month high. 12:48 (IST) 04 Oct 2018 Sensex recovers from 850 points fall; Yes Bank top gainer The BSE Sensex recovered from its over 850 points fall and traded 696.34 points or 1.94% lower at 35,279.29 points. The slight recovery was led by gains in Yes Bank, L&T, Vedanta, Axis Bank and Tata Steel shares. 12:12 (IST) 04 Oct 2018 Reliance Industries shares' steepest fall in 2018; down 7% Shares of Reliance Industries marked the steepest fall this year, falling 7% to an intra-day low of Rs 1,120 per share on the BSE. Meanwhile, the Sensex slumped 858 points to an intra-day low of 35,116.82 points in afternoon trade deals on Thursday. RIL was the top Sensex loser. Read more here: Reliance Industries share price tumbles 7% today in steepest fall in 2 years; trading volumes surge 11:59 (IST) 04 Oct 2018 Share market live! Sensex tanks 800 points, Nifty tests 10,600; RIL down 6% The BSE Sensex extended losses during late-morning trade deals on Thursday and plunged 812 points to an intra-day low of 35,163.28 points. The Nifty tested the 10,600-level and hit a low of 10,605.45 points on huge sell-off across all sectors. Mukesh Ambani-led Reliance Industries slumped 6% and was the top drag on both the Sensex and Nifty indices. 11:38 (IST) 04 Oct 2018 BSE Live: Sensex down 700 points! The Sensex tanked 717 points to an intra-day low of 35,257.93 points during late-morning trade deals. Around 11.35 am, the Sensex was trading 716.24 points or 1.99% lower at 35,259.39 points. Reliance Industries remained the top drag on the BSE Sensex, down 5.09%. 11:33 (IST) 04 Oct 2018 Share market LIVE: Check out the buzzing stocks in trade today Apollo Tyre, Bharti Airtel, IndiGo, Bombay Dyeing were among the buzzing stocks in trade today. 11:29 (IST) 04 Oct 2018 SC grants one more opportunity to ArcelorMittal, NuMetal to bid for Essar Steel The Supreme Court Thursday granted one more opportunity to mining major ArcelorMittal and Russia's VTB Capital-backed NuMetal to bid for Essar Steel if they clear their NPA dues in two weeks, said a PTI report. A bench comprising Justices R F Nariman and Indu Malhotra held that both the firms were ineligible under amended Insolvency and Bankruptcy Code to bid for the firm but granted them a fresh opportunity after taking note of the plea of Committee of Creditors that it does not want liquidation of Essar Steel. The apex court exercised its extraordinary power under Article 142 of the Constitution in allowing ArcelorMittal and NuMetal to make fresh bid for Essar Steel. The top court asked the Committee of Creditors to take a decision within eight weeks on rival bids of NuMetal and ArcelorMittal for Essar Steel. 11:13 (IST) 04 Oct 2018 75/dollar looks on the card soon -- Tradebulls Securities \"Yesterday US ADP number surprised to the upside and ISM Non manufacturing (best since 2005) also came positive propelling DXY higher till 95.70. We anticipate 96.30 levels which means more pain for rupee. In spite of high US crude inventory and private deal between Saudi Arabia and Russia, crude continues to climb and is now above $86 which means added pressure on our currency. Volatile equity market and steep FII outflows from debt market is keeping sentiment negative for our currency. 75/dollar looks on the card soon and trigger for currency would be tone of RBI policy tomorrow.\" -- Bhavik Patel, Senior Technical Analyst, Tradebulls Securities told FE Online . 11:04 (IST) 04 Oct 2018 BSE live! 24 stocks in red; LT, Yes Bank shares gain 24 out of the 30 Sensex stocks traded in the red during pre-noon trade deals on Thursday. 11:00 (IST) 04 Oct 2018 Sector UPDATE: Nifty Bank index in red; Axis, Yes Bank gain The Nifty Bank index was trading with losses during mid-morning trade deals on Thursday, with shares of IndusInd Bank down nearly 3%. Shares of Yes Bank, Axis Bank, Bank of Baroda and PNB bucked the trend and traded with gains. 10:55 (IST) 04 Oct 2018 Hathway Cable hits over 3-month high Shares of Indian broadband services provider Hathway Cable and Datacom Ltd climb as much as 6.3% to Rs 29.50 on Thursday. The company's share price rose to their highest since June 22 after it clarified on Wednesday saying it would not comment on market speculation of acquisition by RIL, in line with Reliance Industries' statement. Hathway's stock had fallen nearly 31% this year up to the last close. Media reports circulated on Wednesday saying Reliance Industries Ltd was in talks to buy Hathway Cables. Read more here: Mukesh Ambani’s Reliance Industries responds to rumours on buying Hathway Cable; here’s what it says 10:45 (IST) 04 Oct 2018 Rupee slips further to 73.82/$ The Indian rupee continued its downward spiral and slipped further to hit a fresh record intra-day low of 73.8175 against the US dollar. Higher crude oil prices and persistent capital outflows weighed heavy on the rupee's sentiment. 10:41 (IST) 04 Oct 2018 Traders bet on oil at $100 as Iran sanctions loom Oil traders have piled into wagers that U.S. crude oil could surge to $100 a barrel by next year, a milestone that until recently many considered unthinkable due to record U.S. production growth and relatively flat global demand, said a Reuters report. But the imminent return of U.S. sanctions on Iran and bottlenecks keeping U.S. oil from getting to market have fueled a rally that has taken benchmark oil prices to four-year highs. While big producing nations say supply is ample, hedge funds and speculators are increasingly skeptical of that argument, betting the market could rally further as sanctions on Iran's crude exports return on Nov. 4. 10:32 (IST) 04 Oct 2018 NSE live! Nifty tanks 200 points intra-day; Eicher Motors, RIL top drags The NSE Nifty 50 index tanked over 200 points to an intra-day low of 10,655.95 points during mid-morning trade deals. Check out the top 5 Nifty gainers and losers: 10:29 (IST) 04 Oct 2018 BSE Live! Sensex extends losses, plunges over 650 points; RIL down over 5% The BSE Sensex extended losses during Thursday's mid-morning deals, plunging over 650 points to an intra-day low of 35315.91 points. Reliance Industries was the top drag on the Sensex, down 5.4%, followed by Hero MotoCorp, TCS, HUL, HDFC and Bharti Airtel. 10:22 (IST) 04 Oct 2018 Sector UPDATE: IT index falls despite weak rupee; Tech Mahindra down over 4% The Nifty IT index traded with losses during mid-morning trade deals on Thursday despite a weak rupee. Tech Mahindra was the top drag on the index, down over 4%. TCS and Infosys shares were trading lower by up to 3%. 10:19 (IST) 04 Oct 2018 Petrol price today reaches Rs 84 in Delhi On Thursday, oil marketing companies (OMCs) raised petrol and diesel prices by 23 paise adding more pain to the common man. The petrol and diesel prices in Delhi today are Rs 84 per litre (increase by Rs 0.15) and Rs 75.45 per litre (increase by Rs 0.20), respectively. Check for petrol, diesel prices in Mumbai, Chennai and Kolkata here 10:15 (IST) 04 Oct 2018 Rupee extends losses, at 73.80/$ The Indian rupee extended losses and slipped further to hit a fresh record intra-day low of 73.7962against the US dollar during mid-morning deals on Thursday. The rupee collapsed to a fresh low against the US dollar on Thursday, as global oil prices continued to rise, deepening concerns about the current account deficit and capital outflows. 09:55 (IST) 04 Oct 2018 Share market live: All sectoral indices in red, barring metals All the sectoral indices faced heavy selling pressure and traded in the red, expect the metals index, which traded 0.86% higher. 09:53 (IST) 04 Oct 2018 Mukesh Ambani emerges richest Indian for 11th consecutive year: Forbes Reliance Industries' Chairman Mukesh Ambani has emerged as the richest Indian for the 11th consecutive year with a net worth of USD 47.3 billion, according to Forbes magazine. Ambani is also the year's biggest gainer, adding $9.3 billion to his wealth amid the continuing success of his Reliance Jio broadband telco service. As per the 'Forbes India Rich List 2018', Wipro Chairman Azim Premji has retained the second spot, adding $2 billion to his wealth at $21 billion; while ArcelorMittal Chairman and CEO Lakshmi Mittal moved a place ahead to the third slot with a net worth of $18.3 billion, increasing his wealth by $1.8 billion. 09:51 (IST) 04 Oct 2018 Larsen & Toubro to buyback shares upto Rs 9000 crore India's infrastructure major Larsen & Toubro has announced a share buyback programme for Rs 9,000 crore. The company has cash and liquid assets of about Rs 17,425 crore and a consolidated debt of Rs 1.08 lakh crore. The buyback offer will be made via the tender offer route and about 6 crore shares aggregating to 4.29% of the total paid equity share capital – will be bought back. Know more about the buyback here 09:44 (IST) 04 Oct 2018 Rupee hits new record low of 73.76/$ in early trade The rupee plunged to a fresh low on Thursday hitting 73.76 per dollar in the early trade as sharp rise in oil prices heaped more pressure on the currency. The partially convertible rupee closed at 73.33 on Wednesday. Amid fall in domestic currency, benchmark 10-year bond yields hit 8.20 percent in opening trade as against previous close of 8.11 percent. Read more here: Rupee hits new low of 73.76, falls 43 paise against USD; bond yields rise 09:37 (IST) 04 Oct 2018 NSE Live: Check out the most traded stocks in first 15 mins of trade RCom was the most traded stock by volume in the first 15 minutes of trade on Thursday. Check out the other stocks: 09:23 (IST) 04 Oct 2018 OPENING BELL: Sensex plunges 600 points, Nifty at 3-month low The BSE Sensex plunged over 600 points to an intra-day low of 35,341.68 points in early trade on Thursday. The Nifty plunged to a three-month low. 09:15 (IST) 04 Oct 2018 Dollar lifted by yield surge, Asia stocks slugged The dollar notched an 11-month top on the yen on Thursday as stunningly strong U.S. economic data drove Treasury yields to their highest since mid-2011, while Asian stocks were pressured as borrowing costs rose at home, said a Reuters report. Higher U.S. yields are anything but favourable for emerging markets as they tend to draw away much-needed foreign funds while pressuring local currencies. Bond prices fell across Asia and long-term Japanese yields reached ground not visited since early 2016, a market tightening not warranted by domestic economic conditions. 09:14 (IST) 04 Oct 2018 Market Pre-open: Sensex down 155 points, Nifty below 10,800; rupee at fresh record low of 73.76/$ Sensex live: The BSE Sensex plunged 155.10 points or 0.43% to 35,820.53 points in the pre-open trade session on Thursday. The NSE Nifty slipped below the 10,800-level, down 103.55 points to 10,754.70 points. The rupee slumped to a fresh record low of 73.7688 against the US dollar. 09:06 (IST) 04 Oct 2018 RUPEE opens at fresh record low! The Indian rupee opened at a fresh record low of 73.6712 against the US dollar on Thursday. The rupee had closed at a new record low of 73.3412 per dollar on Wednesday, Bloomberg data showed. The rupee had breached the 73/$ mark for the first time yesterday. Share market HIGHLIGHTS: The Indian stock markets closed Wednesday's trade in the negative territory with the BSE Sensex slumping over 590 points intra-day and closing below the 36,000 level, down 550.51 points or 1.51% at 35,975.63 points. The Nifty tanked 150.05 points or 1.36% to end at 10,858.25 points.",
    "url": "https://www.financialexpress.com/market/share-market-live-updates-indian-stock-market-indian-rupee-vs-dollar-sensex-nifty-live-yes-bank-hdfc-ilfs-group-stocks-omc-stocks-crude-oil-lt-buyback-thursday-october-4-1336472/",
    "original_url": "https://news.google.com/rss/articles/CBMivwJBVV95cUxNczRXdENQalc4NExTU0M2MF9TME4xSWY0SWpac3huMG5qMzdEeFZzZWhLTFE0R3VBenE1aERxZjlKT0hiZ09RT1ZLV21yb09UQTJrVmxadTh2Tk9oYjVDNFZTVzFVQVd1NHRkaDlBQ3FxQUZCYVZXSGttTGgtQlFvY0c0bXhzakV2ZE1xeGdTM3NXRVp1OGFOcmpDa3NXcTY2WGRpY29hZkdycnhxU2FBX2ZzUFYzdkI3akp5cFFKX3dDMTR0eFQ2QzVaNmlRODRTVEIyc29nZGdoY3lLRFN3bHZLMmIzbTZoTjN0UlVWLUlTM3hwdU0ta1BJNUV5U3pFaWtTeHVqLWRlUDlEV2RQd1RadFE5Qmw5UExQRlAta3BDdWFtMVpzbDdKWXJXZEQtUm05ZkVXV1d3RVdmSHdF?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 21312,
    "word_count": 3606,
    "gnews_title": "Share market HIGHLIGHTS: Sensex down 806 pts, Nifty ends below 10,600; rupee at record low; OMCs bled up to 21% - financialexpress.com",
    "published_date": "04/10/2018",
    "publisher": "financialexpress.com",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "MARKET WRAP: Sensex slips 107 pts ahead of RBI policy outcome; banks fall",
    "body": "Photo: Shutterstock.com Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Dec 04 2018 | 8:15 AMIST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/article/markets/markets-live-bse-sensex-nse-nifty-indices-asian-markets-hul-gsk-118120400126_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPZXo2bFNDV2lfRFlnZ0M3NTVkZlZtN1BXbm1pQUU5ZHJfb21ORl8tdnpHVUdFUlBWQ2NOZExrdVVZNGppQ0NDSGJFTGluY3oyREo0V2tMaEUwY2NaTkhjc1ItanRMSDBXSWZ3cVRGbGlaS2N6U0tpOVlabVJPMEF1RVdOemdxSFVTMWg4X1VnaG5WVTdtSnF1eV8xay1zN3ZjU0daQl90VW5CNkJrd2ZoRmtyUFRTY3RNampRQTFfaklZRjFiaWhNMm1GRFYwUdIB0wFBVV95cUxNalJpMnY3MXJGc1dMZWxua1lZTFpwbEhNNmF3M3R4RUhkSzJlZXZvZWFhQzFsS3F4S0JZREtLc0VGTmtCeGVOUkxFTXc2MHhtWVVSR19HTDM1Zm9iQVc1SjYyTVBJa3VnVVN4ZW1HSG5jYlFiVjFJMENnVHl2TDd6a05qclZhdFI1NFVoYzVuWnU3R3UzbHFnNDRqX0lVZmNPUVFTdW5ibnU0NWVZMURSNHBIVjk4LXNaeFBsWWl4blBMYnRDb1NFRzRxNUxkalYwMlBn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 513,
    "word_count": 83,
    "gnews_title": "MARKET WRAP: Sensex slips 107 pts ahead of RBI policy outcome; banks fall - Business Standard",
    "published_date": "04/12/2018",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  }
]