[
  {
    "title": "Stock Market Holidays 2022: Indian equity and currency markets closed on account of Gurunanak Jayanti",
    "body": "Stock Market Holiday:the country’s equity, currency and commodity markets are shut on Tuesday, November 8, 2022, on account of Gurunanak Jayanti. While the equity and currency markets will resume trade on Wednesday, November 9, 2022, commodity markets will resume for the evening trading session at 5 pm on Tuesday. Commodity markets follow two sessions – morning session from 9:00 am to 5:00 pm and evening session from 5:00 pm till 11:30/11:55 pm. Monday, the benchmark equity indices on the BSE and National Stock Exchange (NSE) continued their gaining momentum for the second consecutive session aided by gains in public sector banks, auto and metal stocks amid positive global cues and a fall in crude prices. TheS&P BSE Sensex rose 234.79 points(0.39 per cent) to end at 61,185.15 while theNifty 50gained 85.65 points (0.47 per cent) to settle at 18,202.80. Therupee appreciated by 43 paiseto close at a one-month high of 81.92 against the US dollar on Monday amid a weak American currency and sustained foreign fund inflows. Favourable comments from the US Federal Reserve also boosted the forex market sentiment. Commenting on the outlook for Nifty, Nagaraj Shetti, Technical Research Analyst at HDFC Securities said, “The short term trend of Nifty continues to be positive. The market is now showing signs of sustainable upmove into new swing highs. The next upside levels to be watched around 18,350 and next 18,600 levels in the next 1-2 weeks. Immediate support is placed at 18,100 levels.” Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/indian-stock-share-money-currency-bond-commodity-markets-shut-gurunanak-jayanti-november-8-8255645/",
    "original_url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxOQlFQSTl6bGJ1aTNrT2hNUllQMzZ4enpFd0RiVFpxWkViS1pNdDl6Y3BLdi1ybFU2MEhhQmh1U1FEZWctWmRuQW1yN2l6STZGWEdSMGpDcUY2SEVDdVlUUjNKWV9rWnRkeDBtdkxQNXZmSFlxMExHVmRYUzNEUDBsLUp5dVBRQVlzQThXRjZiOFFRb1NIQ2pnd0NnbDhYakMtMEdoWlp1aE41YWxUNXJHbFNYYUdYaGZBd3hXRU9JSEhnVVpfNEZWZjNuM1owQ0ItZnB5dGlnZ3FzWF9oRTU3RWZ0a9IB6gFBVV95cUxNQjl1VXdSeExoaTdkeEpjNFlZLTBDUUVEcUxfLXl1WXB1UVVFcUdrWjJTMkNiWlYyakJZMDZxNVRXU19KRFVLYnpELXNxbTgyaF9HZ0N4aE1aUWNlWnF2Ni1Nd0xkWFJUX1hTaFZwWllQUmRxdDFKU01VYk9SS0lnM0tpWVRlaHZGUlU0X0twMzdVSmtMakpRdi1VMDc0NmxyN0h1SXgzZ3VUNmZabkFRNjZNVUllTG0wSV9DWXlLaDdyaGdaTmp5RjdRbUEtS05zekxfQjViWjJOd0RmY2lBNmxGRzFCS1NjS0E?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1898,
    "word_count": 308,
    "gnews_title": "Stock Market Holidays 2022: Indian equity and currency markets closed on account of Gurunanak Jayanti - The Indian Express",
    "published_date": "08/11/2022",
    "publisher": "The Indian Express",
    "topic": "BSE Sensex India stock market"
  }
]