[
  {
    "title": "Covid-19 and the Indian stock market movement",
    "body": "From United States to Japan , over 180 geographies have reported a confirmed case of coronavirus and almost everyone on this planet is adversely affected by this virus. An event of this scale would bring along many catastrophic consequences- social and economic. Many pundits have already declared COVID-19 as the “Black Swan” of 2020 with global economies starring at one of their worst recessions ever. There is something strange happening in the stock markets across the globe, especially India. To say the least, it seems like the markets are either not paying adequate seriousness to the pandemic or anticipating the discovery of a vaccine more optimistically when compared to the rest of the world. The bounce back to pre-COVID levels has left many investors in ambiguity. This piece is not about predicting what will happen to the markets going forward rather it talks about what could be a possible explanation to the path markets followed since the announcement of lockdown in India. Before we get into the numbers, almost all of us would agree that the Indian economy has never experienced such a massive shock- to both demand and supply in its recent past. The world of 2020 is in uncharted waters. While enough has been written about the increase volatility in the markets, below is some analysis on the daily movement of BSE Sensex for past 10 years. The analysis is based on the number of days the index gained or lost 1 per cent or more. This clearly shows how 2020 stands as an outlier when compared to 2011-2019, with approximately six months to go from here. 2020 stands tall among all these years with roughly having a 1 per cent or more gain/loss every second trading day. Take a look at this analysis from historical data. The above line represents the ratio of days the index gained 1 per cent or more to days when it lost 1 per cent or more. At 1.32, it is almost equal to the highest value which was 1.33 back in 2017. The line below depicts the index return for that year. There is a sharp divergence in 2020 as shown by the data. With a gain to loss ratio of 1.33, 2017 closed with a gain of 28 per cent but 2020, with a ratio of 1.32 has a return of -9 per cent so far till July 22nd, 2020. This means, the change in index in 2020 is skewed towards bigger negative values. The next graph makes this case stronger. Remember we have over five months to close this year. The frequency of the daily market moves is also exceptional. Of the 13 times when Sensex lost 2.5 per cent or more in 2020, seven came in the month of March. While it is relevant to draw comparison to the Spanish flu pandemic of 1918 with COVID-19 for medical reasons, no such event exists to draw parallel of COVID-19 and its impact on Indian financial markets. Though the mortality rate of COVID-19 is less when compared with Spanish flu, the implications for economy are far more severe. Back in those times, supply chains were not interlinked as they are today. One of the possible explanations of the markets reacting so sharply to COVID-19 in March is the supply chain integration across the globe. Recent developments have led to heavy reliance on geographically expansive supply chains and the ubiquity of just-in-time inventory systems. Both are highly vulnerable to sudden supply disruptions. While disruptions to international supply chains surely have contributed to a contraction in economic activity, but that might not be complete answer. If this was the case, the markets should have reacted when China went into a lockdown or when pandemic was at its peak in Europe. Another possible explanation could be the role and contribution of services in our GDP. Long distance travel has become common supporting tourism and hospitality sectors and facilitating commercial activity in education, entertainment , and other sectors. While we use technology in every sphere of life, the structure of economy has also evolved where interactions take place in proximity. An abrupt and compulsory lock down imposed on 1.3 bn Indians brought about uncertainty of future. Once people adjusted with the new normal of staying indoors, the odds of Sensex falling by 2.5% or more became less. I recognize that these conclusions have a broad bush character and there is much room for further investigations into the relative importance of voluntary social distancing efforts and government restrictions, as well as studies that seek to quantify the role of restrictions. There is also much room for research into the stock market reactions to fiscal and monetary policy actions during the 2020 pandemic.",
    "url": "https://www.investindia.gov.in/team-india-blogs/covid-19-and-indian-stock-market-movement",
    "original_url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNSHF0ZWxsSFR5QzFZa3UwYkFPaTg0VTB1UXVZcTFhaXM0NTFnN0JoVTZZZnExaHRvcTA3aWJBSVRudzBMUTRoUXMwM05CM2xPN2drRWV6LWswTkRCWDAxRk9QRXBmRjdSTzc3Wm1uY3pyci1CZjE1WVpsRm4tcjgtWGJRQndDd2xXMHgzVHZ1cWNjNzg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4594,
    "word_count": 787,
    "gnews_title": "Covid-19 and the Indian stock market movement - Invest India",
    "published_date": "24/07/2020",
    "publisher": "Invest India",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "India's BSE Sensex crosses 60,000 mark with tech stocks in lead",
    "body": "A man walks past the Bombay Stock Exchange (BSE) building in Mumbai, India, March 6, 2020. REUTERS/Francis Mascarenhas/File Photo Purchase Licensing Rights , opens new tab BENGALURU, Sept 24 (Reuters) - Indian shares scaled record highs on Friday, with the benchmark S&P BSE Sensex topping the 60,000 level for the first time on the back of gains in tech and property stocks. The blue-chip NSE Nifty 50 index (.NSEI) , opens new tab rose 0.47% to 17,907.5 by 0354 GMT, and the Sensex (.BSESN) , opens new tab was up 0.49% at 60,180.62. Get the latest news from India and how it matters to the world with the Reuters India File newsletter. Sign up here. Indian shares were on track for their fifth straight weekly gain, which analysts attributed to diminishing fears of a possible third COVID-19 wave due to a quick-moving vaccination campaign. Tech stocks (.NIFTYIT) , opens new tab jumped 1.6%, with Infosys Ltd (INFY.NS) , opens new tab rising more than 2% to be the biggest gainer on the Nifty 50 index. Reporting by Soumyajit Saha in Bengaluru; Editing by Subhranshu Sahu Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Read Next 4 hours ago India category India central bank holds rates, leaves room for December cut 1 hour ago Sustainability category Spooked by AI, Bollywood stars drag Google into fight for 'personality rights' 5 hours ago India category India's September manufacturing growth cools as price rises soar to 12-year high, PMI shows 31 mins ago India category Indian benchmarks snap losing run on cenbank lending boost 4 hours ago India category India set for $8 billion IPO rush in year-end blitz 8 mins ago India category India says highly unlikely that UN peace forces will be deployed in Ukraine, Gaza",
    "url": "https://www.reuters.com/world/india/indias-bse-sensex-crosses-60000-mark-with-tech-stocks-lead-2021-09-24/",
    "original_url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQSUMyZlJEMVFJb3RwaVd0dnVuNVBLQVVLUndsQ3lQb3EtZ0lUb0tQVG1PZ0d4ZndmeDhJT0FCNW0zVG5UVFZBRThzSGxqN2JMUldCcmNCWEhDeWVhb2xHbkR0TDdlNVppT28ydUttbGJTSXRJUEVySFVMMzZuZlR5clNCSXpCNmMzNXNySUt0eHBKeVJ3b0ZiRnpiamFUWWFnazlfSWI0aVh1QQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1811,
    "word_count": 306,
    "gnews_title": "India's BSE Sensex crosses 60,000 mark with tech stocks in lead - Reuters",
    "published_date": "23/09/2021",
    "publisher": "Reuters",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Market Highlights: Sensex falls 525 points, Nifty ends below 17,400-mark; Metals, banks, autos crack",
    "body": "Bombay Stock Exchange (BSE) in Dalal Street (Express photo by Nirmal Harindran) Share/Stock Highlights: The frontline equity indices on the BSE and National Stock Exchange (NSE) ended around 1 per cent lower on Monday tracking weakness in the global market. The S&P BSE Sensex crashed 524.96 points (0.89 per cent) to settle at 58,490.93, while the Nifty 50 ended at 17,396.90, down 188.25 points (1.07 per cent). Both the indices had opened in the red but pulled back initially in the morning trade. However as the trade progressed, the benchmarks skid in the afternoon trade amid a selloff across metals, banking and auto stocks. Story continues below this ad Tata Steel was the worst performer on the Sensex pack skidding 9.5 per cent on Monday. It was followed by State Bank of India (SBI), IndusInd Bank, Housing Development Finance Corporation (HDFC), Dr. Reddy’s Laboratories and Mahindra & Mahindra (M&M). On the other hand, Hindustan Univeler (HUL), Bajaj Finserv, ITC, HCL Technologies and Nestle India were the top gainers on Monday. Among the sectoral indices, the Nifty Metal index cracked 6.60 per cent dragged by Tata Steel, Jindal Steel & Power and National Aluminium Company. Apart from this, the key Nifty Bank fell 1.76 per cent weighed by The Federal Bank, Punjab National Bank and RBL Bank. The Nifty Auto index too declined 1.44 per cent driven by Tata Motors , Bharat Forge and Eicher Motors. On the other hand, the Nifty FMCG index, which was the only gainer of the day climbed 0.91 per cent led by HUL, Marico and ITC. In the broader market, the S&P BSE MidCap ended at 24,598.51, down 447.97 points (1.79 per cent) while the S&P BSE SmallCap settled at 27,490.27, down 516.52 points (1.84 per cent). (with inputs from agencies) Live Blog Stocks, BSE Sensex, NSE Nifty, Crude oil prices, gold, silver prices, commodity market and money markets LIVE updates: 16:12 (IST) 20 Sep 2021 MARKET QUOTE | Milind Muchhala, Executive Director, Julius Baer on Monday's market performance \"The Indian markets finally seem to be taking a small pause, largely driven by nervousness in the global markets. Two key factors playing on the minds of global investors include the upcoming Fed meeting and the uncertainty building up in the Chinese real estate market due to stress on one of the major property players in the country. While the markets are keenly awaiting clarity on Fed’s taper plans in terms of timelines and quantum, we believe it may give an advance notice on tapering in this week’s meeting, followed by a formal announcement at the following meeting in November. The pace of tapering is expected to be gradual, and the Fed is expected to continue to remain accommodative in its monetary policy stance, which should be supportive for equities. Regarding the Chinese property major, it may be a bit too early to conclude on any possible contagion effects on global markets. Regarding the Indian markets, a few underperforming stocks/sections of the market, including the PSU pack, have started catching up to some extent, providing support to the headline indices. The breadth of the market, however, seems to be worsening a bit, which is a sign of caution. A small correction would be welcome at this juncture, and help the markets to become healthier, although the bulls are still not willing to give up reins. On the positive side, there is no fear factor currently, and investors seem to be on the lookout for corrections to add positions. With an improving pace and scale of vaccination, the economic environment is also expected to remain supported.\" 16:04 (IST) 20 Sep 2021 MARKET QUOTE | Vinod Nair, Head Of Research, Geojit Financial Services on Monday's market performance \"Following high volatility and weak global sentiments, the domestic market ended in a bear grip with Metal and PSU Banks leading the downward rally. Global markets traded negatively as investors were cautious ahead of multiple central bank policy meetings scheduled this week. However, due to weak US job data and inflation increasing at a slower pace, Fed is not expected to hint on taper plans in the upcoming meeting.\" 15:44 (IST) 20 Sep 2021 Equity markets at close The S&P BSE Sensex ended at 58,490.93, down 524.96 points or 0.89 per cent, while the Nifty 50 settled at 17,396.90, down 188.25 points or 1.07 per cent. 15:17 (IST) 20 Sep 2021 Gold starts week on back foot as Fed meet looms, dollar gains Gold prices were pressured on Monday, hurt by a stronger dollar and concerns the US Federal Reserve might hint at when it intends to begin tapering its asset purchases in its upcoming meeting. Spot gold was little changed at $1,755.84 per ounce by 0847 GMT, having earlier touched its lowest level since Aug. 12 at $1,741.86. US gold futures rose 0.2% to $1,755.00. The Federal Reserve's keenly awaited policy meeting begins on Tuesday. (Reuters) 15:15 (IST) 20 Sep 2021 Copper futures fall on weak demand Copper futures on Monday slipped 1.71 per cent to Rs 708.85 per kg, as participants cut their positions amid muted demand in the domestic market. On the Multi Commodity Exchange, copper contracts for the September delivery eased by Rs 12.30, or 1.71 per cent, to Rs 708.85 per kg in a business turnover of 3,603 lots. Analysts said trimming of positions by speculators due to muted demand in the spot market mainly led to the fall in copper prices here. (PTI) 13:03 (IST) 20 Sep 2021 India Inc expected to dole out 8.6% average increment in 2022: Deloitte survey Corporate India handed over an average increment of 8 per cent in 2021, and early estimates reveal that average increment for 2022 is expected to increase to 8.6 per cent in line with a healing economy and improving confidence, according to a Deloitte survey. As per the second phase of Deloitte’s Workforce and Increment Trends survey 2021, 92 per cent companies gave an increment in 2021 at an average of 8 per cent, compared with only 4.4 per cent in 2020, where just 60 per cent companies had extended a pay hike.",
    "url": "https://indianexpress.com/article/business/market/equity-commodity-money-markets-live-updates-stocks-shares-bse-sensex-nse-nifty-rupee-crude-oil-gold-silver-metals-prices-september-20-7520896/",
    "original_url": "https://news.google.com/rss/articles/CBMinAJBVV95cUxOWDFsQmVjX3E5dE91S0JIU29NY3ZfUEVVdGtQRDdTVkhiUGV3SGlhZHlvUnJJZmFFMjVNZGVRYklTT2hMRk9oLWZfa3JuM3pqRy02M254Wlk5a1VYNjhPYzVKNllKTWZoektKUjVGNlROdXktU21jdU1JaEJEYTJPcDA4Z19ta2dyOVdvRmhrME40OUZvU2lCSVQ0TzhPRVQzd1FfT1daQ1drNHVwVmRRdmRZbEg4aTZmRDRqcG1nb1hmdnVub2Q0cDFISjNnbzNEY29nd2Y1UzFpMENwVm9kRC1SXzhleXMybU5md2RNTjdaM2w5NDFxUjN4Q3UtbVhieEt0UDZEMlAyejJQODBwZjIzU2pxLVpBcjB6ZtIBowJBVV95cUxQdGtBRVhwQjNSdTFpWk80WkxXV1Z5aEFhXzN0ZDB4cV9BeEtpa0I0T2k0b2twbmJBaEkxOEFrX1A1NE0zLXE4SlRldVBlbVIwUVl5U3hsTWRhX29tdGJYbW43bzE4UlVkYXppS3lrc09CQzBHX3hfUXJHRTI2Zl9IZEsyVG8wck1WbGpXeDVMTTVHbHNFdVZabEFNM2U0OTdVRVVtOTlXOGZBLWZOTXIxb2tGT1Z1cTBlM2labDdvZlQ0NDBKc3BZRkhUTjNqWE1FQmZDSnUtNWk4RlU3OFVXTjEyaG9fM0ozMmtLamkySGtrU21hbmVMX3duWWJmY3NGLVBjbDNBSEFGMHBKaEtpQ2syb3Ywd0EtRFZGYV9nVFNKUVU?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6004,
    "word_count": 1018,
    "gnews_title": "Market Highlights: Sensex falls 525 points, Nifty ends below 17,400-mark; Metals, banks, autos crack - The Indian Express",
    "published_date": "20/09/2021",
    "publisher": "The Indian Express",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Markets extend losses as Covid-19 cases spike; banking, finance stocks lead fall",
    "body": "10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/sensex-dives-over-1000-points-nifty-below-8400/articleshow/74881990.cms",
    "original_url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQSk53Nnc0NFJiMTZXQnp3ZFU1YmxKeDVBTVVRSEI3Tm55bngyd19XT1ZhblZ3TF8yQUlWUGs0eW1QSGQtREJsTVdSQ0dSUnFER1RWSTljZWNvdG02cXBMdEtGblcwUFdyTzJwa1RiVVdfNjdZdDhfdnExeXFkLVRJYVlkY1QtLVEwSHNWSUdrMHpBamRrVklkcmE3WGptcXJ3UFFuYVpSWlJTQkZObmlNZm42cGlvbFl4eE9oU29lb3BEOGIxdEJQdm1FNNIB0AFBVV95cUxQbGRDNDBhaDlhcHFxTkdhejdRUXZJdXdKblFPSnFNbWdLdm0tQUd6MzRGeEJoVlF5WHF3SXFrV1FOOWgwS25NczdtREVxSjk5MlpZVkZYTDQxMjR0WlJybGYxNktSRnBqRENwRkFMUmpqckNCUi1IWTR2ZUtSaHBiZjRwVWhYZFZPYXRkMzJwMmw3T1RFVUpoWVMzYmNhbE1DdDlITUVYMjMtbFY1b1dWZDcwN0Z3akZ0SkRlN0ItNWw5MnVEZTlXTDFZRllISVVk?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2995,
    "word_count": 519,
    "gnews_title": "Markets extend losses as Covid-19 cases spike; banking, finance stocks lead fall - The Times of India",
    "published_date": "30/03/2020",
    "publisher": "The Times of India",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Share Market: Sensex, Nifty recover marginally before closing bell",
    "body": "After a choppy session, the BSE index ended 44.80 points or 0.12 per cent higher at 38,843.88. The NSE Nifty inched up 5.80 points or 0.05 per cent to close at 11,472.25. Bajaj Finance was the top gainer in the Sensex pack, rallying over 4 per cent, followed by SBI, Tech Mahindra, Asian Paints, Bajaj Finserv, IndusInd Bank, ICICI Bank and M&M. On the other hand, NTPC, Sun Pharma, Nestle India, Tata Steel and L&T were among the laggards. Benchmark indices have again pared all gains and are currently trading in negative territory. At around 2:10 pm, BSE Sensex was down by 26 points while Nifty fell below 11,450 points. Meanwhile, broader markets have yet again outperformed benchmark indices. The rupee on Tuesday closed flat at 74.32 per US dollar. Yash Gupta,Equity Research Associate, Angel Broking:Lupin Ltd got approval from the U.S. FDA for Albuterol Sulfate Inhalation Aerosol, 90 mcg (base)/actuation, a generic version of ProAir® HFA. Lupin’s generic Albuterol Sulphate MDI will be manufactured at its Indore facility in India. ProAir® HFA are indicated for the treatment of acute episodes of bronchospasm or prevention of asthmatic symptoms. Albuterol Sulfate Inhalation Aerosol market had U.S. sales of approximately US$2.9 billion, of which the ProAir® HFA market accounted for US$1.3 billion (IQVIA MAT June 2020).This is one of the very significant approval for Lupin, which has been in the pipeline for some time and will be taken positively by the markets. Sensex and Nitty are off day's high and are currently trading flat. At 12:00 pm, Sensex was trading higher by 90.88 points at 38,889.96 while Nifty fell below the 11,500-mark. Jaikishan Parmar, Sr. Equity Research Analyst, Angel Broking:LIC reported Mixed set of numbers for Q1FY21, AUM increase 6% YoY and steady QoQ, PAT jumped by 34% to Rs.817.48cr. On moratorium front, Individual Home Loans under moratorium accounted for 16% an Approximately 25% of the Company’s total loans under management are in moratorium as of June 30, 2020. NII increase 3% YoY ted below AUM growth primarily owing to compression in NIM. Opex increase by 36%, however, lower provision cost has helped LIC housing to report PAT jump of 34% YoY. Considering the current situation provision taken in Q4FY20 and Q1FY20 is much lower than expected. Currently LIC housing trades at 0.75x of TTM Networth which is lower compare to the historical average. Considering lower valuation and not much negative in result stock could see positive movement for midterm. Sameet Chavan, Chief Analyst-Technical and Derivatives, AngelBroking:Markets across the globe were quite cheerful yesterday morning and hence, we too started off higher above the11400mark. As the day progressed, the positive momentum reinforced after a brief pause; courtesy to smart surge in banking conglomerates. Eventually, the benchmark continued it’s march towards11500, marking highest level since March fiasco. Since last a week or so, we are sounding a bit cautious on the market. But it seems that market is in no mood to give any sort of correction. Actually, on the domestic front, there is no negative news flow which is considered as positive and most importantly, major global markets are clearly unstoppable, which is driving our markets higher. Although we have actively participated in the recent midcap rally, we still continue to be a watchful and would advise taking some money off the table. Because when markets are giving such gravity defying moves, nobody knows when and what’s going to trigger a correction. And whenever it happens, it just comes as a surprise. With a broader view, we remain extremely sanguine but do not want to become complacent here and hence would advise against aggressive longs in the market. As far as levels are concerned,11450-11500is an extended zone for us but with the flow, if it extends further, then we continue to advise booking profits in case if Nifty heads towards11550-11625. The dollar slipped on Tuesday and Asia’s trade-exposed currencies rose after the United States and China both hailed a phone call between their top trade officials as a success --Reuters Sensex and Nifty on Tuesday opened higher for a second consecutive day. BSE Sensex was trading higher by 159.96 points at 38,959.04, while NSE Nifty50 was trading above 11,500 points. BSE Sensex and NSE Nifty50 are trading higher in the pre-opening session. Sensex was up over 100 points in the pre-opening session. Markets are expected to witness strong trade on Tuesday. Several analysts expect markets to open on a positive note on Tuesday after US stocks surged to touch record highs amid hopes of faster vaccine availability to treat coronavirus. European stocks also closed higher and Asian markets have begun the day on a strong note. All of the indicators hint at a strong opening for India markets. Top United States and Chinese officials have showed optimism on resolving issues over the Phase 1 trade deal reached in January and both sides are committed to the success of the agreement, according to the US Trade Representative's Office. US Trade Representative Robert Lighthizer and Tresury Secretary Steven Mnuchin spoke to Chinese Vice Premier Liu He over telephone to discuss the trade deal. This is another reason which boosted global markets. Asian stock markets opened significantly higher on Tuesday following a record Wall Street rally driven by vaccine hopes. The US dollar also found support ahead of the key central bank speech. Strong global cues indicate a solid gap-up opening for domestic markets in India. Domestic benchmarks, Sensex and Nifty, are expected to open higher on Tuesday after a strong rally in global stocks. SGX Nifty trends also indicate that markets in India will open higher for the second consecutive day. Global markets also got a boost after top US and Chinese officials showed optimism on the Phase 1 trade deal between the two countries. But analysts still warn investors and traders to proceed with caution as they expect markets to correct in the near-term.",
    "url": "https://www.indiatoday.in/business/story/share-market-live-updates-august-25-latest-news-bse-sensex-nse-nifty-stocks-oil-rupee-gold-global-cues-1714715-2020-08-25",
    "original_url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxOSFNkTy15ZVNCWVhDVmlUZ2I0X1R2Wmh2OWJFNE1zSVlEcHNTMzRlVVkxVDlMOVM5M1l0UHhKdTc4bVlCekpmLXdpOWF2NXpOdHV1cXVDdzFKR09wbFR4eDl6S0lCaVNXajd0dFgxX1g5Skp6WEN0dlZwWWlYeEdqS3JRNUZIdzBlZVZlR0VBVkhBa0d0VGNSeEd0UVN3QThhTjZjX1MtSE9rTGdqZXU2SXU5Q0daaUUyak5DQVB5Skp1N1pmQUFGeTBkZ1ZrdVg4S1g5ZUJsWTE5NUo4YnRSaGEtbUwzeVV1RXdQbnhjdGFkNjlE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6050,
    "word_count": 981,
    "gnews_title": "Share Market: Sensex, Nifty recover marginally before closing bell - India Today",
    "published_date": "25/08/2020",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "India’s Stocks Post Record Losses as Virus Lockdown Kicks In",
    "body": "Markets Facebook X LinkedIn Email Link Gift Facebook X LinkedIn Email Link Gift Gift this article Add us on Google Contact us: Provide news feedback or report an error Confidential tip? Send a tip to our reporters Site feedback: Take our Survey New Window Facebook X LinkedIn Email Link Gift By Ishika Mookerjee March 23, 2020 at 7:02 AM GMT+5:30 Updated on March 23, 2020 at 3:45 PM GMT+5:30 Bookmark Save Translate Lock This article is for subscribers only . India’s stock indexes posted their worst losses on record, as the world’s second-most populous nation went into a lockdown after the number of coronavirus cases in the country surpassed 400. The S&P BSE Sensex Index tumbled 13% to 25,981.24 at the 3:30 p.m. close in Mumbai - its biggest one-day drop ever since data going back to 1979 -- while the NSE Nifty 50 Index sank by a similar amount. The gauges triggered a trading halt earlier in the day, after a 10% fall within minutes of the opening bell tripped circuit breaker. The regional MSCI Asia Pacific Index lost 3.1%.",
    "url": "https://www.bloomberg.com/news/articles/2020-03-23/india-s-stock-futures-sink-after-worst-week-since-2008",
    "original_url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPSGFMUlpiRFJOTVdRdmgyWHREX2Z1ZFZ3ZUN0VEJZbWhpbzFCX2RDbTc5SUwxcllYSXFxYkJHSW1NZTdnSmxSbVh2TVB3czBELXVkVW1xc0tDMzlQR19xZTdyWDJlS0JEU0w5dmdMZ0liS2JRUHJuTU1zYkhsMkZvNlZFZjlhS0QtR0p5MDdlSWVna0NsRkRheFBTajFoV0Uzcm9iZWlRR2I?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1035,
    "word_count": 181,
    "gnews_title": "India’s Stocks Post Record Losses as Virus Lockdown Kicks In - Bloomberg.com",
    "published_date": "23/03/2020",
    "publisher": "Bloomberg.com",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex rises 307 points, Nifty settles at 10,142; PSU banks, metals rally",
    "body": "The benchmark equity indices on the BSE and National Stock Exchange (NSE) ended around 1 per cent higher on Friday led by gains in metal and banking stocks. The S&PBSE Sensexrose 306.54 points (0.90 per cent) to end at 34,287.24, while the broaderNifty 50settled at 10,142.15, up 113.05 points (1.13 per cent). Both the indices had opened over 0.5 per cent higher earlier in the day. On the Sensex, State Bank of India (SBI),Tata Steel,Bajaj Finance,HDFC Bank, NTPC and Axis Bank were the top gainers of the day, whileTata Consultancy Services(TCS), Hindustan Unilever (HUL),Bajaj Auto,Infosys,Nestle IndiaandHCL Technologieswere the top losers.(see heatmap below) Among the sectors, the Nifty PSU Bank index jumped 6.85 per cent higher led by TheJammu& Kashmir Bank, Punjab National Bank and Bank of Baroda. The Nifty Metal index too rose 3.89 per cent led by MOIL, Hindustan Copper and National Aluminium Company. Here’s how the sectoral indices performed: In the broader market, the S&P BSE MidCap index ended at 12,554.16, up 220.87 points (1.79 per cent), while the S&P BSE SmallCap index settled at 11,855.17, up 290.38 points (2.51 per cent). “Indian indices, led by financials, came back strongly from yesterday’s indecisiveness, amidst positive global cues. The global positive sentiment was driven by additional stimulus measures from ECB. Investors are banking on a global economic recovery, fuelled by central bank policy measures to support the respective economies. Investors need to be a bit cautious since valuations are running high and the expected recovery is not yet visible in the numbers,” Vinod Nair, Head of Research at Geojit Financial Services said in a statement after the market hours. The rupee surrendered all intra-day gains to provisionally close on a flat note at 75.58 against the US dollar on Friday as investors looked for cues to move forward and take positions. At the interbank forex market, the rupee opened strong at 75.38, but later pared gains and finally settled at 75.58 against the US dollar, down 1 paisa over its last close of 75.57. – with rupee inputs from PTI Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/markets-live-updates-stocks-shares-bse-nse-sensex-nifty-6443490/",
    "original_url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQWk5RVGZrcXFUdUtQYVV2TFNwRUN4U3hTLURqcWJxU2h5SGZKUXNaVWVlZUxtYkVlLVl0Nk9kSFhHdjUyRDFYOGEtZkFFYzBsRWpqWnVfQWgzeFRral9Zd1pxY2lSOVliTG9aRGhLOVNjOEx0QTJ2aFlEMldhQzdzZV9sZWRNZ1g1aFFHTVphYlYxdkc4dUJVTUJQNldBTjJaTXhITXpxNldKOFBQWE9JQWtDOW_SAbsBQVVfeXFMTnFyREdiV3hYdEJrN2RFanV3a2xUUzBZSC1XeFRMUW1RWThaeW5pY3YyaWNBWGZLb3pRRnNzR1BiM0g4UU5xQXMyWlZKRVVkMjdGOWg2UUxNS3JHNG1NNUhSaks3cXM1TWs3X2hhczFvMnFtUnMxRWVBVmVOOGRiQUZ2V1M2SUUtNzhXdl9yd1dibzc2dXFMcV9fWW1mZzhidjRVMDg5T1dBanh0TUxTcGR2bXk2TlZ5RW1YMA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2506,
    "word_count": 406,
    "gnews_title": "Sensex rises 307 points, Nifty settles at 10,142; PSU banks, metals rally - The Indian Express",
    "published_date": "05/06/2020",
    "publisher": "The Indian Express",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex rises 524 points; Nifty ends near 10,250; RIL m-cap crosses Rs 11 lakh crore",
    "body": "10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/sensex-finishes-524-points-higher-at-34732-nifty-settles-near-10250/articleshow/76464138.cms",
    "original_url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxNeWNJQ0pnd0x3UWtwSUNMZjgydXRYRjJEbnVsR3pDU0ZCT2IxeFlVNWhWRUJFR0hYUXFFYXlsUHlDOE5vcmVOYWZSS3N6cTRvVDBTS0ZvekQya1JKOUlGeWlQMW1oVGtxVjZwR245cWxIeHB3TzZYVVpUVk16X1lGeXRKR3BXV0VyY1paOW9Zd3ZiTGs5QVJkb3k3VTVoMUNfMnVFQzEtbk0tdXZCajJiMkIwcmdha2JfVEcxcmprTkF2TU4zMTJmSTVFVWZwcEp5bDl0cE9CNDU2NS1WSkxpMVQ2MWtDV0XSAewBQVVfeXFMTzBTaTctaC0xMEZUSktrS0xGSUlhZGJQVmNQWGRqbU1YX3FfbEZkNnFVdHYyRlVocjFRQzBMWUU3UG1nUDl3Vm1jbE9EenBSMDMzY0I4blE4LTExRnoyb19oc0QyUnZlX3RjZzhPVDhiUjhTeElSMEl2S0JncXpvV2hVOE9EMzFuaWpBSElhOEE2Z0ZnR25XdzdVZmQzR1lPRWJMYjNVMEdvXzROY2EzQ2RIby1hX1hRelFWWjJ5Njk4N1ltY3lCaUVINzAwSWo2OER4aWlRM0M2THBZUlZFd2pBcFp4dzhVNS1FY2o?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2995,
    "word_count": 519,
    "gnews_title": "Sensex rises 524 points; Nifty ends near 10,250; RIL m-cap crosses Rs 11 lakh crore - The Times of India",
    "published_date": "19/06/2020",
    "publisher": "The Times of India",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "The evolution of stock indices over the years",
    "body": "Gone are the times when school students were taught stories with the moral of “slow and steady wins the race”. However, in the age of 4 th Industrial Revolution, this moral has adapted itself and now rewards creativity and speed to “win a race.” This is especially true about the global financial sector- more so for the stock indices around the world. One of the most important indicators of any economy is the flagship stock market index of that country, for instance, Sensex in India and NASDAQ for the Unites States. Each day we come across these indices gaining or losing points and financial experts coming up with their targets for such indices. While they serve as a fair proxy to understand the state of an economy, which companies constitute these indexes and how much share does each company’s revenue have in these stock market indices, is also an interesting aspect to be understood. The BSE Sensex or the S&P BSE Sensex is a list of 30 companies that form a part of the BSE Index (Sensex). These companies are taken from diverse sectors and that too with a high market capitalisation. The base value of the S&P BSE Sensex is taken as 100 on 1 April 1979 and its base year as 1978-79, which is why we have taken companies that were there in 1978. The first iteration of the Sensex was dominated by the Tata Group. Over the years, there has been a lot of churn in the Sensex. In its early days, Sensex was dominated by manufacturing companies, there were as many as six Tata companies in the index — ACC, Tata Power, Tata Steel, Tata Motors, Voltas and Indian Hotels. The extended Birla group had another five — Century Textiles, Grasim, Indian Rayon, Hindalco and Hindustan Motors. The Sensex now is less dominated by a few groups although, there are still three Tata companies in the list (TCS, Tata Steel and Titan). There was hardly any representation of banks in the Sensex until the early 1990s but today about 45% of the index is composed by financial sector companies . The latest addition to this list is Shree cements replacing Yes bank. The changing composition of the Sensex tells us two big stories — of the rise of a new generation of Indian firms as well as a broad shift from manufacturing towards services. A similar analysis of United States’ top firms reveals a shift from manufacturing to technology companies. A 100 years ago, US Steel was the world’s largest company by market capital, a title held by Apple Inc. today while other giants like Microsoft and Alphabet not very far either. The top-most five of the Top 10 companies in the Unites States by market capitalization today are technology companies, validating innovation as the “new moral”. An integral component of these firms’ success is their focus to emerging ventures called “startups” through their dedicated accelerator programs. While it is hard to imagine what this list would look like in the year, say, 2070, certainly it would not only be starkly different from what it is today but also would reflect the nature and relevance of finance in the coming years. Due to the emergence of disruptive business models, data has come to be a huge asset today- something that would have seemed impossible a few decades ago. The key to sustain in the business world today is to be creative and fast- a new moral to win the race . Update: On December 3, 2021, Hon'ble Prime Minister Narendra Modi will inaugurate the Infinity Forum on fintech, which among other things will discuss and come up with actionable insights into how technology can be leveraged by the fintech industry for inclusive growth.",
    "url": "https://www.investindia.gov.in/team-india-blogs/evolution-stock-indices-over-years",
    "original_url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNN09TU2dFcVpHckFhUy1Qd2ttZnpfREdsXzdFVkpERE1pR3QxZlh6U2Q1MXE5dW1yRFlsZE5kRjZqNy0zZEQ1ZUFLbTVONXFBLWpQeWVUdU85MXJibHMzSXpGbFVrS0Fuc1ZpeVNSUHRWZG1zVWdzel93eTRLUmh0OHZZSVkxRWowSmc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3593,
    "word_count": 627,
    "gnews_title": "The evolution of stock indices over the years - Invest India",
    "published_date": "04/03/2020",
    "publisher": "Invest India",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex and Nifty settle at record highs on positive global cues; banks, IT stocks rally",
    "body": "The domestic benchmark indices on the BSE and National Stock Exchange (NSE) settled at their lifetime high on Monday taking cues from their global peers which rose following Joe Biden’s victory in the US presidential election. TheS&PBSE Sensexscaled 704.37 points (1.68 per cent) to settle at itsrecord high of 42,597.43, while theNifty 50too ended at alifetime high of 12,461.05, after rising 197.50 points (1.61 per cent). Earlier in the day, both the indices had opened over 1 per cent higher and scaled their respective record highs inintraday tradewithSensextouching42,645.33andNiftyrising to12,474.05. Gains on the BSE benchmark were led byIndusIndBank,Bharti Airtel, ICICI Bank, Axis Bank, Power Grid Corporation of India andTata Steel. Just three stocks ended in the red – ITC,Maruti SuzukiIndia and Bajaj Finserv.See heatmap below Among sectoral indices on NSE, theBank Niftysurged 735.15 points (2.74 per cent) to end at 27,534.10. IndusInd Bank, ICICI Bank and Axis Bank were the top drivers of the key index. Separately, theNifty ITindex rallied 327.90 points (1.53 per cent) to settle at 21,820.15. Here, Coforge, Larsen & Toubro Infotech andTech Mahindrawere the top gainers. Here’s how sectoral indices performed: In the broader market, theS&P BSE MidCapindex ended at 15,560.10, up 155.34 points (1.01 per cent), while theS&P BSE SmallCapsettled at 15,304.72, up 86.71 points (0.57 per cent). “Firm global cues and a clear majority to favorite democrats party in the US election took main benchmark indices to all time high. The rally in the domestic market was also led by Banking and Finance stocks on improved business outlook post Q2 results, end to moratorium and bounce back of economic activities. Broader market has shown under performance compared to headline peers as investors feel safer chasing heavyweights during high market levels. We expect more stimulus measures are required to boost the economy and announcements regarding the same from the government is expected in the near future that can further accelerate our domestic market,”Vinod Nair, Head of Research at Geojit Financial Servicessaid in a post-market statement. World stocks hit a record high on Monday and the dollar stayed weak as expectations of better global trade ties and more monetary stimulus under US President-electJoe Bidensupported risk appetite. Markets started to trade on the prospect of a Biden presidency and a Republican-controlled US Senate last week, but the Democratic candidate’s projected victory on Saturday gave more fuel to the move. The MSCI world equity index, which tracks shares in 49 countries, rose 0.5 per cent to a record high in early European hours. On Friday, it posted its biggest one-week gain in nearly seven months. E-mini futures for the S&P 500 jumped more than 1.4 per cent on Monday. Nasdaq futures rallied more than 2 per cent to just under a record high, signalling a positive start for US markets. MSCI’s broadest index of Asia Pacific shares outside of Japan jumped 1.3 per cent after hitting its highest since January 2018. The pan-Europe STOXX 600 climbed 1.5 per cent to one-month highs by 0846 GMT. — global market input from Reuters Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/indian-share-market-live-updates-bse-sensex-nse-nifty-stocks-global-cues-7021455/",
    "original_url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPSmZaaFk2ZV9uZXRjbEYtcDZwUDBlYmJQNi0tSHpOemREZ0MtbGtRZ2otWHBPOE42NDNmNDIxMHRNNEFLVUpvMkZSVENkZkJNVDNvWnJVYUVDN1RyWGwzVlJQdW5wYVA4WXZScVNaRm00VW9MaXZjMjNzT3VPSlAyZzVoQlowZW1ETi1TNmE1SXlOa1BuNkxFeFV6eVVEcFJKd20yVW9mZUVxb0gwWnpqeTZVY2NHS05GNlJJSnpXTEp0bS1FR2dGQU1FMNIB0gFBVV95cUxPUndIcHNqS0pVbzhGR0tuQ1hNLVZYdzZkY25ZU1BXSjBEQ19fN3RYWFFKbkIxQXNfQU9UVjN3NmQ2RGxGSl9vcXpGaGMxcVZtUDhEc2JueHJGYkN0MjlNdV9hY005QjVhc0gwOXlBVElaMkdPcFRjdkhCSjhBLXhrOHVULV9UclhFNzZOVXlNQ0lIa1RTclYtWmVQWVZPMGpZNnI3U3pmbnBUU2dYSjRtX0JYSWpJSDR2eGNUcFJab0NpRTVrRWNha2h5bzNYRzhyQ3c?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3577,
    "word_count": 567,
    "gnews_title": "Sensex and Nifty settle at record highs on positive global cues; banks, IT stocks rally - The Indian Express",
    "published_date": "09/11/2020",
    "publisher": "The Indian Express",
    "topic": "BSE Sensex India stock market"
  }
]