[
  {
    "title": "Sensex jumps 800 points: 5 reasons why stock market is rising ahead of Budget",
    "body": "The stock market surged in the afternoon session on Friday, a day before Budget 2025, with the Sensex and Nifty gaining almost 1%. While the S&P BSE Sensex surged nearly 800 points to reach a day's high of 77,537.12, Nifty gained almost 300 points, both extending their gains for the 4th consecutive day. The S&P BSE Sensex was up 766.21 points to 77,526.02, while the NSE Nifty50 climbed 275.10 points to 23,524.60 as of 1:30 pm. Below are the reasons behind the market rally on Dalal Street ahead of the Union Budget 2025 presentation: Investors are hopeful that the government will announce policies to support economic growth. Expectations of tax relief, higher spending on infrastructure, and incentives for key industries have boosted market sentiment. A strong push towards manufacturing and job creation could further improve the economic outlook. Shares of IT, auto, and consumer durable companies have been among the biggest gainers. Trivesh, COO of Tradejini, said, \"Investor optimism is driving market sentiment, fueled by expectations of policy measures that could support economic growth. Historically, Budget Day has been volatile, but data shows that Nifty has closed positively after the Budget in 12 out of the last 18 years since 2010. While initial reactions may be mixed, markets often recover if key measures align with expectations.\" Market experts believe that possible tax relief for individuals and businesses could boost spending and investments. Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, said, \"Since we are heading into the Budget without a major pre-Budget rally, the chances of a post-Budget rally are higher if the government introduces growth-boosting measures like cuts in personal income tax. However, it is important to note that the Budget's impact on the market will be short-lived. In the long run, stock market trends will depend on GDP growth and corporate earnings.\" Foreign portfolio investors (FPIs) have been selling stocks in recent weeks, but the pace of selling has slowed down. Kranti Bathini, Director of Equity Strategy at WealthMills Securities, said, \"Foreign portfolio investors continue to be sellers, but the volume of selling has reduced significantly. If the Budget offers favourable policies, we may see more buying from both domestic and foreign investors.\" As corporate earnings for the quarter are being announced, investors are looking for companies with strong profits. Stocks of companies that have reported good results are rising, while those with weaker numbers are facing pressure. Analysts suggest that investors should focus on long-term opportunities rather than short-term movements around the Budget. Market direction in the coming days will depend on the Budget announcements. If the government presents policies that meet investor expectations, the rally could continue. However, unexpected changes or concerns over fiscal spending could lead to volatility. Experts advise investors to remain cautious and wait for the Budget before making major investment decisions. (Disclaimer: The views, opinions, recommendations, and suggestions expressed by experts/brokerages in this article are their own and do not reflect the views of the India Today Group. It is advisable to consult a qualified broker or financial advisor before making any actual investment or trading choices.)",
    "url": "https://www.indiatoday.in/business/story/why-is-stock-market-rising-today-sensex-gains-600-points-are-bulls-back-ahead-of-budget-2025-2672779-2025-01-31",
    "original_url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxNSXppTFB4UEZUd0R1T1VLYlFsLWRrTHB4XzZQcFJOZ2VpZENyVkRYaWpSYzBBZUJVX09mSW9WVnZLNUFfMlUwalFKa3ZLamhwMkhZeDRkRWFaeWNhTXVUbTNVTmF5VUhfN3V1SEdCOWVoOV8yNm1vWjdqeTZ2RWJYbDNpQ2xsS0FkVUFjNGYwUW9PUWRBWmlmQmM1MUdTRTVHdkxmWDRTQmxaenlpeUw5cWRhNGZYZ3N0S0p2M0JoRFNjZTkwbFphSkRza2xfR2hfMGxNMUE5UU1mV2s2T0JPckhVLXVkbWvSAewBQVVfeXFMUGdNX0FyU2xQTmE3Zm83T1Y3aUZvdGtxX3hyVlluRUt4ODNTdXFVUGNQSGJZcllmTzFia2luTXdKQ1YzaWJkY19DT0wwdi1aNUs1SGhXek9GSTlRWUYzd3ZxTzMtMmxsZldqV1FZNkhlZjJYcG5HLThZbHE2X2ltVmJTLVBmbWdOZWtBbFFrLWJka1lsdUc1WHNDUXo5WEN0VVhRRi1idEs0RnhnMUwzT2hqbmJoWEk2TEpiUHViWDVLV09sYmo4MFFkNlA1YzdrQXZxMDg2MjBqTnE0d05UN3NqeWcwc3doblFwMVg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3388,
    "word_count": 518,
    "gnews_title": "Sensex jumps 800 points: 5 reasons why stock market is rising ahead of Budget - India Today",
    "published_date": "31/01/2025",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Today: Sensex tanks 824 points, Nifty ends 1.14% down",
    "body": "Stock Market Today:Domestic equity markets witnessed continued selling pressure on Monday on concerns over slowingthird quarter earningsgrowth and outflows from foreign portfolio investors. The 30-shareBSE Sensexdeclined 824.29 points, or 1.08 per cent, to 75,366.17. The broaderNifty 50tanked 263.05 points, or 1.14 per cent, to close at 22,829.15. “Broad-based selling across sectors plummeted the Indian market amidst tepid earnings and weak sentiments across the globe. Weak sentiments were further exacerbated as the US trade confrontation continued, like with Colombia this time, said Vinod Nair, Head of Research, Geojit Financial Services. Analysts expect volatility to remain in the market this week ahead of the Federal Open Market Committee (FOMC) meeting on January 28-29 andUnion Budget2025-26 announcement on February 1. Foreign investors remained on a selling spree due to moderation in economic growth and the rupee depreciation. On Monday, foreign investors net sold Rs 5,015.46 crore of equities, and domestic institutional investors (DIIs) purchased Rs 6,642.15 crore of shares, BSE’s provisional data showed. So far in the current month (till January 27), foreign portfolio investors net sold Rs 67,022 crore of Indian equities, as per the National Securities Depository Ltd (NSDL) data. On Monday, the rupee depreciated 9 paise to close at 86.31 against the US dollar. “A combination of factors like weak US and European market cues, monthly F&O (futures & options) expiry later this week, persistent FII fund outflows, and muted third quarter corporate earnings so far have continued to push investors in reducing their equity exposure,” said Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd. Mid and small caps remained in their downward trajectory over expensive valuations and slowdown in earnings. BSE Midcap and Smallcap indices lost 2.68 per cent and 3.51 per cent, respectively. Strong selling was seen in sectors such as information technology, telecom, metals, oil & gas and realty which dragged the Sensex below the 76,000 mark, Tapse said. The NSE companies that fell the most includedHCL Technologies(4.59 per cent)Tech Mahindra(4.18 per cent),Wipro(3.78 per cent), Hindalco Industries (3.53 per cent) and Shriram Finance (3.22 per cent). Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/stock-market-fall-sensex-nifty-down-9802083/",
    "original_url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPa2lmZktCczFOS2FIZVNYUHJWbEFpdGVCNGxrSms2MmFGN0EzV0hkTzJMMjNILTVrMTlDMmRBSmtPczJva0s4dkZZVENLNU95Ty1jWDdPWWJ3V2MwU0RJODM1V3R4bUpReHc0OWRrdEFZYWNEUFZyaW80bWVBeDNnX0ttcGlDM3BpMlFZZGxLNXc2YmdnQ2VCRjlR0gGgAUFVX3lxTE9kdDJwTm5GYVMwaWpqVGJjcVloMmpWUHFsNGFBM1ZVNTVwY2NhNTlESVdpaVFMR25uY3VlVExaa3duSnVLNkVYWUV6ZlVLVzRIVTVuMFllZlRlZ1NpN2lNTDZ3c1VrOGwxSmFLQlhUQUhUOEU0bG0zTXhFRHU5QjFHbkN1MXJZa08zX3ZuQUp5Y0p2MEJCSVNHVzd4S3lReFQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2677,
    "word_count": 404,
    "gnews_title": "Stock Market Today: Sensex tanks 824 points, Nifty ends 1.14% down - The Indian Express",
    "published_date": "27/01/2025",
    "publisher": "The Indian Express",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "BSE Sensex, Nifty50 special session: Will Indian stock markets remain open for Budget 2025 on February 1, 2025?",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Rekha to Blake Lively - Actresses Who Turned Their Beauty Spots Into Style Signatures Trisha Krishnan’s Effortlessly Elegant Take on Fashion Bhutan’s 10 unmissable spot for nature lovers Meet the Secretary Bird: An elegant hunter of the Savannah Rupali Ganguly's 10 stylish ethnic looks 8 benefits of teaching kids leadership skills early in life Priya Prakash Varrier brings charm to ethnic fashion 8 simple sweet potato dishes for effective weight loss 9 self-help and improvement books that help people rewire and rewrite their lives 8 jewellery ideas that will make your Eid al-Adha 2025 unforgettable! Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/bse-sensex-nifty50-special-session-will-indian-stock-markets-remain-open-for-budget-2025-on-february-1-2025/articleshow/117768068.cms",
    "original_url": "https://news.google.com/rss/articles/CBMingJBVV95cUxQTmpMb0x1ZHZfTGlVbVdYLXBPRUJoamh6QV9maDdKc3JwU1JZN2hZeVNidTctdmo5R1FQOWt4dE1WS0dQWldWUGdrenBWOTNpcXktLUdiS3JnVVpfMXRTbjBsaUxEbGNVT0R3Q0ViRVlHMWhyNFUwUU9KWTRzWENpaUMxb211ellpR1NPeHBwNlBoU3pmUzdoaVNEajRmV3hTWll3YzJQUkV4V1BmQ3dmVjNqUE5WN2lBNmVKS1JrMkdXUTJiM1NUUm9GM19SQUVsU0lZckRXbmkxQW5DZUE4T1liVzh3WmliTkc0SE5yMjlranMxeG92bzVQTXlMN21hamFXNlVwYWhuemtSY2RFVjVlbjUxY0pEMVpTTGxR0gGjAkFVX3lxTFBWTGEydW14NlYyQThMUUIzckN1RmxyS0dVLUNmUXRkanVvYUk3emV0dnZIUTkyR2dIaWUzb2tTYXFmMHdiNGJkYmt3R1pBTThuaWlFREd3cU56dzlacGxzRG5SRHdCMEdRYTlDaXNHN3hxQjVvR1dnN0oyQmdlSjZOTDQxeFJIS201U0RxZmpERHppaEtNRHRLQm14ZlBFcWFDckxRdS1fa0RSTW01SnROcDQ2bllZalc1U1Zib0Q1ai0zV0VrYS1fbDMtdWRlR1Q5ZHJxTFI3S04xekk0WlF0Szk4V2pzNW5RUWUzdXl6bnBoWnZWR0hMTTNnRExjT3VwMUNBLVhBVlJ2RVFERnRSQnVFcldHRVgwM2JxcGJra3RXdw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1635,
    "word_count": 257,
    "gnews_title": "BSE Sensex, Nifty50 special session: Will Indian stock markets remain open for Budget 2025 on February 1, - The Times of India",
    "published_date": "31/01/2025",
    "publisher": "The Times of India",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock market crash: Investors lose Rs 10 lakh crore. What's ahead for D-Street?",
    "body": "Bears took control of the stock market as Dalal Street bled on Monday, extending its losses into 2025. Sensex and Nifty fel over 1%, resulting in a loss of nearly Rs 10 lakh crore for stock market investors. The S&P BSE Sensex fell by 677.78 points to 75,512.78, while the NSE Nifty50 was down 217.45 points to 22,874.75 as of 12:42 AM. Investors on Dalal Street faced losses as stock markets continued to decline, bringing the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE) down by Rs 9.48 lakh crore, settling at Rs 410.03 lakh crore. Experts attributed the sstock market crash to a mix of factors, including weak market sentiment, global uncertainty, and selling pressure from foreign portfolio investors (FPIs). Persistent FPI outflows and profit bookings have added to the volatility, with concerns about key upcoming events weighing on investor confidence. Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, commented, \"This 6-day week is likely to be highly volatile with other major events like the Fed decision and the Budget in India. The market is looking forward to fiscal stimulus through income tax cuts in the Budget. If the expectations are met, there can be a relief rally in the market. But if a rally is to sustain, we need data indicating growth and earnings revival.\" The weak sentiment has been compounded by sustained FPI selling. FPIs have pulled out Rs 69,000 crore from Indian markets in January so far, further contributing to the downward pressure. Although domestic institutional investors (DIIs) have bought shares worth Rs 67,000 crore during the same period, their efforts have not been enough to counterbalance the losses. Global uncertainties have also played a significant role in dampening investor sentiment. Trivesh, COO of Tradejini, said, \"Markets today have declined due to a mix of global and domestic concerns. The market appears to be nervous about the impact of tightening on global liquidity, as the US Federal Reserve is set to announce its next monetary policy decision.\" Adding to these worries are trade tensions and geopolitical risks. \"The rise of China’s DeepSeek AI has raised alarms about the growing competition in the global technology race. Moreover, there is an additional burden of global uncertainty as trade tensions have risen due to tariffs on Colombia,\" Trivesh added. The prospect of new tariffs by the United States is another area of concern. President Trump has reportedly threatened a 25% tariff on Colombia for refusing to take back deported illegal immigrants. Similar tariffs on Canada and Mexico are expected to come into effect from February 1, raising questions about the broader implications of these policies on global trade and economic stability. The prices of crude oil have remained under pressure, reflecting concerns about slowing demand as global growth tapers off. This has added to the challenges for Indian markets, as the country is a major importer of crude oil. Meanwhile, quarterly corporate earnings have been another source of disappointment, failing to provide any relief to the markets. Persistent FII outflows, combined with global risk aversion, have triggered capital flight, adding to the pressure on domestic equities. Domestic investors are also closely watching the Union Budget, which will be presented soon. Market participants are hoping for fiscal stimulus measures, including income tax cuts, to support growth and boost investor sentiment. However, uncertainty around the budget has heightened market volatility, with many investors adopting a cautious stance. Kranthi Bathini, Equity Strategist at WealthMills Securities, said, “Nifty is trading below the crucial 23,000 level. Anything below this creates panic and leads to furious selling. Today, we are witnessing visible pressure in mid-cap and small-cap stocks. Investors are also being cautious due to the upcoming Union Budget and the Reserve Bank of India’s monetary policy decision next week.”",
    "url": "https://www.indiatoday.in/business/story/stock-market-crash-investors-lose-rs-10-lakh-crore-whats-ahead-for-dalal-street-sensex-nifty-2670712-2025-01-27",
    "original_url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxQS1V3X3ROSEpWWE9vOGlUQnNJdlEwNUpmMzd4QWlFMUt0OXQzRV90OFJJT3dlOGtqOW04Q01Nb21uZWFkcDl5NW1HUHBDcnhMRl9IZy05UGxJb1V0NVUyRm5CSV93TlV0VnQ0alhlVlZxMjVpSGFzSXFBLVBXM0lPbEU0b1FOcDdyVVl1bm5vb1czbEkwN2pJbWlsQlBrQllwSklBRTN5Y0FmUTRfcHlQSDFGV0ZqTHZTdzBMckJONzB1a2FDZldFbWF3LWRzY25YWC0yYWo2LVk4bHhkbXhKRzJjcElhNzTSAewBQVVfeXFMTnExV2NfdkE0MWo0ZDdBRm9HSi1aU0VjN1pPZHd3VkFLT01pTmc5UWlJYU9QMEpJOFN5dDNxa1RDbXlETlU4YkpfRW45dGp2TzZWT250Um9tNjlYR0M1VnhGdWVKT0FkaTBPWWtyWWZiU1dKSFA3NzF2cjZxVXYzdnJSeFF4Mk9ENERVdkxJZER0UzdRdENZNGFPVGRwZFdsVHNOUjdscXp0dk1mQk56SUgxRHo5TG5rTFAzdlF2Q1FEaHlwaVdVUEd5SHdIbnplcE9QdXdUSHU5aW54ZjJpSmNzQ24xR3dQMnVCT2I?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4024,
    "word_count": 632,
    "gnews_title": "Stock market crash: Investors lose Rs 10 lakh crore. What's ahead for D-Street? - India Today",
    "published_date": "27/01/2025",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  }
]