[
  {
    "title": "Sensex tumbles 600 points: 3 reasons behind stock market volatility",
    "body": "Benchmark indices in the Indian stock market saw a sharp decline on Friday, reversing the bullish momentum from the previous session. At 10:50 am, the S&P BSE Sensex dropped by 608.97 points, settling at 79,334.74, while the NSE Nifty50 fell 174.40 points, trading at 24,014.25. \"The much anticipated Santa Claus rally didn’t materialize this year, but the New Year rally did make a brief appearance, lasting just for a day. Yesterday, Nifty managed to close above the critical 200 DMA at 24,188, maintaining its strength despite challenges,\" said Trivesh, COO Tradejini. The downturn highlights the persistent volatility on Dalal Street, with investors uncertain about the short-term market trajectory. While auto and IT stocks had propelled a rally just a day ago, profit booking amid prevailing uncertainty appears to have weighed heavily on sentiment. Here are three key factors contributing to today’s decline: After rallying strongly in the previous session, IT and financial stocks faced significant profit booking in early trade on Friday. Market experts attributed the dip to investor caution ahead of the corporate earnings season, which typically brings heightened market fluctuations. The Nifty IT index plunged nearly 2%, making it the biggest loser among sectoral indices. Similarly, the Nifty Bank and Nifty Financial Services indices fell by almost 1% each, dragging down the broader market. This retreat followed a robust performance in the previous session, where the Nifty IT and Nifty Financial indices rose by 2.3% and 1.6%, respectively. Aditya Gaggar, Director at Progressive Shares, had forecasted a pullback in IT stocks and the benchmarks following the sharp rally, cautioning investors against over-optimism. \"Today’s decline can be attributed to profit booking in the IT and financial sectors, where selling pressure was evident after the index tested resistance near 24,196. While major banks continued to display resilience with steady inflows, broader market sentiment reflected caution. Additionally, global cues played a role, with the US markets’ five-day consecutive fall impacting sentiment, even as Asian markets showed resistance. While hopes for sustained momentum were high, the market quickly shifted focus, with traders opting for profit-booking amid cautious global cues,\" said Trivesh. Declines in heavyweight stocks exacerbated the fall in major indices. Shares of HDFC Bank, Infosys, TCS, and ICICI Bank all fell by over 1% during the session. Other notable losers included Wipro, Tech Mahindra, Hero MotoCorp, and Cipla. These large-cap stocks, which hold significant weight in the indices, were critical in dragging down the market, indicating a broader sell-off among blue-chip companies. Growing concerns over the upcoming Q3 corporate earnings season further dampened investor sentiment. Following a weak performance in the second quarter, analysts had highlighted that the Q3 results could set the tone for the market in the coming months. Although there is optimism that the Q3 earnings may show improvement, concerns persist that an earnings slowdown could extend for another couple of quarters. Analysts also pointed out that the trajectory of the stock market will likely hinge on announcements in the Union Budget 2025. A potential increase in government capital expenditure could drive new orders for companies, bolstering their earnings and improving stock performance over time. Today’s market decline underscores the heightened uncertainty and cautious sentiment among investors. As the corporate earnings season approaches and the Union Budget draws nearer, market participants will be closely watching for signs of stability and growth. For now, volatility continues to dominate the Indian stock market. (Disclaimer: The views, opinions, recommendations, and suggestions expressed by experts/brokerages in this article are their own and do not reflect the views of the India Today Group. It is advisable to consult a qualified broker or financial advisor before making any actual investment or trading choices.)",
    "url": "https://www.indiatoday.in/business/story/sensex-falls-over-600-points-3-reasons-behind-stock-market-volatility-2659096-2025-01-03",
    "original_url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNcFEzczBRTm9QcXVNMEhNMDlZSmxYOE9HbFRMNGpwTzIzWkxEYmdKQkk5VjFvcXJJVWtCLXFmSXE3TlFpYmYxM05lYlRHMWdtd3IzeFU1REpmQUdLSXloWHc4VVA5RElUTjZXM0dhX0hLdklSZmxkZnFrSThmVjJFMldsakt3cmZpWk9xWU03cEtnWUpSc2x1T3pLR18xdVJqMTMxbEdDUEFZc213QmU1V0xQb21uTnk3T3ZUanBQbEJFdVZFZHNGNNIBzgFBVV95cUxNdDZfdnVJYzJ4RndqdjNhejkwWFkwRFpPYzlJWUxUOXJ3OUNJbHBoVjFGYXhpMXdJazFrazQwWkw4LWFFQzBHcVVSX0xnZ0pUeTZIb0xXQTJtMko1S3FHR0Uyd3NTNlRDbXpGdGFmbUpVN1VlZGdHakVDSFhHT3FZR3I1Y3g1Q3M5YTMyaGRuYnJGTjNXUTNNYnlQb0J0M0JfdmtuTmFtVkR2dEtrTWZLQUJoNlZJSERxUGtpb2RUb0dDS250TVA5bGZDR2FiZw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4074,
    "word_count": 609,
    "gnews_title": "Sensex tumbles 600 points: 3 reasons behind stock market volatility - India Today",
    "published_date": "03/01/2025",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock market crash: Sensex tumbles by over 700 points, Nifty down over 200",
    "body": "Stock market crash: The Indian stock market crashed during the later trading session on Friday, January 3, 2025, because of falling IT, pharma, healthcare, and bank stocks. At 3:10 pm IST, the benchmark BSE Sensex plummeted by a staggering 749.13 points or by 0.94%, reaching 79,194.58. Meanwhile, the broader NSE Nifty fell by 202.85 points or 0.84%, reaching 23,985.80. Only 13 out of the 30 Sensex stocks and 18 out of the 50 Nifty 50 stocks were in the green. Also Read:What is new ‘jumped deposit’ scam targeting UPI users? Here's how to protect yourself Among the Sensex stocks, Zomato Ltd fell the most by 4.02%, trading at₹273.40. This was followed by Tech Mahindra Ltd which fell by 2.63%, trading at₹1,682.20 and HDFC Bank which fell by 2.56%, trading at₹1,747.50. Among the Nifty stocks, Wipro Ltd fell the most by 3.21%, trading at₹294.05. This was followed by HDFC Bank which fell 2.59%, trading at₹1,747.35 and Tech Mahindra Ltd which fell by 2.54%, trading at₹1,683. Also Read:‘I want dictatorship of Blinkit’: People praise company’s ‘ambulance in 10 minutes' service Among the Nifty Sectoral Indices, Nifty IT fell the most by 1.38%, reaching 43,738.65. This was followed by Nifty Pharma which fell 1.27%, reaching 23,254.20, Nifty Healthcare Index which fell 1.23%, reaching 14,890.20, and Nifty Bank which fell 1.16%, reaching 51,008.95. The crash did not come all of a sudden, with the market opening in the red and gradually leading to it. At 9:30 am IST, the Sensex down by 248.13 points or 0.31%, reaching 79,695.58, while, the Nifty was down by 57.45 points or 0.24%, reaching 24,131.20. Also Read:Vodafone to launch 5G by March, 15% cheaper than Jio and Airtel: Report",
    "url": "https://www.hindustantimes.com/business/stock-market-crash-sensex-tumbles-by-over-700-points-nifty-down-over-200-101735897053708.html",
    "original_url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPVVV5Uk5sZkNqNklSLXo2LTFFaUs0R0Y2T1plbGpsY3R5LWJKaDZTUVNmNjJSUFgwdnJpQXpVZnV6VC1ScVljdWgxV1lvdWo0cXFvTlFMc0xHalRpVGR0R1lwNW9fWHdXbVBQbUt6azFDOFVWa3NiS1dLbHNmN0thc0U4VWY1SkdCYlZmWlB1S2V4Qzh3NWtOV1FRZkdhUHVhOUx1ZGpWMHMxc2ZvbGN0a3dNNEtrdVc1WEpYRkphei03elRfTkZBRTA5Tk9lUdIB0wFBVV95cUxPUTZNMEFxenBqREpacjF2RTlJd181NkFPb3VmdWNkdmdzQmQtTmZESHg1QmM1cXF4SlVNdTlkVWIydkg5M2J0Wlc3eUpNOWJDMk8yQjZ3akw3dGlNRTR4aHBqSEZpMDIwUU9aS1NvSmpGQjlPNDNQSURSX0dzcTNfMUd6ZWFCNnpma0tlZHZhUEM4MTBMekgxWjEtbk54UDduV0MtYlVldXkycFJqT1lPaXdwOFlQN1ZlcGxvQWtpeFR3YlJWZmZ5Zk9kdkd0ZTNNLXY0?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1693,
    "word_count": 280,
    "gnews_title": "Stock market crash: Sensex tumbles by over 700 points, Nifty down over 200 | Hindustan Times - Hindustan Times",
    "published_date": "03/01/2025",
    "publisher": "Hindustan Times",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex nosedives 1,200 points: 3 key reasons behind bloodbath on Dalal Street",
    "body": "Benchmark stock market indices fell sharply after opening higher on Monday, led by a decline in PSU banking sector stocks. The S&P BSE Sensex was down 1165.74 points to 78,057.37, while the NSE Nifty50 lost 366.85 points to 23,637.90 as of 12:02 PM. Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services said that the market is likely to be influenced by the negative factors impacting FII flows and some positive domestic factors which can support the market. The market volatility saw a huge spike and reached 13.20 on Nifty50. The broader markets faced huge selling pressure, with both indices trading in red. Nifty Smallcap100 took a bigger hit, declining 2.50%, while Nifty Midcap100 fell 2.23%. \"The external macro construct continues to be unfavourable with the dollar index at 109 and the 10-year US bond yield at 4.62%. The FIIs are likely to continue selling till the yields decline and the dollar stabilises. Domestically, the December auto numbers indicate that the much talked about urban demand deceleration is exaggerated. Buying will resume in these resilient domestic segments, supporting the market on declines,\" said Vijayakumar. A major reason for today's market crash can be attributed to thediscovery of 2 HMPV cases in India, triggering a market selloff. Two babies were detected with HMPV in Bengaluru hospital with no international travel history on Monday. In a brutal sell-off today, all sectoral indices on the Nifty traded in red, with no sectors managing to stay afloat with Nifty PSU Bank seeing the biggest fall, declining by 3.63%. Nifty Metal bore the brunt of the selling, plunging 2.98%, while Nifty Realty tumbled 2.77%. Nifty Financial Services Ex-Bank dropped sharply by 2.31%, and Nifty Media fell 2.21%. The auto sector wasn't spared either, with Nifty Auto declining 2.05%. Banking stocks faced heavy pressure as Nifty Private Bank fell 1.89%, Nifty Bank dropped 1.88%. Financial services indices also took a hit with Nifty Financial Services 25/50 falling 1.78% and Nifty Financial Services declining 1.62%. The selling extended to other sectors as well, with Nifty Oil & Gas dropping 2.45%, Nifty Midsmall Financial Services falling 2.58%, and Nifty Midsmall IT & Telecom declining 1.97%. Nifty FMCG lost 1.53%, Nifty Pharma fell 1.33%, Nifty Consumer Durables decreased 1.43%, and Nifty Healthcare Index dropped 1.06%. Nifty Midsmall Healthcare showed relatively lower losses but still declined 0.73%, while Nifty IT fell 0.60%.",
    "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-falls-700-points-reason-behind-dalal-street-tumble-nifty-down-2660236-2025-01-06",
    "original_url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxNOF8tX0JLT1Fxd2ZsVkI5aTRpZTNWeXpYcTUzQXgzWkdUWUhISFY5WEp6QjhUWDRCRW0xbnF3V2tYV2hCZ3V0NGJGMDZTaVNsQW5PWHEtVGc2cFBjRlpUYTFtRTlsTFlkSnBWQWR4TEtiT1c3QkNsUjZXVl9iZlhsamItTGRqVWtQUHR6akNpcEVPdWNmbUdPY0FhTlU0Z0duZC1FWVBacmx0MkRIV3lsbm1ZQlROTFNYTmhuUXZGRGpDc19RSTRCeUI5RURuSEhsNzEwem5rbkFWQW1EaGIybdIB5gFBVV95cUxNYnVDajZ0STYwalN3TUwtUFp3c0pmR0wyVjlGSzh1cW9DS2xSVndVaktkZ1pyX1ZKeXFoTVE1ZjhVRXZhT01EUHMwdGZRZ0FYTjQ3WkZueTdEUXN1SzFIckJzeTdTZlRDMlZnRUxDdEVXSk8tVkxSMzktTkNHTGxiTVVhNlRNc3RrZlBITlRQVy02NXpYZ3Z6bG5IV2Q1OTdxY09UTHpnNTUtTHFkd05ZZjBpVG1ab3lJQVJFVlB6ZXZ4OGQwV01qalF2QUw4aGxMZEVZRWZOaURFMWNIemx5WlpRb3Vrdw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2495,
    "word_count": 393,
    "gnews_title": "Sensex nosedives 1,200 points: 3 key reasons behind bloodbath on Dalal Street - India Today",
    "published_date": "06/01/2025",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock market crash: Sensex plummets over 1,100 points, Nifty down nearly 400 as banking and metal stocks fall",
    "body": "Stock market crash: The Indian stock market experienced a crash during the morning trading session as banking and metal stocks fell on Monday, January 6, 2025. At 11:55 am IST, the benchmark BSE Sensex tanked by 1,131.53 points or 1.43%, reaching 78,091.58. The broader NSE Nifty was down by 384.75 points or 1.6%, reaching 23,620.00 All of the 30 Sensex stocks were in the red. Only 1 out of the 50 stocks in the Nifty 50 was in the green. Also Read:Bank holiday on Jan 6: Are banks open or closed on Monday for Sri Guru Gobind Singh's birthday? Tata Steel Ltd fell the most out of all the Sensex companies, dropping 4.48%, trading at₹132.10. This was followed by Kotak Mahindra Bank Ltd which was down 3.13%, trading at₹1,781.50, and Power Grid Corporation of India Ltd which was down 3.05%, trading at₹306.50. Also Read:Indian tech companies take a fifth of all US H-1B visas: Infosys, TCS, Cognizant lead the pack All of the Nifty sectoral indices were in the red. Nifty PSU Bank fell the most by 3.52%, reaching 6,386.25. This was followed by Nifty Metal which fell 2.95%, reaching 8,472.00, and Nifty Realty which fell 2.62%, reaching 1,017.75. The crash came despite the market opening initially in the green. At 9.30 am IST, the Sensex was up by 272.45 points or 0.34%, reaching 79,495.56. Meanwhile, the Nifty was up by 27.60 points or 0.11%, reaching 24,032.35. Also Read:H-1B visa: Here's how much it will cost you in 2025 The crash today appears to be a continuation of what happened during the last trading session of the previous week on Friday, January 3, 2025, when the market closed well into the red after a crash, mostly led by IT, pharma, and banking stocks. The Sensex closed at 79,223.11, which was a huge drop of 720.60 points or 0.90%, while the Nifty closed at 24,004.75, which was a loss of 183.90 points or 0.76%. Zomato Ltd which fell 4.27%, trading at₹272.70, HDFC Bank which fell 2.46%, trading at₹1749.30, and Tech Mahindra Ltd which fell 2.19%, trading at₹1689.90, were the stocks which plummeted the most in the Sensex. Nifty IT which fell 1.41%, reaching 43,726.55, Nifty Pharma which fell 1.23%, reaching 23,263.50, and Nifty Bank which fell 1.20%, reaching 50,988.80 were the three sectors which fell the most among the Nifty sectoral indices.",
    "url": "https://www.hindustantimes.com/business/stock-market-crash-sensex-plummets-over-700-points-nifty-down-200-as-banking-and-metal-stocks-fall-101736143185811.html",
    "original_url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNRkRhWjk3SDFsdVJ6V1llLV9YVTU5UjI4SHJXbzktR0xDN3hhakkwajZKYkdsS1lGSmFtTFN3ZkVheDA4VkRUYWo5d2hNaTIxX2RlTDM2aGt1Y1BuSjBtWlQtYnJ1RFBjZEFRdHRJRi1pY2JpRldsQm0yRG1IT1NjU2dBY29rdXZEdzNDVlRYSEJtSWZ3aTUyUlBXU2NFWlR1UWRpRUpvZDBmdWxrRXFpMHVVd1lxWWhuUVpYaWp2ZHFWMGc2VzBBQnh5S050dml0OWJoYkczNkFsWG5Tajc2Rk9QdlFQS0VvRFpLTTVJUFc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2279,
    "word_count": 391,
    "gnews_title": "Stock market crash: Sensex plummets over 1,100 points, Nifty down nearly 400 as banking and metal stocks fall - Hindustan Times",
    "published_date": "06/01/2025",
    "publisher": "Hindustan Times",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock market today: BSE Sensex ends over 700 points down; Nifty50 near 24,000",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 9 Good Study Habits to Develop 9 Supercharged Study Habits for Exam Success 9 Common Myths About Board Exam Preparation Debunked 8 life-changing benefits of learning one new thing every day 8 essential memory techniques every student needs to master 8 Clear Indicators That Suggest You Could Excel as an Engineer 9 Myths About Online Learning Debunked: What Every Student Should Know 8 Online Resources for Free Books to Help You Study at Home CBSE Board Exam Prep 2025: 9 Proven Tips to Study Smarter,NotHarder 8 English Words to Help Students Sound More Impressive in Daily Conversations A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-03-2025-dalal-street-indian-equities-global-markets/articleshow/116900670.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxPTElRQWZGbDE0M0MwN3RhLXRHNHNhcDZBX1JtY0QwQzQ4aHNId0twb05NU1gxS0VRVGRESjk5WGFRQ2UyVXF6SUJkcS1kZllYOVFZREJVUHZTd09ROHFGTmRoaVk3bkxGcG45QWkzOEZLSjVtTXR1ejZ5bUZpSG1lWV9LQ0lfTWxfTkZRZFVhZDJqR2luNXRBeXNDRnZEV01rREYtOFpGUVJ3V0FfQnlkbVE0RDdhcGxxTG50ZVVxMmplWnJRbVQzX2hsTFRkcVlWQkREVzBpZGZTbnVJWE5GNjY4MXp1cXVkRE40Y2JndHh6Y09SZnNRNUV0S0diWExtQjM5QUE1eGIwdlY4ZnNJYdIBlgJBVV95cUxOaExKUEptX1dOd3JXT2FramFYN0FHaGFKMDZveU1fN3NXRWJlVkhKYVNKUERDbndGQmVkMnoyV0JoTHgxSWE1ay16M1hlblE1OWJkLVlnRmJhT2lfM3l2SGRZTGdaLUNoa2RfSzNCSzJlQ1Y1UHVzN0t5WVJYMnBPZ3EzMndLY1RaLXpEQ3BwVHZvWURaY25fOVJ2ZktBT3Q3M3A4OFVuQzNCREhxQWVJajlOOWFDWng1a1JUbjZlVGprMUJJLWx1VWIzOGl4UUNmMm9PU19Mc2dzaTFvNEJlNUMxN3l6V1pGQW5HSy1leDJmeHJGUEg0NXhmNWhJVjZnamtKZElGbzBRRHlPM0EzYWJEUEhaQQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3750,
    "word_count": 637,
    "gnews_title": "Stock market today: BSE Sensex ends over 700 points down; Nifty50 near 24,000 - The Times of India",
    "published_date": "03/01/2025",
    "publisher": "The Times of India",
    "topic": "BSE Sensex India stock market"
  }
]