[
  {
    "title": "Why markets are falling: Key factors behind the slide",
    "body": "10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/why-markets-are-falling-key-factors-behind-the-slide/articleshow/70139012.cms",
    "original_url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxPX21MZ3NHOTlQemo5Q1FrMjlJV0E3cjdNY0FUbG9XQnUyeW1UeDlKRHVYMGtYZWJxSlphcnZQNG1pSlpmZzJZclg5cTNuTVNRN1F0NEpGZDJpaFAtdUgzNWhIUTRIYTNJNG9jMlFlNXdxREhab2ljVWNPdDg2MkVZT3lHcW9ka2dETVBaS3lMX2w0anBRbnRQZUxSa1lHc3o1cVZKcHpnNGxaRkdhZzBDZWduby03cG10N0dHQXF6RWE3V01HZV9xMWd1YjhTSXZhTUZn0gHYAUFVX3lxTE9md2lNaU8wWXNGejhNeVJvX254dkVEcDlNVjBUZlhkTHJmS2xReGVsLUc3VWI3RzMwVVNZS2t3NTRiUzNab3ZTRE5jemozc0FBS2R4N0ZYOFpuMjg1czZxUVZkVlBiU2diYUxJQ0I4Z2JDODhNdDFxSzlQc29IbGJmSUZ5UWxhSTFENkZMbHRVa1VaUWt2WUJMVm9KUU1pSzZFNWhYVnJkeFA1c3JpYjJBbFJhejBtbFFpRXdMdGQtSmJFdHIydzZBQWpVMGxzeWlMTUJBU3dHcg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2995,
    "word_count": 519,
    "gnews_title": "Why markets are falling: Key factors behind the slide - The Times of India",
    "published_date": "09/07/2019",
    "publisher": "The Times of India",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "MARKET WRAP: Sensex ends at record closing high, up 282 pts; RIL up 4%",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Jul 12 2018 | 8:15 AM IST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/article/markets/markets-live-bse-sensex-nse-nifty-indices-cpi-iip-trade-war-rupee-118071200123_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxQVy12dnk4NWdUYmJVUlJWWGxzZVFIeUNJT0k2cnU2M3k5Tzc4RTRyd0dyN241Y2NGMGFoNzAxZ3hSeUI0WTh5NElOX0s3MGk5cDE0QTNrUXBOUDlGNDVjb1dLelJQU2JQbnp1ZTczQmxNWEhpUTBSTVNmVXBmTmpkbkxKVlVXSE8zdE1JOHRlV2ltWWZoS1Z5ODJ6MFRPS1JUSTA0bWlmLVg4c2stLWI4WHpIRHFuWm9UVUxfUUk2WFVfLVBaNi1JUnlTd1d1ajFQ0gHWAUFVX3lxTFBLSlJhU2R1T2hsZWNkdkhaazN3dGhISnlGY3ZQdExnNnhydlBlVF96cklHMGcxZnBRdjQyMG1JdFNNMHpqUDJMSXM5Ul9iYWdtY0RXdDFWN2VsUnRNQXV4VUc5aE9VSUc0RXJSSDZjTVkzUjExdkJvRG9MdUp6b3ZiRGlnVEVzaFd4aENYeklpZ2JNOE9maS1mWW9ITzloV3hMVkJRQ0xMNl9MS1RTSXZjRmZ0aFVsU2JMaDRORUY1SGY5NFR3MW9zRFViRDJ6OC1ZWkt3WEE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 491,
    "word_count": 83,
    "gnews_title": "MARKET WRAP: Sensex ends at record closing high, up 282 pts; RIL up 4% - Business Standard",
    "published_date": "12/07/2018",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Closing bell: Sensex drops 179 points, Nifty settles below 10,600",
    "body": "DBS sees rupee falling past 71/dollar on rising oilhttps://t.co/u5YoOb51Mm US curbs on oil imports from Iran is a new worry for Indiahttps://t.co/EMUTHiUawW Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/Money/zpAa5lIStRq6UxUPXrNwrN/Stock-Market-LIVE-Trade-concerns-hammer-global-stocks-Rupe.html",
    "original_url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPY1hTMG5RbFVKOHBtYXhkbEdsN1U4RENMTldpRVAwRFQyNHJIOEdCU2hXRlBsdnR6QkJwVnhZay1WSUZoRWNZRFhlUF9HbjNwNzBzdEw4VTNCWEhucGNFc1F6R1NtQ0N2WjZEM1YwSTI5WUVwNVpBREhHbl8zZEprbnJrbWZUanVKZmFTY1AzdFNLOFJCb2hvZ3VyeHV3YVJKTEZIbm9ILXdVYnNJM0tUZ2NrOFdEcmxx?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 377,
    "word_count": 55,
    "gnews_title": "Closing bell: Sensex drops 179 points, Nifty settles below 10,600 - Mint",
    "published_date": "28/06/2018",
    "publisher": "Mint",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "India’s stock market skyrockets the most in 10 years after surprise tax cut",
    "body": "Indian stocks surged overnight Friday after the country’s government announced a big cut to India’s corporate tax rate. The India S&P BSE Sensex index jumped 5.3% to notch its biggest one-day gain since May 5, 2009. That day, the index soared 17.3%. The U.S.-listed iShares MSCI India ETF (INDA) gained about 5.3%, its best day since Sept. 4, 2013, when it popped 5.5%. Corporations in India will now be taxed at aneffective rate of 25.17%, Indian Finance Minister Nirmala Sitharaman said Friday. That’s down from an effective tax rate of 30%. The lower corporate tax rate comes as the Indian government tries to reignite India’s economy. India’s GDP growth rate has fallen for six straight quarters through the first half of 2019. At the end of the first quarter of 2018, the Indian economy was growing at an 8.1% rate. That growth rate has since fallen to 5% through the second quarter of this year. “It was becoming evident that counter-cyclical policy responses may need to become more aggressive, but expectations were centered on monetary policy to do the heavy lifting,” Kaushik Das, chief economist at Deutsche Bank, said in a note. “Very few expected any fiscal stimulus.” “This is a big bang reform, for which corporate India has been waiting a long time and we expect it will raise the animal spirits in the economy,” Das said. Indian stocks have lagged the broader emerging markets this year. The Sensex is up 5.4% in 2019, while the iShares MSCI Emerging Markets ETF (EEM) has gained about 7% in that time. “The tax cuts will undoubtedly boost sentiment, and that is likely to have a growth-enhancing impact,” Sajjid Chinoy, chief India economist at J.P. Morgan, wrote in a note. “However, how much investment firms will undertake in response to the tax cut remains to be seen, especially given weak demand conditions.” — CNBC’s Michael Bloom contributed to this report. Correction: This article has been updated to reflect Reuters’ correction on the new effective tax rate for Indian companies. Subscribe to CNBC on YouTube. This Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information. WHAT ARE COOKIES AND HOW ARE THEY USED? Like many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits. First-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities. Certain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services. The Services use the following types of first and third-party Cookies for these purposes: Strictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly. Information Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers. Measurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes. Personalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices). These Cookies also allow your device to receive and send information, so you can see and interact with ads and content. Content Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos. Ad Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you. Social Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit. We and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you. Depending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below. Browser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions: Google ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer If the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services. Analytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms: Google’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out The above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms. Flash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager. Interest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit: Digital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance You can also opt out of some of the advertising providers we use by visiting their opt-out pages: Google’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page These are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms. After you opt out, you will still see advertisements, but they may not be as relevant to you. Mobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings. Connected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking. Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”. These settings vary by device type. Cross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above. You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics. Consequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences. For inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US. For inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK CHANGES TO THIS NOTICE This Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies. These Cookies and SDKs are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these tracking technologies, but some parts of the site may not function properly.",
    "url": "https://www.cnbc.com/2019/09/20/indias-stock-market-skyrockets-after-surprise-tax-cut.html",
    "original_url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxONl9tUzdZNWlfc1RxOXVYbGs5b0ZHOE0wcmdIRGZIckl2bVhGWDhRbGJCR0RiR1ZTeklyOW9wb1FLLXkxUXVzWkFvejZCdThvUkh5enMtMmE3VjlaMUVidlZjRVUtdUdlMDExZnQ2YTZUanNoSlhVTXlOX0JSNFJHMmx5M1RYZjFWM29veDJlYXM1eGQz0gGaAUFVX3lxTE90TWtwUEZVWEZmQm9SOE14V2RtZkxPNEd4Y2NJZktGYWMxWkJ0VEN5YXJ5UnB1ZVN2ZXk0ZHlEWTFyXzlHcmlMaE83b3JWMWhScnpqRlJTYzV1SG9WcDRQOXV1a1FIMFY2NE5IckxyNTB2Y2FGNXgyRzZSQ0s2cWpSZnpNQUxEQnFVbmlZR0ZEbW5OdFpwQTdlbXc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 12232,
    "word_count": 1851,
    "gnews_title": "India's stock market skyrockets the most in 10 years after surprise tax cut - CNBC",
    "published_date": "20/09/2019",
    "publisher": "CNBC",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "July 2019 turns out to be the worst in 17 years for Nifty and Sensex",
    "body": "July 2019 turns out to be the worst in 17 years for Nifty and Sensex August 1, 2019 Up next Published on 01 August 2019 Author Vineeth N C Tags BSE , FPI , NSE Nifty , Sensex Share article The post has been shared by 0 people. Facebook 0 Twitter 0 Pinterest 0 Mail 0 The Indian stock markets recorded their worst July performance in 17 years as Sensex and Nifty went down by 4.86% and 5.69% respectively. This slump in the benchmark indices reminds us of the depreciation that happened in July 2002, when Sensex fell by 7.92%. The Indian equity market was under immense pressure in July as the Union Budget 2019-20 did not address any of the investors’ concerns, which resulted in the foreign portfolio investors (FPIs) pressing the selling button. Also, the downward movements that Sensex and Nifty recorded were the sharpest monthly decline since October 2018. Inopportune budget amendments, economic slowdown, liquidity crunch, and reduced consumption are the primary reasons for the fall. Also Read: Government and policymakers left with concerns as FPIs continue selling The Indian capital market attracted FPIs when the BSE Sensex and NSE Nifty exceeded their record levels of 40,000 and 12,000 points respectively in May. This is when the post-poll survey predicted the return of the BJP-led government. The FPIs infused a whopping Rs 10,384.54 crore in June, they were citing favourable amendments but were let down by Nirmala Sitharaman, the Finance Minister of India, in her maiden Budget presented on 5 July 2019. The FPIs have gone into a rigorous selling mood since the second week of July, they have pulled nearly Rs 3,800 crore, which is the highest among the emerging markets in July. Emerging markets such as Thailand and South Korea have received a steady FPI inflow in July 2019. The downfall of the Indian markets at the time when the rupee is up by 0.34% and downward movement in the crude prices is a worrisome factor for the Indian Government and policymakers. The most significant reason for the FPIs to pull out of the Indian capital market is the increase in surcharge on FPIs registered as association and trusts. The Union Budget 2019-20 hiked the tax outgo of the super-rich which has made them consider the newly elected government look more aligned towards the left. Vineeth N C Engineer by qualification, financial writer by choice. I am always open to learning new things.",
    "url": "https://news.cleartax.in/july-2019-turns-out-to-be-the-worst-in-17-years-for-nifty-and-sensex/2562/",
    "original_url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNUmg3NDdEdVVmNVVneDJOVlExZW9SRk9hT0pVMEVmc1UzSHlyNFZ3UFFXMVZQXzRqajNZZDdXczVFR0xRQUNoTURwODNZRnFmTXV6LU91bEphWlF6SFNMSWgzeHdIM2xNeFgzMG0wTlJmTnY5ZXJNeEtOd0ZaM0JOdUFVeDYwSVVTWU5qWUdYWExMUXNnaVh4VXR1dnFlNWI20gGmAUFVX3lxTE5mV1k1TGtZYVdEdXJGZ1lnMmZQbEpQcWVFeW5ONjRYcW1BdEt2RElyZ0ZMbVFjYklGVnNFTE8tUFZsbVA4RGJncHlWUVlyTHpxWXRld0pHSmV5OFJTTjBXNy1NWmZWN3hGVVF2X3JET1kzOXNsdlVwLXZ6TE9xZ19GSlhkYXdDaTVSRzlfajRteHY2bHRneDZ5LXZmZl9kSnRybzVzeGc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2405,
    "word_count": 408,
    "gnews_title": "July 2019 turns out to be the worst in 17 years for Nifty and Sensex - ClearTax Chronicles",
    "published_date": "01/08/2019",
    "publisher": "ClearTax Chronicles",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Closing Bell: Sensex ends lower, Nifty fails to hold 11,600; Midcap index outperforms",
    "body": "Benchmark indices reversed some previous day's gains on July 12 as traders turned cautious ahead of Infosys' earnings and economic data due later today. The BSE Sensex was down 86.88 points at 38,736.23and the Nifty50 fell 35.20 points to 11,547.70. The broader markets outperformed frontlinerswith the Nifty Midcap and Smallcap indices rising 0.46 percent and 0.33 percent respectively.",
    "url": "https://www.moneycontrol.com/news/business/markets/stock-market-live-updates-bse-nse-sensex-off-days-high-nifty-breaks-11600-indusind-bank-dips-post-q1-4197571.html",
    "original_url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPekxscGhGa3o0Y2FQNFhQVWNwMnQ4S0dRYi1VSnpDUXdsU1VFYzk1M2w3bTlWNzFZUjh4azNKZXc5Tmx5RktuNld1MkdWMkloa0NGeVpNaEh5YmhVbmR4WVAxNmlOcGdrelRnYl9BYUhNNXRpODJLYnZXS0QzcGItZjJHMDZuWk9xQkhyNDRJZXRFbTdOTXY0dklrUXAwZmVER1Byeks4ZEppU2ZKQnd1STBjb0h5MnlMcnE4UDVQYW1UN0JfbFhORGg3NHNpYkxVVEs4cTAtYmY3NmJ0SnlxOWR5SFNPdjUwVk1TdGh3NXJQUXpNVV8w0gH8AUFVX3lxTE40cGh0eGJYQXZJOFZlTjJweTV6SU9Vb1pZNEFOcTkxTTNRbW91RmtiVkl0YUNneXc3b0xNTEtjYVNvNWxua2hKTWtRYVVqLThsd1ZuLXZQeWZyUm1DcXo1eXRUMWV3dndiZ1B1cS1xV09lUWtPdzY2WFpFbnNiT3d6dmlidXVBZzkzM1BVXzlZaGpsWmMzZ0s2VG9IbEoteE9xRGJtSmRTRVRlcTNCdVJrTER3d2dLMGUtZGVfTkJyQXZKU1JfYzY4LXl1cnR2Y1ZxMnk2dm0zc0xkRHE4NDZucHdIWDVFam40cGVNdldYRWtYSE90dnp5Mk1uRw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 387,
    "word_count": 58,
    "gnews_title": "Closing Bell: Sensex ends lower, Nifty fails to hold 11,600; Midcap index outperforms - Moneycontrol",
    "published_date": "12/07/2019",
    "publisher": "Moneycontrol",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "A Rs 1 lakh investment in sensex in 1979 would have risen to Rs 3.9 crore today",
    "body": "Partha, senior assistant editor (markets) at The Times of India, Mumbai, covers the financial markets, mainly the stock market, mutual funds, banking and insurance sectors. He is a sports enthusiast. His hobby is philately.Read More 10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/a-rs-1-lakh-investment-in-sensex-in-1979-would-have-risen-to-rs-3-9-crore-today/articleshow/68679119.cms",
    "original_url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPd1BOcldDUUFobFdFS3lSRlVVVTgwMngtckhiRDRaeEpjbGh6TGFPbFhnYmY4V3dKd29Ea3N4ZjJ4a0NhSFJ0TFFuN1l4Q2hwbkE5NDgxVFFmdUJtOFBrN1lVYjh0WHhCUmUteWphOFVraXJYS0lhRVZpaVkyeXpnaVQ4YVV5ZVNwMFFsaFRNWWR2SUNPU0lwNFMzX1J6UHpxd0pDcTh4QUFRZkdjTzhlLXdna011NUx2dUZOcGE1SFk2Q0JJZHNvaHpVeXdvcUFjdUIxSHk2U1Vma0ZBUnJNdTJLOWpsMWZKWjNadXRZVHU0a2JEMV8w0gH8AUFVX3lxTE04R0tpbHp3QW9XSU5Md2dRRDI4U0U2RUgxekxyMXZDNmI5QVA2cC0tcFk4SndveFVNZDdEZTdnYkdSdEVyb1BPZUphSGkzbGFFellpYlR4aFlpa3NUUUphZThlUHdWd3M4b0NZMUV5X0JXX2NINUl1el9TaDE0SlpHZU85THNWS1Z5eGh1TTJZQWJNSVNhNWotcjVTMVUzTlRqM2I4TmdsTlJ3a1Y5Q25LYlhGOGFtZmZUVGZISndvZlE1WnBpZk9sZWg5b2NMTy1fdXJ4VE0wZkNHNi1xS05BOWl4UlhLa0JlRDZmWTRWcWtRSjZXellET1FWYw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3228,
    "word_count": 554,
    "gnews_title": "A Rs 1 lakh investment in sensex in 1979 would have risen to Rs 3.9 crore today - The Times of India",
    "published_date": "02/04/2019",
    "publisher": "The Times of India",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "MARKET WRAP: Sensex tanks 491 pts, ends below 39k at 1-month closing low",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Jun 17 2019 | 7:12 AM IST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/article/markets/markets-live-sensex-nifty-market-live-us-fed-meet-gst-rbi-minutes-oil-price-119061700067_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPc01RdFNpbUY0RVpkdnpvRXVYbVhKb05aLUJnR2hYQTlRTHZKLWZWRU5YZGtmLVBkZlBmRGRhODVtaENRT2JNV1RUYzJtSWZxMkdEUk5JM2UtcmV5Z3FnLU5BOHRIeVBhOXRkZDJoNHoyUmpvNWVWdUUxaHUxSVJOSmE1WXRDYnRwYU5iTWRuam9hdzdNQkhaV2VEaGotSXdudDFsN3VGd2hoVkJnU3l0UzEwdmJ5TFhkNnktN3JXd2pyUTVQelY4b0lyOHFEMGx5VS03WU4xU0Z2WnR4OHfSAeMBQVVfeXFMTXRhSmxzM1F2ZTBwTFU1NFcxS2Y4X1Jfb3B1UVgyNlpUX2tVT2JmMFR2ajd5Q1VjbUZydUFyS0ExTGpUU0V4eHRmdGhRSTZ6RzJla3ZGU3FSVmNWVHlhT2NTcVVlMk8xX0JIdXhYR1FUa0NsdktuNkU3RWhWeDVDYkdhNjRWNlVfdTcxV2RRdC1neXNFUDZlaTJJQVJFTE5KQUZ3SmhVanFvdl9wYnhHbDYxUC1BNzVpeXZueVRENENoTGF6dHN6WlRqMzNRcW5ocVFOTUtGUENFTVpIVHhQZDE4R3c?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 491,
    "word_count": 83,
    "gnews_title": "MARKET WRAP: Sensex tanks 491 pts, ends below 39k at 1-month closing low - Business Standard",
    "published_date": "17/06/2019",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Closing bell: Sensex surges 257 points led by banking stocks, Nifty settles at 10,821",
    "body": "Credit for small businesses may be central to the government's strategy of providing employment, but these small loans come at a cost to banks@aparnaviyer02https://t.co/SK0kTadvZo Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/Money/QcUMWJTEmcwcnLdW18m9DP/Stock-Market-LIVE-Sensex-Nifty-set-weak-opening.html",
    "original_url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPbm1FdXdPcUV1V3NLSDFQR3BxdEU0SndqWHVLOGVVVTd0dG9xQjBJWkwxRm1oMTNDQXA5eEgxbTMtY2xlVjU5OFhaWU0yNzF3YUlvQkR3ck4xc2d3dlVwWmh6V29Ub1BYZ3ZnaHpIMEpLTWUxX2ZqUE9xSl9oOVczam1kcTduRzYzbXFrd1BxTTVEelctVkdNdGtzU2ZhVEpnbVRYMDdCTXEwdw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 400,
    "word_count": 57,
    "gnews_title": "Closing bell: Sensex surges 257 points led by banking stocks, Nifty settles at 10,821 - Mint",
    "published_date": "22/06/2018",
    "publisher": "Mint",
    "topic": "BSE Sensex India stock market"
  }
]