[
  {
    "title": "Why markets are falling: Key factors behind the slide",
    "body": "10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/why-markets-are-falling-key-factors-behind-the-slide/articleshow/70139012.cms",
    "original_url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxPX21MZ3NHOTlQemo5Q1FrMjlJV0E3cjdNY0FUbG9XQnUyeW1UeDlKRHVYMGtYZWJxSlphcnZQNG1pSlpmZzJZclg5cTNuTVNRN1F0NEpGZDJpaFAtdUgzNWhIUTRIYTNJNG9jMlFlNXdxREhab2ljVWNPdDg2MkVZT3lHcW9ka2dETVBaS3lMX2w0anBRbnRQZUxSa1lHc3o1cVZKcHpnNGxaRkdhZzBDZWduby03cG10N0dHQXF6RWE3V01HZV9xMWd1YjhTSXZhTUZn0gHYAUFVX3lxTE9md2lNaU8wWXNGejhNeVJvX254dkVEcDlNVjBUZlhkTHJmS2xReGVsLUc3VWI3RzMwVVNZS2t3NTRiUzNab3ZTRE5jemozc0FBS2R4N0ZYOFpuMjg1czZxUVZkVlBiU2diYUxJQ0I4Z2JDODhNdDFxSzlQc29IbGJmSUZ5UWxhSTFENkZMbHRVa1VaUWt2WUJMVm9KUU1pSzZFNWhYVnJkeFA1c3JpYjJBbFJhejBtbFFpRXdMdGQtSmJFdHIydzZBQWpVMGxzeWlMTUJBU3dHcg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2995,
    "word_count": 519,
    "gnews_title": "Why markets are falling: Key factors behind the slide - The Times of India",
    "published_date": "09/07/2019",
    "publisher": "The Times of India",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Closing Bell: Nifty ends above 10,800, Sensex up 161 pts; Maruti Suzuki, Sun Pharma dip 3%",
    "body": "Today, our markets recovered mainly on the back of Indian rupee, which appreciated by 0.44% from the lows of 72.50. It seems that RBI must have intervened at the yearly projection levels. Nifty closed 47 points higher from previous and Sensex was up by 162 points and both are closed at 10,844.65 and 36,724.74 respectively. Advance decline ratio was at neutral level nearer to 1:1. Metals and Bank stocks showed signs of short covering, which is positive for the market as these stocks have very high beta and can change the momentum of the market. Today, number of FMCG stocks closed lower against the rise in metals and Banks that could be big positive for the market as it implies that investors are ready to shift from defensive sector to high risk sectors or investors are ready to handle risk in the market. Technically, below the level of 10,850 we were expecting 10,740 and 10,630, however, Nifty got arrested at 10,740 and recovered back to day’s highest level, which was at 10,840. It could be higher bottom or double for the market at 10,740 and sustenance above 10,870 would positive for the market.",
    "url": "https://www.moneycontrol.com/news/business/markets/market-live-sgx-nifty-nifty-sensex-bse-nse-sun-pharma-tata-comm-psu-banks-4400561.html",
    "original_url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxPelFSc1RQYVZVWHk2NkV6ZWFFdEpCT3ZpTG1Uck5MeU5rVTZHSjBhUmV1andNYW1DQjJJVmlvVXl6YUZXeFBSRDRNY0dWOWNhZTgxaEx4T2ZhUDdOSU02RWhmWEx5LW4tclg0YTJ6eGc4elBIYkgwN3dLTFFLSmotYkdsMTJZdkZNM0JoUGdzc05oS1QwamNfZVp6Q3MyX2dWSmtKWDhxX2VMeTZoZnVHdURzZkdaN3RsUEgtdVI4YmJvN0hYLUZLdE14YjFzcjhVdHBZ0gHYAUFVX3lxTE4tY3ZmVWFiV1M0d0Q4UVBCMVJsRm9zLUlYZXp5TTh0RU01bHNCLU5OQXF0MGxRellmNEJUQzVPcVVJRkZEZ2dWTlBLWG5lZWlid0lVZnVEX0JxWXBUNUI0Mnc1OWt5WDIyX3NzZkxTYlVIcDhGc2cxQkV2UWlvZjJtNjl3SGkwbTBobDAwSUtlLU1jdldJc1I0ckc3dFVXbDBvN2p1UG50V0o4MnNBXzJrZUhwbXlKenhoTE1JVU11WjBnNUFKcUFWM2ZzRWM3VHFnaHBoMjVqUw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1112,
    "word_count": 193,
    "gnews_title": "Closing Bell: Nifty ends above 10,800, Sensex up 161 pts; Maruti Suzuki, Sun Pharma dip 3% - Moneycontrol",
    "published_date": "04/09/2019",
    "publisher": "Moneycontrol",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "What’s driving the investor bet on Sensex stocks",
    "body": "Minttakes a look at what is driving the stock market. 1)Are the current levels of the stock market justified? Till now, in fiscal 2019-20, the price-to-earnings (P-E) ratio of the 30 shares that constitute the BSE Sensex, India’s most popular stock market index, has been at 28.17. The P-E ratio is the market price of a share divided by its earnings per share. When investors buy a share at a certain price, they are basically paying for the future earnings of that company. So far this fiscal, investors have paid₹28.17 on an average for every rupee of earning for Sensex shares. This is the highest average P-E ratio in more than 20 years. Thus, it’s important to understand what exactly the stock market is paying for. 2)Why are investors paying such a high price for shares? A high P-E ratio means that while share prices are going up, earnings of firms are not. People investing in the stock market hope that as Prime Minister Narendra Modi has a bigger majority this time, his government will initiate another round of reforms on labour, land and capital. These reforms will improve ease of doing business. This will help companies expand businesses and spur the launch of several new businesses, thus creating jobs. The creation of more jobs will help people earn more, leading to greater spending, which will benefit businesses and improve their earnings. 3)Have P-E ratios ever been so high in the past? P-E ratios were high in mid-2000, when the dotcom bubble was on, and in December 2007 and early January 2008, when the market was rallying, before the financial crisis set in. 4)What are the other reasons for such a strong market? In the last decade, the central banks of Western countries, led by the Federal Reserve of the US, have followed an easy-money policy. This allowed foreign investors to borrow money at low interest rates in the West, buy shares all over the world and drive up share prices in the process. In the last few months, the Federal Reserve has more or less signalled that this easy money policy is likely to continue. This has given further hope to stock market investors in India. 5)What about the consumption slowdown? Investors expect the new government to tackle the consumption slowdown by raising its spending. This is a short-term hope that has driven up the stock market, despite lack of earnings growth of firms. The government needs to avoid the mistakes made in 2008-09, when it increased spending and pushed public sector banks to run an easy credit policy. This later led to high inflation and massive bad loans of those banks. Vivek Kaul is an economist and the author of the Easy Money trilogy. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/what-s-driving-the-investor-bet-on-sensex-stocks-1558885351348.html",
    "original_url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOQXRCQ082Y2otcWU4YWJwN2NlSHg3MGdob3dZSno1QlFuM2xlVXUxbGN1ckhmQ3pPdDZ0UlZ1bGJxekdXMWhnLXNrQzVzSV9ORmVFcldtMUNrYkd1UG9yWl9yZE5XN08xWlBZc1JWQW9WdlFtUUtnZ0hyMlo1NDNvS0h6N2FUa0R2Z242bG1hTnp3ZUpDQVN2MTgzWF9LTzlpZFdQRzNVV0R2ZVU1azV6QnlxSG9tT2gz0gG-AUFVX3lxTFAyZDFjdkhMOTVVazJ4UnJfYmVJTldTcDFDdDNRMHd3N3JSQ2c3WlNVX1NhZjZtOHdjc3Fod0RlbE5kR2hKdnFGTHRrOTlXemtXUkpXdTB2V05ieHFCRzU5R0NWdU1sdXkwdzhBOFNTOFlvVnVlbU1abzhjMWNrRTczOC1tUFpoSF9jcXlsMkx0VFRONnhpNEJjbzhaMlQ5OU5KZWF1ME1UY0MwWGpqRXR5eVdjQ05TeUdRaGMtaXc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2867,
    "word_count": 489,
    "gnews_title": "What’s driving the investor bet on Sensex stocks - Mint",
    "published_date": "26/05/2019",
    "publisher": "Mint",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "India’s stock market skyrockets the most in 10 years after surprise tax cut",
    "body": "Indian stocks surged overnight Friday after the country’s government announced a big cut to India’s corporate tax rate. The India S&P BSE Sensex index jumped 5.3% to notch its biggest one-day gain since May 5, 2009. That day, the index soared 17.3%. The U.S.-listed iShares MSCI India ETF (INDA) gained about 5.3%, its best day since Sept. 4, 2013, when it popped 5.5%. Corporations in India will now be taxed at aneffective rate of 25.17%, Indian Finance Minister Nirmala Sitharaman said Friday. That’s down from an effective tax rate of 30%. The lower corporate tax rate comes as the Indian government tries to reignite India’s economy. India’s GDP growth rate has fallen for six straight quarters through the first half of 2019. At the end of the first quarter of 2018, the Indian economy was growing at an 8.1% rate. That growth rate has since fallen to 5% through the second quarter of this year. “It was becoming evident that counter-cyclical policy responses may need to become more aggressive, but expectations were centered on monetary policy to do the heavy lifting,” Kaushik Das, chief economist at Deutsche Bank, said in a note. “Very few expected any fiscal stimulus.” “This is a big bang reform, for which corporate India has been waiting a long time and we expect it will raise the animal spirits in the economy,” Das said. Indian stocks have lagged the broader emerging markets this year. The Sensex is up 5.4% in 2019, while the iShares MSCI Emerging Markets ETF (EEM) has gained about 7% in that time. “The tax cuts will undoubtedly boost sentiment, and that is likely to have a growth-enhancing impact,” Sajjid Chinoy, chief India economist at J.P. Morgan, wrote in a note. “However, how much investment firms will undertake in response to the tax cut remains to be seen, especially given weak demand conditions.” — CNBC’s Michael Bloom contributed to this report. Correction: This article has been updated to reflect Reuters’ correction on the new effective tax rate for Indian companies. Subscribe to CNBC on YouTube. This Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information. WHAT ARE COOKIES AND HOW ARE THEY USED? Like many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits. First-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities. Certain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services. The Services use the following types of first and third-party Cookies for these purposes: Strictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly. Information Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers. Measurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes. Personalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices). These Cookies also allow your device to receive and send information, so you can see and interact with ads and content. Content Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos. Ad Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you. Social Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit. We and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you. Depending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below. Browser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions: Google ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer If the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services. Analytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms: Google’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out The above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms. Flash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager. Interest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit: Digital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance You can also opt out of some of the advertising providers we use by visiting their opt-out pages: Google’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page These are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms. After you opt out, you will still see advertisements, but they may not be as relevant to you. Mobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings. Connected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking. Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”. These settings vary by device type. Cross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above. You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics. Consequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences. For inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US. For inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK CHANGES TO THIS NOTICE This Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies. These Cookies and SDKs are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these tracking technologies, but some parts of the site may not function properly.",
    "url": "https://www.cnbc.com/2019/09/20/indias-stock-market-skyrockets-after-surprise-tax-cut.html",
    "original_url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxONl9tUzdZNWlfc1RxOXVYbGs5b0ZHOE0wcmdIRGZIckl2bVhGWDhRbGJCR0RiR1ZTeklyOW9wb1FLLXkxUXVzWkFvejZCdThvUkh5enMtMmE3VjlaMUVidlZjRVUtdUdlMDExZnQ2YTZUanNoSlhVTXlOX0JSNFJHMmx5M1RYZjFWM29veDJlYXM1eGQz0gGaAUFVX3lxTE90TWtwUEZVWEZmQm9SOE14V2RtZkxPNEd4Y2NJZktGYWMxWkJ0VEN5YXJ5UnB1ZVN2ZXk0ZHlEWTFyXzlHcmlMaE83b3JWMWhScnpqRlJTYzV1SG9WcDRQOXV1a1FIMFY2NE5IckxyNTB2Y2FGNXgyRzZSQ0s2cWpSZnpNQUxEQnFVbmlZR0ZEbW5OdFpwQTdlbXc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 12232,
    "word_count": 1851,
    "gnews_title": "India's stock market skyrockets the most in 10 years after surprise tax cut - CNBC",
    "published_date": "20/09/2019",
    "publisher": "CNBC",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "MARKET WRAP: Sensex tanks 491 pts, ends below 39k at 1-month closing low",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jun 17 2019 | 7:12 AMIST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/article/markets/markets-live-sensex-nifty-market-live-us-fed-meet-gst-rbi-minutes-oil-price-119061700067_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPc01RdFNpbUY0RVpkdnpvRXVYbVhKb05aLUJnR2hYQTlRTHZKLWZWRU5YZGtmLVBkZlBmRGRhODVtaENRT2JNV1RUYzJtSWZxMkdEUk5JM2UtcmV5Z3FnLU5BOHRIeVBhOXRkZDJoNHoyUmpvNWVWdUUxaHUxSVJOSmE1WXRDYnRwYU5iTWRuam9hdzdNQkhaV2VEaGotSXdudDFsN3VGd2hoVkJnU3l0UzEwdmJ5TFhkNnktN3JXd2pyUTVQelY4b0lyOHFEMGx5VS03WU4xU0Z2WnR4OHfSAeMBQVVfeXFMTXRhSmxzM1F2ZTBwTFU1NFcxS2Y4X1Jfb3B1UVgyNlpUX2tVT2JmMFR2ajd5Q1VjbUZydUFyS0ExTGpUU0V4eHRmdGhRSTZ6RzJla3ZGU3FSVmNWVHlhT2NTcVVlMk8xX0JIdXhYR1FUa0NsdktuNkU3RWhWeDVDYkdhNjRWNlVfdTcxV2RRdC1neXNFUDZlaTJJQVJFTE5KQUZ3SmhVanFvdl9wYnhHbDYxUC1BNzVpeXZueVRENENoTGF6dHN6WlRqMzNRcW5ocVFOTUtGUENFTVpIVHhQZDE4R3c?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 489,
    "word_count": 81,
    "gnews_title": "MARKET WRAP: Sensex tanks 491 pts, ends below 39k at 1-month closing low - Business Standard",
    "published_date": "17/06/2019",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "A Rs 1 lakh investment in sensex in 1979 would have risen to Rs 3.9 crore today",
    "body": "Partha, senior assistant editor (markets) at The Times of India, Mumbai, covers the financial markets, mainly the stock market, mutual funds, banking and insurance sectors. He is a sports enthusiast. His hobby is philately.Read More 10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/a-rs-1-lakh-investment-in-sensex-in-1979-would-have-risen-to-rs-3-9-crore-today/articleshow/68679119.cms",
    "original_url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPd1BOcldDUUFobFdFS3lSRlVVVTgwMngtckhiRDRaeEpjbGh6TGFPbFhnYmY4V3dKd29Ea3N4ZjJ4a0NhSFJ0TFFuN1l4Q2hwbkE5NDgxVFFmdUJtOFBrN1lVYjh0WHhCUmUteWphOFVraXJYS0lhRVZpaVkyeXpnaVQ4YVV5ZVNwMFFsaFRNWWR2SUNPU0lwNFMzX1J6UHpxd0pDcTh4QUFRZkdjTzhlLXdna011NUx2dUZOcGE1SFk2Q0JJZHNvaHpVeXdvcUFjdUIxSHk2U1Vma0ZBUnJNdTJLOWpsMWZKWjNadXRZVHU0a2JEMV8w0gH8AUFVX3lxTE04R0tpbHp3QW9XSU5Md2dRRDI4U0U2RUgxekxyMXZDNmI5QVA2cC0tcFk4SndveFVNZDdEZTdnYkdSdEVyb1BPZUphSGkzbGFFellpYlR4aFlpa3NUUUphZThlUHdWd3M4b0NZMUV5X0JXX2NINUl1el9TaDE0SlpHZU85THNWS1Z5eGh1TTJZQWJNSVNhNWotcjVTMVUzTlRqM2I4TmdsTlJ3a1Y5Q25LYlhGOGFtZmZUVGZISndvZlE1WnBpZk9sZWg5b2NMTy1fdXJ4VE0wZkNHNi1xS05BOWl4UlhLa0JlRDZmWTRWcWtRSjZXellET1FWYw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3228,
    "word_count": 554,
    "gnews_title": "A Rs 1 lakh investment in sensex in 1979 would have risen to Rs 3.9 crore today - The Times of India",
    "published_date": "02/04/2019",
    "publisher": "The Times of India",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "MARKET WRAP: Sensex pares some gains, ends 269 pts up, Nifty above 11,400",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Mar 15 2019 | 7:44 AMIST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/article/markets/markets-live-sensex-nifty-rupee-oil-global-cues-brexit-idbi-bank-119031500148_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOWUk4eTlfSGNGUVlmT1c0aW9ac2pJeVF2UEtGYlR4bTVXNjlYZWhnT3ZjQ1diTk53R0JxM2VQSExIaWhGUFNMcl9pcXVRQ1dLdnlrVnl3Y1R2YnBNMFlMT0NFTzNIZWtjcjYtSWd4ZXJKZnM4QmRLckh5aElKOXdNWGxxUGdwQWlnMDJkUTl1bHFGTjA2QkJwX2tiOXVJdFV2UkFQTGZNNFdNQzMtWGlPSGtPbTBTVjc0Tm90cTNhTnAyaEMzQWpkNXBPZVBCQW_SAdQBQVVfeXFMTVhDTFVsYjE5cmNvZ0hSb3BpQUw5TEtORTJyd2NZdjRycFVmNlI1VzhDelA1YXY2S3l2UHNkYkNsMmlvS0Zoc3AxRHRJb20zX2ZsWUMzTmxVYjdWOXFiSkhMREYtc0hoZzlKeTItV2xlblJmYXcwRGdfcHBDdVBXNndsa25zMTEwbmJpQk5ZVmpQcGRaM24tSlpienZPdXVDcE92RFJXVHNiSlFRWW5IaEdrcWgtcG45UEVNajlteF9fdmM3MjhrMTNPWHQzQ3p6TnlCRzM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 489,
    "word_count": 81,
    "gnews_title": "MARKET WRAP: Sensex pares some gains, ends 269 pts up, Nifty above 11,400 - Business Standard",
    "published_date": "15/03/2019",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Closing Bell: Sensex ends higher, Nifty above 11,850; Yes Bank slips 2%",
    "body": ": Benchmark indices ended higher but off day's high in the volatile session on May 7 with Nifty finished above 11,850 level. At close, the Sensex was up 86.18 points at 39,615.90, while Nifty was up 26.90 points at 11,870.70. About 1058 shares have advanced, 1390 shares declined, and 146 shares are unchanged IndusInd Bank, Bharti Infratel, Bajaj Finance, M&M and Tech Mahindra were among major gainers on the Nifty, while losers were Dr Reddys Laboratories, Yes Bank, Power Grid Corporation, Cipla and JSW Steel. Among the sectors, except bank and IT all other indices ended in the red led by pharma, infra, metal, energy, auto and FMCG.",
    "url": "https://www.moneycontrol.com/news/business/markets/stock-market-live-updates-bse-nse-sensex-consolidates-after-thursdays-sharp-fall-nifty-around-11850-realty-gains-4071721.html",
    "original_url": "https://news.google.com/rss/articles/CBMihwJBVV95cUxPejFnV2VXUjJtUXo5eFVyNkU4UFdwZ3BQVnBZaHNEUHlIZXU2ZVk5allMQWt0d3BxX3VGZDNXYWhyWkxGZHZqSDdnVUNwU1ZqMDNjRDhFTHRLMW5YTFhZX0ptaGhSUVVIeVRULVcyZ1J3SlVLdEpQUlFPS1FfYnozd1ZpdjRQNFo3T1R4MWFqSng0SXZRVkU0VDNnTVlNUVZMd2J4MUw4R1cxR0hPMVltZ2hxejFESDJrYU9hcDhxY0N4RHFrdEQ2bGFFa1pnb2hOaVB0OEVzdGV0NWxkWHMzMFpfNDRPVHZsYlpWbXdfa1dMdG1BNGlSTmZ4NjF6UG1ncGNrRW5UONIBjAJBVV95cUxQWkFoRFF6d3R3a2ZDSFpUUGNiWDVSTXZBZTRTZG5BMERkenU5UDkwU0MxWV9Rb2Z5aWgyaEpJZ291aWxRZktvQzlIOE9tZHFCeVdiMVl6UENQcXJZXzd1cHhxXzBzS3Fjd05VQlVqbDl0NFY2X1JfSzNwbG1wMDZ2SFk3b2lxbjhpaDJxN0dUdGgta0xSM0k4R2pTZmpXYTZVQW5yZXp0R2F2OUZ1MVM1WVFNSFJzVnVtOE9rLVNOR1Q1clQyQy1KU1JadTRqdmFJQkx1b0dMUnJFM09KaFUzTUs2TDFGVmswR1ZCeU0wRWkyWTlsWmlzNFBaRU56eHpqcnU0b0RmcGJWZWdP?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 639,
    "word_count": 108,
    "gnews_title": "Closing Bell: Sensex ends higher, Nifty above 11,850; Yes Bank slips 2% - Moneycontrol",
    "published_date": "07/06/2019",
    "publisher": "Moneycontrol",
    "topic": "BSE Sensex India stock market"
  }
]