[
  {
    "title": "Market Highlights: Indices erase day’s gains, end a tad lower, Sensex slips 77 points",
    "body": "BSE in Mumbai. (Express photo by Ganesh Shirsekar) Share/Stock Highlights: The benchmark equity indices on BSE and National Stock Exchange (NSE) erased their day’s gains and ended with marginal losses on Friday big private banks. The S&P BSE Sensex slipped 76.71 points (0.13 per cent) to end at 57,200.23 while the Nifty 50 dipped 8.20 points (0.05 per cent) to settle at 17,101.95. Both the indices had opened around 1 per cent higher earlier in the day and traded in the green for the bulk of session before giving it up and slipping in the red in late afternoon trade. Story continues below this ad On the Sensex pack, Maruti Suzuki India was the top loser of the day slipping 3 per cent followed by Tech Mahindra , Power Grid Corporation of India, ICICI Bank, Axis Bank and State Bank of India (SBI). On the other hand, NTPC, Sun Pharmaceutical Industries, IndusInd Bank, Mahindra and Mahindra (M&M), Wipro and ITC were the top gainers. (with inputs from agencies) Live Blog Stocks, BSE Sensex, NSE Nifty, oil prices, gold, silver prices, commodity market and money markets live updates: 16:23 (IST) 28 Jan 2022 MARKET QUOTE | Vinod Nair, Head of Research at Geojit Financial Services \"After the decent opening post yesterday’s weak closing, domestic bourses again staged a quick sell-off, tracking weak European trend. Policy tightening by the US Fed and rising geopolitical tensions in Ukraine coloured global sentiments. The broad market ended mixed considering IT, realty and Mid & Smallcaps reboundes after continuous heavy-selling this week.\" 15:43 (IST) 28 Jan 2022 Equity markets at close The S&P BSE Sensex ended at 57,200.23, down 76.71 points or 0.13 per cent, while the Nifty 50 settled at 17,101.95, down 8.20 points or 0.05 per cent. 10:55 (IST) 28 Jan 2022 Explained: Fed move and Indian markets On Wednesday, the US Federal Reserve announced the final round of its asset purchases. It will thus conclude its balance sheet expansion in March, much ahead of its initial plan. The Fed will subsequently start to increase interest rates in the economy beginning March. Both these measures are aimed at taming inflation, currently at a four-decade high of around 7%.",
    "url": "https://indianexpress.com/article/business/market/equity-markets-live-updates-stocks-shares-bse-sensex-nse-nifty-january-28-7745235/",
    "original_url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQMmt5alB6TGotUWhOamZBb3BrSlQ3bld1cHpKZFJvQ0dKWkwxZm80TmU5dFVYS21LOFdVM0JxcExzWWhXbkJuQk5iVGRHWTNrSTFiU09NSjNlMHFmNDZwaTZ0ejIyV21DVzh6dVEzMFFKWjZNWTZtSUdLTnFWaHQzSU50c3ZYaVFpTTN2aDhGY2JfX240ZWFoVFpHNVFwRDlYZHNyOWFlYVhOUXZKVGY4am9MTkcweFluU2FNUUhCcjJGX2dJNlhvMndKOUzSAdMBQVVfeXFMTlN6UWd1R29VOTRIN0JQMHRzdGtVUnFza1N2bEt5Q2VKS3BPXy1pcVNaUG1JU245ejFNdHAxOUMzMWRaQ0tPOVpBazhWLXp2eHU1eWxDY0NhYUE5eUpuVmMwZnNoNjg2NzkwMVpNTk9lM1RVYUZtVXA5by1RUHVELXNjdUFXTjdUdzMzS1F2QWgzLTRBTkYxMTBsQXhzR284aFpVSVB5dzJUcVM3eV9pVXBoM2dlRTBRb1NxT2VROTRYN0lya0YzVGoxbnEtSG9xWFpnQQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2182,
    "word_count": 364,
    "gnews_title": "Market Highlights: Indices erase day’s gains, end a tad lower, Sensex slips 77 points - The Indian Express",
    "published_date": "28/01/2022",
    "publisher": "The Indian Express",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Live",
    "body": "Clear offers taxation & financial solutions to individuals, businesses, organizations & chartered accountants in India. Clear serves 1.5+ Million happy customers, 20000+ CAs & tax experts & 10000+ businesses across India. Efiling Income Tax Returns(ITR) is made easy with Clear platform. Just upload your form 16, claim your deductions and get your acknowledgment number online. You can efile income tax return on your income from salary, house property, capital gains, business & profession and income from other sources. Further you can also file TDS returns, generate Form-16, use our Tax Calculator software, claim HRA, check refund status and generate rent receipts for Income Tax Filing. CAs, experts and businesses can get GST ready with Clear GST software & certification course. Our GST Software helps CAs, tax experts & business to manage returns & invoices in an easy manner. Our Goods & Services Tax course includes tutorial videos, guides and expert assistance to help you in mastering Goods and Services Tax. Clear can also help you in getting your business registered for Goods & Services Tax Law. Save taxes with Clear by investing in tax saving mutual funds (ELSS) online. Our experts suggest the best funds and you can get high returns by investing directly or through SIP. Download Black by ClearTax App to file returns from your mobile phone. Cleartax is a product by Defmacro Software Pvt. Ltd. Privacy PolicyTerms of use",
    "url": "https://cleartax.in/stocks",
    "original_url": "https://news.google.com/rss/articles/CBMiP0FVX3lxTE82bENvUVF4dHFyRjYxRVMwMjZuUXpYMFpTQXdvckVab2JSbGFfQjZjYkludFg3R2RUY2pxWGFCTQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1442,
    "word_count": 232,
    "gnews_title": "Share Market Today | LIVE Stock Price - NSE, BSE,NIFTY & SENSEX | Indian Stock Market/Exchange Live - ClearTax",
    "published_date": "17/03/2022",
    "publisher": "ClearTax",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Highlights: Sensex ends 770 pts lower and Nifty slips below 17,550 — rupee dips to 79.56 vs dollar",
    "body": "Stock Market Highlights: Sensex ends 770 pts lower and Nifty slips below 17,550 — rupee dips to 79.56 vs dollar Stock Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty50 fell more than one percent on Thursday, a day after official data showed India's GDP expanded a worse-than-expected 13.5 percent in the April-June period. Losses in financial, IT, oil & gas and FMCG shares pulled the headline indices lower. Broader indices Nifty Midcap 100 and Nifty Smallcap 100 edged 0.1 percent each. Globally, nervousness persisted among investors amid concerns about steep hikes in COVID-era interest rates by major central banks. By CNBCTV18.com September 1, 2022, 4:38:17 PM IST (Updated) 1 Min Read Stock Market Highlights : Indian equity benchmarks BSE Sensex and NSE Nifty50 fell more than one percent on Thursday, a day after official data showed India's GDP expanded a worse-than-expected 13.5 percent in the April-June period. Losses in financial, IT, oil & gas and FMCG shares pulled the headline indices lower. Broader indices Nifty Midcap 100 and Nifty Smallcap 100 edged 0.1 percent each. Globally, nervousness persisted among investors amid concerns about steep hikes in COVID-era interest rates by major central banks. Catch highlights of the Sept 1 session, and more, here : Continue Reading First Published: Sept 1, 2022 7:58 AM IST Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags india stock market IPOs nifty Reliance Industries sensex",
    "url": "https://www.cnbctv18.com/market/stock-market-live-update-today-sensex-nifty-auto-shares-maruti-tata-gdp-14625811.htm",
    "original_url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOZ2ZnYzFwS2Q0S2VFWlRFUlJHTl94S1NqaEdwOG1CREVQbFZLXzdpSUdhRXh2blFjSzZqVTVYREpsNWlVTTBuRlhMV3RHRW5Qd1pQSHhuYjJHSmF2bmNKX3prQUJjeTVkXzVBb2hvV0hEeXhxZVJnR2ZQSm9SbDN3NVZ3dUVyMjgzOE1ZNi1WSDdlLXBmbzY1RmV3UG02a0RhSFp5Nkx3cEowLTdwNUg0N3p4cUFrVlHSAbwBQVVfeXFMT2oyTUhWMGxwa1BObHVnVXE3QXJ0UldNUXNxSDBCYnBudV94TVRnVkVRVGd0MUZ0dkw4ZG1PVl82cERxLWpBZUtaT1BmNHJuSTlLcllsMDdoekRGenBLS0xmYVdlRzN5MWVyYmhhaUxJN1BUbjhQX1FGSUg5MlBkd1l4d3dDNE81TGhsNEJ1Ul93Z05Id3Y1ZmRDUnNxd0JGQ1dzbXZOSDBEMFNsLS1fMmtnQnZDeTQ0R1NBUXc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1606,
    "word_count": 255,
    "gnews_title": "Stock Market Highlights: Sensex ends 770 pts lower and Nifty slips below 17,550 — rupee dips to 79.56 vs dolla - CNBC TV18",
    "published_date": "01/09/2022",
    "publisher": "CNBC TV18",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex sinks 770 pts, Nifty gives up 17,550 amid global sell-off; PSBs soar",
    "body": "The Bank Nifty index witnessed volatility throughout the day and ended negatively. After a gap-down opening, the index managed to hold the support of 38,800-38,500 on the downside, indicating the bias remains on the positive side. The immediate hurdle on the upside is placed at 39,500 and once taken out will see a sharp move on the upside towards 41,000 levels. Nifty remained sideways during the day before ending 1% lower. After starting to gap down on the back of a weak global cue, the Nifty failed to recover fully and traded within a range for the day. The momentum indicator is in a bearish crossover indicating a bearishness. On the lower end, 17400 may continue to act as crucial support, below which the index may become weak again. On the higher end, resistance is visible at 17700. Domestic indices moved in line with peers while prospects of higher rate hikes, elevated inflation and a slowing economy put pressure on stock markets around the world. Although India’s Q1 GDP was reported below the RBI’s estimate of 16.2%, the strong growth seen in manufacturing activity during Q2 so far indicates a strong recovery in the domestic market. Additionally, ongoing support from FIIs will obscure the weakness, helping domestic indices to stay resilient. Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Sep 01 2022 | 8:38 AM IST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/article/markets/market-live-nifty-sensex-rate-hike-inflation-nse-bse-ashok-leyland-122090100155_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxQRTA5c3kzUmlGWVVEZkktb01XVGRObF8wcV9oNWtRRzROSXZ6akV1NzFBQWsyWm9GLWoyWVVBZkZXbkVXVDk0Mmtnbllrc3p5bEVVSkdvbndoVl9hM19odXJIREVEOER5QTN5RThNSUdzVE9xX010QUhYRlNJaXZVQ01OcVF3dk5XZ2xzXzk3YlViNXpoR0lZcGdBY2NMWXV4d0xoWE9MRjJQamdzVTdLRHJSb04zLXdSa0ktZ3NXTm9ZQzlCTWtGS011ckh2Y0t5cnfSAdcBQVVfeXFMTTJfRTBFNTNYOUt4THFNNDlhZFdyQVk5Y2ZFY1BaNmVSZlpjT1Y5ZEZjdEVsTjR0WEpJRjRWczE1YzcxeU54b3l1LXljNUhra1hqYm1JYXZvdkxrZEZrZXlFTEVLVTYwSUVjR0NkZklVb3B1M1FoVE5DUDE1ZTJEX0w1UFpiQnViRFBFdHFLd2tabklZZFVEVTZZLU8zYnlHOVRlRXVqME1nMXBfMGRXZXpPdjMxZjlCcnltaVdwQlFtZ3VYYnNtS3BaZ3ZKZW1FdEN1alZJbTQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1757,
    "word_count": 294,
    "gnews_title": "Sensex sinks 770 pts, Nifty gives up 17,550 amid global sell-off; PSBs soar - Business Standard",
    "published_date": "01/09/2022",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Closing Bell: Sensex nosedives 1,416 pts; Nifty sinks below 15,850; major IT stocks tank up to 6%; ITC up 3%",
    "body": "- Rupak De, Senior Technical Analyst at LKP Securities - Vinod Nair, Head of Research at Geojit Financial Services - Anand James - Chief Market Strategist at Geojit Financial Services - S Hariharan, Head of Sales Trading, Emkay Global Financial Services - Ajay Bodke, independent market analyst Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/bse-sensex-today-live-nifty-stock-market-updates-19-may-2022/liveblog/91652770.cms",
    "original_url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNWlp3WFhJb3JjZC1ZdWtUQmoyRlBFT2hyV1hjZUVTU1otd1I2U1VTam5oX003Qms4dUkwcUJaYkh4QnJVZ2hJeDNKejBSWnEyaE43RVlVVEFOY0U2cEpVSzhkb0ZqV2VMalhhRW5OVDRldG0xcXNYRVdheWxhSGZPUGp1R1BXRm5jWFh2TlJCSWFFTFdQMl9icjZOTUx2MWo0Q2M2QzJaZ0RWdnlzeXlJY1ViT3d2djZHQUo40gG0AUFVX3lxTE1JNDZNVHQteWxLLWpFMW81MFRfbk9tTUgxM0xHeENfMkpLWHo3QTdENDlLcEVoT290eWM0V09SVjM1Mlp0X2drbW9OcUI4UEVFR3ZGcUtqMFNUQ05jaHQ0bjR2WkpyYzVFUEhsRXh5Ny1EeUQyUWE1X0UycUQ0TTZZdkR3RVloVFYtQ0NHYTRUVnV1dXRlcktod0ZtVE1sazJXbnVrc0QxTGw1LWk1ZnkyR0k4aw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 608,
    "word_count": 99,
    "gnews_title": "Closing Bell: Sensex nosedives 1,416 pts; Nifty sinks below 15,850; major IT stocks tank up to 6%; ITC up 3% - The Economic Times",
    "published_date": "20/05/2022",
    "publisher": "The Economic Times",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex jumps 616 pts; Nifty ends near 16,000; Bajaj twins, HUL top gainers",
    "body": "Indian share indices ended 1.2% higher on Wednesday as soft crude oil prices supported sentiment. FMCG, banks & financials and auto stocks led the rally. Stocks dipped in Asia today as fears of an economic downturn lingered over financial markets, leaving the dollar hovering at the highest level in more than two years. Benchmark Indian indices clocked robust gains on Wednesday as inflation worries eased amid weakness in crude prices. Sensex closed 616.62 points or 1.16% higher at 53,750.97, and the Nifty rose 178.90 points to 15,989.80. Auto, FMCG, IT and banks & financials led the rally in the market today. Broad market indices were positive as the BSE midcap index rose 1.7%, and BSE Smallcap index gained around 1%. Bajaj Finance, Bajaj Finserv, and HUL were among the top gainers on the indices. Power Grid Corp, NTPC were among the major losers. Meanwhile, the Indian rupee recovered marginally to close at 79.31 against the US dollar. India's latest measures aimed at boosting domestic oil supplies could reduce its diesel and gasoline exports in the second half of the year, keeping global supplies tight and underpinning prices, traders and analysts said. The world is grappling with tight gasoline and diesel supplies as Western sanctions have reduced exports from Russia while demand has surged in a post-pandemic recovery. (Reuters) Bajaj Finance reported a good set of numbers for Q1FY23, Company reported the highest ever quarterly increase in its customer franchise of 2.7 MM. Bajaj Finance has reported its quarterly business update, the company's customer franchise reached 60.3 Mm as compared to 50.5 Mm last year, this is the highest quarterly increase in customer franchise by Bajaj finance of 2.7 Mm in Q1FY23. Along with the customer franchise the company has also reported good numbers for the new loan book which is at 7.4 Mm for Q1FY2023 as compared to 4.6 in Q1FY22. Overall the Q1FY23 quarterly update seems to be very strong for Bajaj Finance and the company is back on its pre-covid growth momentum. We expect bajaj finance to continue this growth momentum for the next couple of quarters. We have a neutral outlook on Bajaj Finance looking at the current valuations and comparing them with peers group. Goldman Sachs believes that Kotak Mahindra Bank stock may go up to₹2,135 per share levels in next 12 months and may hit $100 billion market cap by FY27. Goldman Sachs report says, \"We believe Kotak Mahindra Bank is positioned for an earnings upgrade cycle; we raise our estimates by 7%/13% for FY23E-FY25E on higher margins and lower loan-loss provisions, driving our 12-m TP to Rs2,135 (from Rs1,984, based on a blend of relative P/E and SOTP). We expect core operating profits to grow at a 22% CAGR (vs. a <15% CAGR in FY19-22) and net profits to grow at an 18% CAGR in FY22-25E (21% adj. for provision reversal in FY2022), and our FY23E-25E estimates are c.8% higher on average than VA consensus.\" A rise in public investment in production linked incentive scheme (PLI) has resulted in a growth in hiring intent for July-September as 61 per cent of companies surveyed said they are keen to hire more, according to a report by TeamLease Employment Outlook Report. The government has notified certain procedural changes in the GST rules, including those related to threshold, for filing annual returns for the 2021-22 fiscal, a move that will help ease the compliance burden on small players. The changes were vetted by the Goods and Services Tax (GST) Council at its meeting last week. With the amendments notified by the Central Board of Indirect Taxes and Customs (CBIC), businesses have also been allowed to make tax payments on the GSTN portal by using IMPS and UPI payment modes. (PTI) European shares climbed on Wednesday, as Norwegian oil and gas workers called off their strike and assuaged fears of a heightened energy supply crunch, while Just Eat Takeaway.com rose after Amazon agreed to buy a stake in unit Grubhub. The continent-wide STOXX 600 was up 1.3%. Germany's DAX gained 1.4% after losing almost 3% in the previous session. . Equities fell in Asia on Wednesday and the euro was stuck at a 20-year low as recession fears continued to flow through trading floors. Adding to the uncertainty was a fresh flare-up of coronavirus cases in parts of China that has seen some cities locked down. Tokyo's Nikkei 225 closed 1.2% lower, Hong Kong's Hang Seng Index fell 2.1%. Shanghai's Composite ended 1.4% lower. · Topline growth of 36% y/y (ex-financial & OMCs) is largely driven by E&P companies like Reliance and ONGC, while sectors like Automobiles and IT are also likely to see impetus, estimated to witness a low double-digit growth. Performance in 12 out of 15 sectors under our coverage (ex-financial & OMCs) is likely to see flattish growth in the quarter, indicating that only three sectors are doing most of the heavy lifting. · After seeing three consecutive quarters of contraction operating margins are likely to remain flat (up 15bps y/y) on account of strong margin expansion in Oil & Gas space (excluding OMCs). Auto sector is also likely to witness an expansion after three consecutive quarters of contraction. On the negative side, Cement, Pharma & IT are likely to witness margin collapse by 9.4, 3.4, and 2.3 ppts y/y basis respectively · PAT growth of 74% is predominantly driven by 147% PAT growth y/y for Oil & Gas (ex[1]OMC) space, (accounting for 45% of our earnings ex-Finance and OMC). While, Auto and Telecom, which reported losses in Q1 FY22 are also likely to witness significant positive traction For Financials: PAT to grow at 48% y/y, spearheaded by NBFC · NII for Banks is expected to register a healthy 16% y/y growth, boosted by a decent uptake in credit demand. Even though PPoP is likely to register a de-growth of 1.4% y/y, the lowest number on recent records as an unfavourable rise in G-Sec yield translates into a weak treasury income. Lower provisioning and higher NII will improve PAT by 29% y/y. · NBFC & SFB are likely to witness one of the strongest growth post-COVID. Both the topline and bottom-line are expected to grow by 25% and 145% y/y respectively Credit rating agency Icra on Wednesday said that malls can expect rental income to increase by 30% year-on-year in FY23 driven by improved recovery in business. Malls have reported an uptick in footfalls as well as demand; many retailers have also gone back to pre-covid rentals asmalls report recovery. Near normal economic activity, healthy retail sales (Q1FY23 averaging at ~92% of pre-Covid levels), robust demand in PV segment amid new launches in the SUV domain, cut in excise duty on fuels (| 8/litre on petrol, | 6/litre on diesel) in May 2022 and plummeting key raw material prices (mainly metals) towards the fag end of the quarter post their peak in April-May 2022 were the key highlights for Q1FY23E. Total industry volumes in Q1FY23 are expected to jump up ~10% QoQ led by the robust performance by the industry leader in the 2-W space with rest of the categories (PV, 3-W, CV) witnessing de-growth QoQ. Building in conservative estimates & quarterly lag of RM costs impact, we build in ~50 bps gross margin decline for our coverage companies in Q1FY23E. We expect our coverage universe (ex-Tata Motors) to report 1.5% QoQ topline growth & ~10 bps QoQ margin improvement to 12.2% with PAT expected to decline 9.7% QoQ primarily tracking exceptional gains in Q4FY22 (Ashok Leyland, Bajaj Auto). However, on a YoY basis, operational performance is likely to be robust at high double digit growth due to Covid impacted lower sales in the base year. The second half of 2022 will be another subdued period for equity capital markets, especially forinitial public offerings(IPOs) with a volatile stock market being one of many macroeconomic headwinds, experts said. Overall fundraising in the equity capital markets dropped to₹1.01 trillion in the first half of calendar year 2022, compared to a fundraising of₹1.26 trillion the same period last year, according to data from primary markets tracker Prime Database. Marico Ltd’s business update for the quarter-ended June (Q1FY23) indicated downtrading across products in essential categories on account of increased inflationary pressures. Saffola Oils volume fell by double digits year-on-year (y-o-y) as consumers shifted their preference from premium to mass segment in edible oils. Plus, it didn’t help matters that Q1FY22 had a high base owing to the increased in-house consumption. (Full report) Fast moving consumer goods maker Dabur India Ltd., expects its domestic business to post “high single digit” revenue growth in the June quarter, the company said in a quarterly update ahead of announcing earnings for the first quarter. A whole bunch of stocks will be in focus this week as they undergo their corporate actions and declare dividend, bonus shares, etc. One of the leading Indian pharma stocks engaged in research, development, manufacturing and marketing of generic pharmaceutical formulations, Torrent Pharma is set to declare bonus shares later this week. (Read here) Stable Demand Outlook and Digitalization to Support Revenue Growth We expect the IT companies under our coverage universe to report strong deal momentum (strong book-to-bill ratio and solid deal pipeline) across most verticals in 1HFY23 due to a strong demand seen for transformation and digitalization, while demand would moderate 2HFY23 onwards. We expect 2.4-3.7% and 2.5-3.7% sequential growth in CC revenue for 1QFY23 for the large cap and mid-cap companies, respectively. Further, revenue growth is likely to be broad-based across verticals. We expect the deal bookings to remain strong, given the ongoing digital transformation trend. Lower Utilization & Supply Side Issues to Impact Margins, but Attrition to Peak Out now We expect the companies under our IT sector coverage universe to report 47bps QoQ decline in EBIT margin due to: (1) accelerated hiring (both freshers and laterals) amid the high attrition; (2) marginal step-up in investment in sales and capabilities, and (3) lower utilization due to hiring freshers (4) higher S&GA cost, due to visa cost and increasing travel expenses. We highlight the margin pressure in 1QFY23 owing to higher employee incentives amid the rising attrition and cross-currency headwind. We expect companies with higher EU exposure to face stronger cross-currency headwind due to likely weakening of GBP and EUR against USD. Though attrition would remain elevated, we believe that it has already peaked out now. We expect cost pressure to continue over the next 2 quarters, while margin would recover with moderation in attrition in 2HFY23 and would stabilise. Additionally, we believe the large cap IT names are in a better position to address supply side concerns along with better pricing power compared to their mid-cap peers. Going ahead, we believe margin expansion would depend on: (1) improved pricing; (2) operating leverage (double-digit revenue growth); and (3) currency movement. IT Names to Maintain FY23 Revenue Growth Guidance We expect the IT companies to maintain revenue guidance for FY23 on the back of a deal backlog and healthy deal environment. We also believe a broad-based consensus exists among the large cap and mid-cap IT companies regarding better technology demand. We expect Infosys to maintain FY23 revenue growth guidance to 12-14% and EBIT margin in the range of 22-24%. We expect Indian IT names to record low-teen double-digit revenue growth in FY23 with minor moderation in margins in 1HFY23E due to cost pressure and currency headwinds, while margins would recover by ~50bps in 2HFY23E. We expect a decline in the utilization rate due to fresher hirings and a rise in discretionary cost. The IT sector (coverage universe) is set to post another quarter of healthy growth with decent CC growth despite cross currency headwinds and cost pressure, based on (1) increasing digital transformation/shift to cloud, 2) healthy deal pipeline, and 3) investment in the hyperscalers/SaaS ecosystem. We expect the IT companies to invest the margin gains that they witnessed over the last 2 years for capability addition and talent retention, which will aid their market share gain over the medium term. We also expect accelerated disclosures on the progress of cloud business. Majority of global enterprises are still at an early stage of digital adoption, which is a huge opportunity for the Indian IT companies for long term. Though FY23E revenue growth outlook for the sector remains strong, FY24E revenue growth would see moderation amid uncertainties on global business environment and worsening macros. We believe high salary inflation in developed markets, increasing travel expenses and higher visa costs would impact margins, despite some relief from better pricing. Post recent price correction, valuations are now below the 5-yr avg and further valuation contraction is unlikely. With double digit revenue growth and likely margin recovery 2HFY23 onwards, we remain positive on the sector despite near-term challenges. The pain for Indian stock market continues, with key benchmark index Nifty falling nearly 5% in June, following a 3% decline in May. The market closed in the red for the third consecutive month in June, marking the steepest month-on-month decline since March 2020, said analysts at Motilal Oswal Financial Services Ltd. Compared to other Asian markets, the Indian stock market has seen relatively less correction. For instance, key benchmark indices in Korea, Taiwan and Brazil have fallen over 10% each in June compared to May, in local currency terms. In fact, even the MSCI Emerging Markets index slumped 7% m-o-m in June. India recorded 16,159 fresh coronavirus infections in the last 24 hours, pushing active cases in the country to 1,15,212, as per data released by the Union health ministry. With this, total covid cases reported in the country so far stand at 4,35,47,809. About 28 people succumbed to the disease in the last 24 hours, pushing the death toll to 525,270. Customer Franchise – Customer franchise stood at 60.3Mn( +19.4% YoY/ +4.7% QoQ). New customer acquisition improved and stood at 2.7mn(22.7% QoQ). Both these parameters have shown improvement over Q4’22 when there was a +3.9%QoQ rise in customer franchise and a 14% decrease QoQ in new customer acquisition AUM- Core AUM showed strong growth and came in at INR 20,40,000 Mn ( +30.7% YoY/+6.19% QoQ) New loans booked at 7.4Mn vs 4.6Mn in Q1’22 and 6.3Mn in Q4’22 Deposits came in at INR 3,41,000 Mn( +22% YoY/ +10.7% QoQ) . Deposit momentum has been strong last quarter had seen only a +2.6% QoQ rise. Outlook: AUM growth was strong but slightly below our expectation of 9% QoQ growth but customer acquisition has rebounded strongly after it had seen a de-growth in the last quarter which is a strong positive. Increasing customer acquisition through its omni channel is crucial and company has been successful in doing so We have a BUY rating valuing the company at 8.7x Sep’24E ABV with TP at₹8,953. On the technical front, 15650-15700 holds the demand zone for the index, and any correction could be seen as a buying opportunity. On the contrary, a decisive closure above the 16000 mark could only ascertain the bullish trend in the near period. Hence, looking at recent price action that construes an unclear market trend, participants are advised to avoid any undue risk and stay abreast with global developments. Also, as much action is seen outside the index, we advocate continuing with a stock-centric approach for better trading opportunities. The PLI scheme aims to provide nearly₹2.4 lakh crore worth of incentives over the next five years, with the lion's share going to electronics, auto components, and pharma. \"The Indian consumer was missing in action for almost 5 years due to multiple reasons like demonetization, GST, COVID, and lack of inflation. The growth in per capita GDP picked up in FY22 and per capita GDP was higher than in FY20 after a dip. The discretionary income of Indian consumers is likely to rise from FY23 to FY27,\" said brokerage firm Emkay Investment Managers. Global gold prices found some respite today after slumping to lowest in more than six months on Tuesday, amid a rally in US dollar. The greenback surged to the highest in more than two years as investors retreated to the haven, putting pressure on bullion. Today gold prices recovered a bit, rising 0.4% to $1,770.71 per ounce. On Tuesday, gold fell 2.3% to $1,767.53 an ounce, the lowest since December in intraday trading. In India, the fall in bullion has been cushioned by the recent import duty hike. Bajaj Finance has booked 74 lakh new loans in April-June quarter against 46 lakh a year ago. Consolidated core AUM grew 31% to₹2.04 trillion. Deposits rose 22% to₹34,100 crore as on 30 June. Oil marketing companies--IOC, BPCL, HPCL-- on Wednesday increased the price of domestic 14.2 kg LPG cylinder by₹50 per unit with effect from today. Domestic LPG cylinder will now cost₹1053 in Delhi. The second half of 2022 will be another subdued period for equity capital markets, especially for initial public offerings (IPOs) with a volatile stock market being one of many macroeconomic headwinds, experts said. Overall fundraising in the equity capital markets dropped to₹1.01 trillion in the first half of calendar year 2022, compared to a fundraising of₹1.26 trillion the same period last year, according to data from primary markets tracker Prime Database.(Full report) Even as volatility rocked debt and equity markets over the past year, infrastructure investment trusts (InvITs) and real estate investment trusts (Reits) became an oasis of stability, with many analysts expecting returns from these instruments to rise further. With office occupancies and shopping mall footfalls rising steadily after two years of covid-related disruptions, these instruments have performed better than many other asset classes in recent quarters, experts said, with yields of 6-10%. Some analysts expect their returns to cross mid-teens in the medium to long term. Vodafone Idea Ltdplans to offer its mobility and integrated internet of things (IoT) solutions, including cloud telephony and auto-receptionist, to nearly 250,000 micro, small and medium enterprises over the next year, a top company executive said. India’s third-largest telco is eyeing the advisory business to corner the opportunities in this under-tapped segment. The two firms and several companies in West Asia, have expressed interest in Coal India’s proposed aluminium project in Odisha, two officials aware of the matter told Mint The world’s biggest coal producer recently invited expressions of interest (EoI) for equity partners in the project that includes bauxite mining, alumina refinery and aluminium and an associated coal preparation plant.(Full report) Adani Power, Tata Motors, Biocon, Marico, NTPC and otherstocks that will be in focus today. Gold prices gained on Wednesday, following a selloff in the previous session that pushed bullion to a seven-month low, after the dollar halted its rally. Spot gold rose 0.4% to $1,770.71 per ounce, as of 0059 GMT. U.S. gold futures firmed 0.3% to $1,768.80. Gold lost more than 2% on Tuesday. Safe-haven demand strengthened the dollar in the previous session to levels last seen in 2002, making greenback-priced gold more expensive for buyers holding other currencies. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/live-blog/share-market-live-updates-sensex-nifty-bse-nse-stock-market-today-06072022-11657072299664.html",
    "original_url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNVDVaMHhKUWhLOU82YlhYcGxvc2ltMzRCSElLYXJhUEEzSENfRDk1WU51djFuNDZYWW9tMm5fZXo2U1pLaU1YS1B0WnZKZ2FMd2VQUUx6d3ZEbEtpYnNmcHc4RWlZNWV1bWJHMGZHbk9MZEZVZWd1TGVJanBJTXVLQlBuM3JpUWlUQWg3YUUtdUhnZEc3OWlUeWpzTmVTT1Zock1kZkgwTWdTa1UzX0hOVXhuWDNBamdOdWQ5Z3J3OXJ5T1Y2UWtzNk1YZ1JfV3JvOGfSAdcBQVVfeXFMTWJlclJhMl94em5GR3FNdGRaSnZ3dU5xeFp2Yncwd1dFX3FYU3hNVGctWjdoVkFGOWdCNEk5OGNpcUdsS0lpUkxha3dkMUZXZW10Q05xTXFjN1Bkd0VLNXZmVWFkU3BtZ0ZSZVcwTlphNVMyMWpsc2lSbWk1QUh0THFGemM0eHJLaHBBamh6QjM3bU84TjFOSzRXQXpEenh6cEFSVWdXR3d2eE4xUHRzQlBNaHo5N0tzdDdIVUJBRVdLRDljMmU4V0Q1RUU4cUdYVTBNc3ByVW8?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 19690,
    "word_count": 3187,
    "gnews_title": "Sensex jumps 616 pts; Nifty ends near 16,000; Bajaj twins, HUL top gainers - Mint",
    "published_date": "06/07/2022",
    "publisher": "Mint",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Today: Indices erase intraday gains to end lower; Sensex crashes 311 pts, Nifty settles below 17,550-mark",
    "body": "Market Today:The frontline indices on the BSE and National Stock Exchange (NSE) erased their intraday gains and ended around 0.5 per cent lower on Thursday on expiry of August-series futures and options (F&O) contracts. The S&PBSE Sensexcrashed 310.71 points (0.53 per cent) to end at 58,774.72 while theNifty 50declined 82.50 points (0.47 per cent) to settle at 17,522.45. Both the indices had opened over 0.4 per cent earlier in the day and traded higher for the bulk of the session rising around 0.7 per cent before giving up their gains and ending lower in the last hour of trade. On the Sensex pack,Bajaj Finance,Infosys,Tata Consultancy Services(TCS),IndusIndBank, Axis Bank, Power Grid Corporation of India, NTPC, Larsen & Toubro (L&T), and Housing Development Finance Corporation (HDFC) were the top losers on Thursday whileMaruti SuzukiIndia, State Bank of India (SBI) and Dr. Reddy’s Laboratories ended higher. Among the sectoral indices, the Nifty IT index fell 0.87 per cent, Nifty Metal index slipped 0.51 per cent and Nifty Pharma declined 0.40 per cent. On the other hand, the Nifty PSU Bank index rose 2.74 per cent and Nifty Realty climbed 1.47 per cent. In the broader market, the S&P BSE MidCap index ended at 25,019.90, up 50.56 points (0.20 per cent) while the S&P BSE SmallCap settled at 28,315.61, up 48.97 points (0.17 per cent). The volatility index or India VIX on NSE climbed 6.18 per cent to 19.57. Summing up the market, Deepak Jasani, Head of Retail Research at HDFC Securities noted, “Nifty fell on Aug 25, snapping a two day rise, on the monthly F&O expiry day, disregarding the mild gains in markets elsewhere. Nifty opened gap up and rose mildly in the morning. Post 1415 Hrs, a sell-off was seen in the Nifty leading it to close 0.47 per cent or 82.5 points lower at 17522.5. Among sectors, Realty and Consumer Durables were the main gainers while IT was the main loser. Broad market performed better than the Nifty as is evident from the positive close in Smallcap and Midcap indices and by the positive advance decline ratio.” Commenting on the Nifty he said, “Nifty has formed a bearish engulfing top on daily charts and seems to have formed a lower high on short term basis. Unless the high of 17,727 is breached, Nifty could witness declines/sell on rallies. A downward breach of 17,345 could lead to acceleration in the fall.” Share markets pushed higher and Europe’s bond markets and euro stole a breather from energy-price driven sell-offs on Thursday, as investors waited to hear the latest reaction of the world’s top central bankers to soaringinflation. Asia had tailgated Wall Street higher overnight and Europe’s bourses did the same as oil and gas stocks made another 1.5 per cent jump amid intensifying worries of a Russian gas supply crisis. The 0.7 per cent rise in European stocks left MSCI’s 47-country index of world shares up 0.4 per cent with US stock futures pointing to similar gains for the S&P 500 later. MSCI’s broadest index of Asia-Pacific shares outside Japan edged up 0.7 per cent, after US stocks ended the previous session with modest gains. Australian shares climbed 0.7 per cent, while Japan’s Nikkei stock index was up by 0.72 per cent. China’s CSI300 rose 0.8 per cent while Hong Kong’s Hang Seng Index surged 3.6 per cent in a shortened trading session due to a typhoon. Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/share-market-today-august-25-stocks-bse-sensex-nse-nifty-rupee-global-cues-8110376/",
    "original_url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQdHd6NjJULS1nV3JLaWhyWHpZNjd6R2tsUnAyQTgxNjBlWnpZS3BzMDhLM2NJbV9hSUdSUVhnRmhWUE9GamZFZURsLVpuTzgtM1dwNFk5V0FSaHBteGJNU1NGQkg5UF9QeHFERy1WWkJMTWxNLWNtVFZzWEo1cU9fTm40dzdZdFIySzR1dEJyUllFWHUzYnI1bndOUU5Bci1GNU1hVXhkUDNhaWVJaWZSUDkyRm8xTDNMVVlQTFlMaW9VajIxUDNKWFV0clJaUdIB1AFBVV95cUxNc3IzV0ZTT0NVSHNnaElwaEdDMFhacGlKV2QxMUxjeldkUG1PQm82X0pLTzRyU2wzLVM1eVBDbDZNMkJiQUM4Yl9SdWpEb2xoUlMtMXRXQWZkMldWdnNXT0hoWXRXZll6MEdLdFhPYlh0RXpzcUhLalF4WXBwaGZaQ1pvWF9vNkY1enZDLURPelVqS1lPcEpMd2g5eHdYdWp0MUFhV29wdndlLXdTOXIxUFN3MHNnZUcyQXRqTFBXakZ6WEtYbzRiOElLZmMwN2w5eTB3dA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3739,
    "word_count": 630,
    "gnews_title": "Stock Market Today: Indices erase intraday gains to end lower; Sensex crashes 311 pts, Nifty settles below 17,550-mark - The Indian Express",
    "published_date": "25/08/2022",
    "publisher": "The Indian Express",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Highlights: Sensex ends 105 pts higher and Nifty settles above 17,800 — rupee jumps to 79.58 vs dollar",
    "body": "Stock Market Highlights: Sensex ends 105 pts higher and Nifty settles above 17,800 — rupee jumps to 79.58 vs dollar Stock Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty50 extended gains to a second back-to-back session on Friday, led by gains in IT shares though losses in oil & gas shares played spoilsport. Broader indices Nifty Midcap 100 and Nifty Smallcap 100 finished the day 0.4 percent and 0.1 percent higher respectively. Dalal Street took positive cues from global markets, where stocks rose as investors digested hawkish remarks from Fed policymakers and the ECB's biggest ever hike in its key interest rate. By CNBCTV18.com September 9, 2022, 4:06:50 PM IST (Updated) 1 Min Read Stock Market Highlights : Indian equity benchmarks BSE Sensex and NSE Nifty50 extended gains to a second back-to-back session on Friday, led by gains in IT shares though losses in oil & gas shares played spoilsport. Broader indices Nifty Midcap 100 and Nifty Smallcap 100 finished the day 0.4 percent and 0.1 percent higher respectively. Dalal Street took positive cues from global markets, where stocks rose as investors digested hawkish remarks from Fed policymakers and the ECB's biggest ever hike in its key interest rate. Catch highlights of the September 9 session, and more, here : Continue Reading First Published: Sept 9, 2022 8:01 AM IST Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags india stock market IPOs nifty sensex",
    "url": "https://www.cnbctv18.com/market/stock-market-live-update-today-sensex-nifty-ecb-rate-hike-jerome-powell-14686901.htm",
    "original_url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPaEpWa1JBMlRDVmYzVWxtMzB6MUt2V3RvSi1mR0N3cVk0NWNXOHh4ejl1MXlPTENsWi00U3VuOXhPODk1VWYtcFREZDh1VmFhUG4wdVRMbDZlTFQ1ODBaYlNqMnlsMUdUNGlmQThCYUJTWXJESTBBZVFJUVpXc0hDTm5rNWJzbjdrbkxWYVN2ODJWSlR3ZGNnTjFrUktWRDM0U2xvbjBpUnAwaTgzUjRJSzRZQUhlaTTSAbwBQVVfeXFMTy1rUy1wZmFGcVBZSjZNNVM4LTBwUkRoWXhpRktCSW1YX2gwRXdfMjRnWV9fb0t1LWRWZHNxMUp2TTBpZTBxWUVQeWdyUFhFV2F0SW1xSjNDNUNLdWl6dm9PS2x1ZWM4MVhKQ0cxd3VxSmxsaU9URWZrY1hHRzJlSjNaM0hrdEFSSDNiZHh1NEtUUkxyNDNOLXEtdm4tS09sSm02NEk0MnNwX0JSYUs2OFNDTXAxS1NxMmVUQnk?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1587,
    "word_count": 259,
    "gnews_title": "Stock Market Highlights: Sensex ends 105 pts higher and Nifty settles above 17,800 — rupee jumps to 79.58 vs d - CNBC TV18",
    "published_date": "09/09/2022",
    "publisher": "CNBC TV18",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Today: Sensex rallies 659 points, Nifty ends near 17,800-mark on positive global cues",
    "body": "Share Market News Today | Sensex, Nifty, Share Price Today:The frontline equity indices bounced back after a two day losing streak to end around 1 per cent higher on Thursday tracking the positive cues in the global market. The S&PBSE Sensexjumped 659.31 points (1.12 per cent) to end at 59,688.22 while theNifty 50rallied 174.35 points (0.99 per cent) to settle at 17,798.75. Both the indices had opened around 0.6 per cent higher earlier in the day and extended gains as the trade progressed with the Sensex hitting an intraday high of 59,711.96 and the broader Nifty touching 17,807.65. On the Sensex pack, gains were led by Axis Bank,Tech Mahindra, ICICI Bank, Mahindra & Mahindra (M&M), State Bank of India (SBI) and UltraTech Cement were the top gainers of the day. In contrast,Tata Steel, NTPC, Titan Company andNestle Indiawere the top losers. Among sectoral indices on NSE, the Nifty PSU Bank index surged 2.51 per cent, theBank Niftyrallied 1.91 per cent, Nifty Financial Services jumped 1.48 per cent and Nifty IT climbed 0.97 per cent. On the other hand, Nifty Metal fell 0.90 per cent and Nifty Media declined 0.45 per cent. In the broader market, the S&P BSE MidCap index rose 75.57 points (0.29 per cent) to end at 25,895.23 while the S&P BSE SmallCap climbed 175.96 points (0.60 per cent) to settle at 29,474.63. On NSE, the volatility index or India VIX declined 5.48 per cent to 18.31. “The domestic financial market experienced a wave of optimism tracking strength across global markets as oil prices eased, cooling investor concerns about risinginflation. Despite premium valuations, consistent FII inflows are aiding Indian bourses to stay resilient. On the sectoral front, auto stocks were in focus as retail sales of automobiles grew 8.31% YoY in august while banking stocks moved in sync,” said Vinod Nair, Head of Research at Geojit Financial Services. Global stock benchmarks mostly rose Thursday as investors closely watched a European central bank meeting and sought to juggle concerns about inflation and recession. France’s CAC 40 rose 0.1 per cent to 6,113.98 in early trading, while Germany’s DAX slipped nearly 0.1 per cent to 12,904.97. Britain’s FTSE 100 added 0.4 per cent to 7,269.52. US shares were set to drift lower with Dow futures down nearly 0.1 per cent at 31,559.00. S&P 500 futures slipped 0.1 per cent to 3,976.25. Japan’s benchmark Nikkei 225 surged 2.3 per cent to finish at 28,065.28. Australia’s S&P/ASX 200 gained 1.8 per cent to 6,848.70. South Korea’s Kospi rose 0.3 per cent to 2,384.28. Hong Kong’s Hang Seng dropped 1.0 per cent to 18,854.62, while the Shanghai Composite fell 0.3 per cent to 3,235.59. Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/share-market-today-september-8-stocks-bse-sensex-nse-nifty-rupee-global-cues-8137971/",
    "original_url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPWk9fT2VTdWZHT1NPVUlUdURlLXBfQXZLbDVuc2dEOEUzNXRXcjJOZHhqeVNGczRlcnc4RTdLV0xuR0lpSEQ3Vy1CSWowbDlNdTFhUjV1Z0N5X05wcTdEalUtTWdEZnNWQlhUTTdyNkZCNWJqRmVDTWROOTBnSzdkQnltcVlMV19xNEcwd3NSOHgxN2NDOUFDbm51LVFtV1EtRW9sYWtPWEc4VjA5dzVrNUUtWmFiVDZGM3R6LTYxTWJ3SjZkOGItMUdVb19NbEtU0gHXAUFVX3lxTE9NRVJaZHdCdDkwOXZhR1Vyb04wS2kwSm9RMXU3SlFpVElmQWVybTJUcWdVQkFYcmE5SzBxdkpHNkM5Z3V6ejFfUzVnaDNBZnVRVElEaUdicWFxU2xvbHZoTGktRk5PQmNDNDB0YjF3alo4eHJkLWZMMUlwdFpVTDFBSUlFN0lZMWFhLXRLeEZ1WDlPclpWZHpueWpFOTIyRE42TlBCNlNlMnE2M0cwTE8zcDUzajdCaFJkN3lfb3dsOVRnTmFkTTRxNDFJQ0FKMXpDYWFRcnlN?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3055,
    "word_count": 506,
    "gnews_title": "Stock Market Today: Sensex rallies 659 points, Nifty ends near 17,800-mark on positive global cues - The Indian Express",
    "published_date": "08/09/2022",
    "publisher": "The Indian Express",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Highlights: Sensex ends 180 pts higher, Nifty reclaims 15,800 as HDFC twins, ICICI Bank help market snap 6-day losing streak",
    "body": "Stock Market Highlights: Sensex ends 180 pts higher, Nifty reclaims 15,800 as HDFC twins, ICICI Bank help market snap 6-day losing streak Stock Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty50 managed to finish a volatile session in the green, halting a losing streak that stretched to six back-to-back sessions and dragged the headline indices more than five percent each. Gains in financial and auto stocks pushed the headline indices higher, though losses in IT shares limited the upside. Broader markets managed stronger gains than the benchmark indices, with the Nifty Midcap 100 and Nifty Smallcap 100 indices rising more than one percent each. Investors awaited the last leg of the earnings season for direction. By CNBCTV18.com May 16, 2022, 5:18:53 PM IST (Updated) Stock Market Highlights : Indian equity benchmarks BSE Sensex and NSE Nifty50 managed to finish a volatile session in the green, halting a losing streak that stretched to six back-to-back sessions and dragged the headline indices more than five percent each. Gains in financial and auto stocks pushed the headline indices higher, though losses in IT shares limited the upside. Broader markets managed stronger gains than the benchmark indices, with the Nifty Midcap 100 and Nifty Smallcap 100 indices rising more than one percent each. Investors awaited the last leg of the earnings season for direction. Catch highlights of the May 16 session, and more, here : Continue Reading First Published: May 16, 2022 7:43 AM IST Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags ACC Ambuja BSE Sensex LafargeHolcim LIC IPO Nifty 50 Russia-Ukraine war",
    "url": "https://www.cnbctv18.com/market/stocks/stock-market-news-live-updates-sgx-nifty50-bse-sensex-holcim-acc-ambuja-cement-stocks-covid-lockdown-brent-crude-bitcoin-gold-rate-vix-13495342.htm",
    "original_url": "https://news.google.com/rss/articles/CBMilAJBVV95cUxOeFZvZEZ0Y2FvSFY4amVPT0JXb0djQ0plaU9PSXBlRFVWSk1yU2FEOGhyMkl6bDM5RVJBelNqZnJwaFY1YVNpVkJjcXpjNG04YlZsX05wc1l2cXFYdTlaTXV6dTBUNF9BUEhIWG1MLWNVdmoxOWRxWjZLejZyTmJHV2pvLVhzWWcteTdNMVRoaFVfQVFLa0tFNUlTUzBXeEZhZ29oWkR4Y0RjOVhrR1hOMml3UlNLSkJvYzRJZ2d6cmh5X29oWkg1ZWFzaktSZlB4Y3pmckp2TnhKZ0Jqc1l2LWpEMWZLd0d1TXZ0azd2RTZMWXpnNjgwZThYYy03YXQ5dnNWN1lXelpmcXRiMjZZYmdIUGLSAZoCQVVfeXFMT2pvamczdEF2VjlXOFRHNnVEcmJUcjlqbTdoT3R5SldnUUh3NUFBdENpMDNYOHdxR0RyZVVIZC1scThSZnZGbnVSZUQ0cmVSWDJGV1ZYWnRwZWo5eDdxb0pMejFNMkJ4Qll6R3RJTHBXOFE5VmgybjRxaWloTF9oTlFmZTgzdTZlQ2ZwVU5VZkpvRkVZcXlUQnhWSGhoc2R2UldpaDQxbm9wWm5kTlJHQjdoLVlpOXlFUUE0VjhkelVWRmV1WTExVVFUcVB4dmNvbmh0WHNuRDVrUnV0M240OVFIV1ZQMGp1VkREbTQwVHlfa0NuQk42TkZ2S3lQUkxzeVMzTTB2MVBwdFI5c1VqTEVNUVVNYXhpaER3?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1779,
    "word_count": 285,
    "gnews_title": "Stock Market Highlights: Sensex ends 180 pts higher, Nifty reclaims 15,800 as HDFC twins, ICICI Bank help mark - CNBC TV18",
    "published_date": "16/05/2022",
    "publisher": "CNBC TV18",
    "topic": "BSE Sensex India stock market"
  }
]