[
  {
    "title": "Stock market crash: Sensex tumbles 650 points, Nifty down 150",
    "body": "Stock market crash:The stock market tumbled down into the red during the early trading hours of Tuesday, January 21. At 10:40am, the benchmark BSE Sensex was down by 648.90 points or 0.84%, reaching 76,424.54. Meanwhile, the broader NSE Nifty was down by 149.15 points or 0.64%, reaching 23,195.60. Also Read:Groww's parent company Billionbrains Garage Ventures eyes₹6,500 crore IPO this year: Report Themarkethad however, opened on an optimistic note into the green. Among the 30 Sensex stocks, Zomato Ltd fell the most by a huge 10.98%, trading at₹214.50. This was followed by Adani Ports and Special Economic Zone which fell 1.96%, trading at₹1,126.55, and Reliance Industries ltd which fell 1.71%, trading at₹1,282.65. Also Read:X and Bluesky launch new video feeds amid TikTok's uncertain future Zomato had just released its third quarter financialresultsfor the financial year 2024-25 yesterday. It reported a 57% fall in net profit despite its revenues rising 64%, due to mounting expenses. Only 3 out of the 30 Sensex stocks were in the green. Those were UltraTech Cement Ltd which rose 0.84%, trading at₹10713.90, ITC Ltd which was up 0.51%, trading at₹440.00, and HCL Technologies Ltd which was up 0.50%, trading at₹1,804.80. Also Read:Donald Trump's meme coin soars on his first day in office, lifts up other cryptocurrencies Among the Nifty Sectoral Indices, Nifty Consumer Durables fell the most by 3.38%, reaching 38,384.40. This was followed by Nifty Realty which fell 2.67%, reaching 920.10, and Nifty Midsmall Financial Services which fell by 2.05%, reaching 15,292.30.",
    "url": "https://www.hindustantimes.com/business/stock-market-down-today-sensex-tumbles-points-nifty-down-101737436367214.html",
    "original_url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQZWh1Y1Buc2JsdmEzRmFvalNpUjFWSWpwRExoVEpYb00ydzZqM3hQRUJkcC1oNnREazVabkM2VmlMUzR2dFN1R04xLWZUZzh0TjFfTmNBQ1ltZlRhOUdpOVI3UWw2c2FNTjVPc2ZPQTBSZG5fNVV0MHI5MktNOE9LdmdNN1hSSjJVSzBDOGVhbUxZTUZFY3d0NDlKYm1jV29pSEYtb2x4WXprQUtlaHpPcHJWaXZKNU0w?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1586,
    "word_count": 246,
    "gnews_title": "Stock market crash: Sensex tumbles 650 points, Nifty down 150 - Hindustan Times",
    "published_date": "21/01/2025",
    "publisher": "Hindustan Times",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Terrible Tuesday! Sensex sinks 1,400 pts; why are stock markets falling?",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Jan 21 2025 | 11:40 AM IST RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8%",
    "url": "https://www.business-standard.com/markets/news/terrible-tuesday-sensex-sinks-849pts-why-are-stock-markets-falling-today-125012100475_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNQlZwQ0QwY0RQTE5lQU40dDdnZ1hHZUNwZXlEWlN5c3FQdEVNU0s5eHU1QUJqVDlkaFNEbXhpbjI3RmZsY1JNanozZTdpOW9TMElCTDNzeGlXTUxPem44di1kOWxubWNwbDduRkppcTN2ZGdPemVWcW9udkg1SFZkX1lpVTUxeG00MFBEU3ZpeG9ySUJGcHFZejZVbHVDdUp5SXdCTTh5S3JvRU16d3BpNi14Y3BhZDVnTEF2TVEtNkZoLUxwVVNhWFlIT1hlbWNLa0ktWHNB0gHbAUFVX3lxTE9ZNW1mb0psU2dDdjdWZnhKM0NCcHRmWldMcEZMelIzZXpNaFFLMlpZandmb3lOM0dQNDJGOVdWUHRFajhrT3Vfcm9UVEZ3TjEtS0ZOZE9oZjdVNEtHdktRcmluV3BSSjRaMDdZcnBRTkNkdGg5M2ZFRWNwbnNScUhLeGtSWTdIZHBpUHpFVzZZVzZPaVVRUlJrTlNmZWV0QW11ZFQxRERQdHplR0lfbzQxeXZNM1ViRGJtWWhFNERiUkt3bkREV3o5cF8zdUxKcDJDclFOQTdiQnVCcw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 502,
    "word_count": 98,
    "gnews_title": "Terrible Tuesday! Sensex sinks 1,400 pts; why are stock markets falling? - Business Standard",
    "published_date": "21/01/2025",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex jumps 600 points. Why is stock market rising today?",
    "body": "Benchmark stock market indices gained on Monday, fuelled by gains in banking and financial services stocks, which countered concerns over US policy framework under US President-elect Donald Trump. While volatility on Dalal Street gained during the trading session, gains in major shares such as Kotak Mahindra Bank, Wipro, Bajaj Finance, Bajaj Finserv, SBI and Reliance Industries contributed to the market gains. The S&P BSE Sensex had jumped over 600 points in early trade. At 12:35 pm, the 30-share index was up 512.23 points to 77,131.56. The NSE Nifty50 was trading 130.35 points higher at 23,333.55. One of the major factors behind today’s gains on Dalal Street was a 10% jump in the share price of Kotak Mahindra Bank. Kotak Mahindra Bank shares gained after the private lender reported strong results in the third quarter. Analysts have also shared bullish views on the lender’s stock after the Q3FY25 results. IT giant Wipro’s share price also jumped sharply after it reported better-than-expected results in the December quarter. Wipro’s stock jumped as much as 8% in early trade to hit a day’s high of Rs 305.35. Wipro’s consolidated profit jumped 24% year-on-year (YoY) to Rs 3,354 crore and revenue from operations rose 0.5% to Rs 22,319 crore. The IT firm also declared a dividend of Rs 6 per share. Although Wipro’s results were in line with estimates, brokerages still want investors to remain a bit cautious due to challenges in critical verticals and geographies. Despite today’s gains, Dalal Street is likely to remain volatile as global stock markets will be in a wait and watch mode as Trump 2.0 unfolds today, said Dr. VK Vijayakumar, Chief Investment Strategist, Geojit Financial Services. “Many executive actions, particularly on immigration, are expected from the President starting from day one. Markets will wait and watch for the nature of the decisions and their likely impact,” Vijayakumat added. On the brighter side, he highlighted that the latest International Monetary Fund (IMF) report on Global Economic Outlook projected India to register a solid growth of 6.5% for 2025 and 2026 for India. “This is positive.” He also noted that there is a flurry of Q3 results this week and the market will respond to the results depending on, apart from the numbers, the outlook and management commentary. (Disclaimer: The views, opinions, recommendations, and suggestions expressed by experts/brokerages in this article are their own and do not reflect the views of the India Today Group. It is advisable to consult a qualified broker or financial advisor before making any actual investment or trading choices.)",
    "url": "https://www.indiatoday.in/business/story/sensex-jumps-600-points-why-is-stock-market-rising-today-2667253-2025-01-20",
    "original_url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQcUhsVDRlTTVYYVhlNUlCeXI0eW1fZnZlbXJxaVhkbHZCRV9zMmRjdDNNT3BQLWc4TWJmSnZ4bTRvU3BBcnRLX1VYc2YwWWJYWTBmLWpZNDk5bDQzeHlFV3htc2l2OC1uSHl5X3d2dzRrRzQ3QU1jTWV0Q0NUa1hQaWVVRTdFbE5sUVpuS1Zoa21DTnNSM2RhNWstTHdBUlN2Um5vMHpFUnhCeUhseC02ckpkbHlmWVHSAbwBQVVfeXFMT0tCOTY0YmdTS1lNTHRxTTAyekJoY3A1Z1QyMk92Zmx3SkJ4bTR4OTFGUHMzYVlOdXBkY2lORnR4WDdTLVhwcjZ3ajdXQVpJd1p1X2sxVjQ4WXg1d2hKaW1DaFVjMUlXOGFzMDNrUXVvakh3TE5rajhEb05BNlAwTzZJR3hIZmllMS1PR2c1Z1RuNEZIVjVya21XZVNuQ0hCejZwTU9oSmUtVnBJS1B0cW9iUF9rU2Nna2N2VlA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2636,
    "word_count": 424,
    "gnews_title": "Sensex jumps 600 points. Why is stock market rising today? - India Today",
    "published_date": "20/01/2025",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex crashes over 1,200 points: What's behind  ₹7 lakh crore market rout today? Here are 5 key reasons",
    "body": "Stock market crash:The Indian stock market witnessed a strong selloff in trade on Tuesday, January 21, as investors remained cautious after US President Donald Trump unveiled plans for trade tariffs on neighbouring countries shortly after taking office. Both benchmark indices, the Sensex and the Nifty 50, declined over 1 per cent each. The 30-pack Sensex declined 1,235 points, or 1.60 per cent, to close at 75,838.36, while its NSE counterpart, Nifty 50, lost 320 points, or 1.37 per cent, to end at 23,024.65. Shares of Zomato, NTPC, Adani Ports, ICICI Bank, SBI and Reliance Industries ended as the top losers in the Sensex index. Only two stocks- UltraTech Cement and HCL Tech- closed with gains in the index, while shares of Hindustan Unilever ended flat. The BSE Midcap and Smallcap indices dropped 2 per cent each. A sharp selloff in the Indian stock market wiped out over₹7 lakh crore of investors' wealth, as the total market capitalisation of BSE-listed firms fell to approximately₹424.3 lakh crore from₹431.6 lakh crore in the previous session. Investors sold equities across sectors as all sectoral indices on the NSE ended with significant losses. Nifty Realty and Consumer Durables ended with a deep cut of over 4 per cent, while Nifty Bank, Auto and Financial Services closed almost 2 per cent lower each. Here are five key factors that weigh on stock market sentiment: On the very first day in office, Trump made several announcements, including tariffs on Canada and Mexico. Trump has threatened higher tariffs on several countries, including India. His immigration policies could also impact the Indian tech sector. \"Trump 2.0 has kicked off without much clarity on Trump’s likely economic decisions. In his inaugural address, he was clear on immigration but sounded vague about tariffs. The indication of a likely 25 per cent tariff on Canada and Mexico suggests that the tariff hike policy will be implemented gradually,\" said V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services. According to Prashanth Tapse, Senior VP (Research), Mehta Equities, investors now fear that Trump's inaugural speech to safeguard America's interest could hurt the economic prospects of many countries, including India, going ahead. Investors are now focused on this mega-policy event. Finance Minister Nirmala Sitharaman is set to present theBudgeton Saturday, February 1. Expectations are high that the government will announce measures to boost consumption, strengthen the rural sector, and support manufacturing and infrastructure, all while maintaining fiscal prudence. However, any disappointment in key expectations could deliver another blow to the already weak market sentiment. A relentless selloff by foreign portfolio investors (FPIs) amid the strengthening US dollar and rising bond yields is a key factor behind the Indian stock market's downtrend in recent months. Except for January 2, FPIs have been selling Indian equities every day in January, offloading nearly₹51,000 crore as of January 20. After weak Q1 and Q2 earnings, the December quarter earnings so far have also been unimpressive, exhibiting mixed trends across sectors. Experts say disappointment on the earnings front is keeping market sentiment subdued. \"While the Indian economy is doing fine fundamentally, corporate earnings have been weak for a few quarters as economic activity has slowed. Markets track earnings and flows,\"Priyanka Khandelwal, a fund manager at ICICI Prudential AMC, told Mint. The Indian economy is showing signs of weakness, which has contributed to the cautious sentiment in the market. \"We are not seeing broad-based demand growth in the country, which is delaying the intensity of the private capex cycle we should see in India. Government capex has also slowed down, and that’s hurting non-farm employment. Hence, despite the policy interventions to accelerate growth in our economy, we’re seeing softness,\" Khandelwal said. Read all market-related newshere Disclaimer:The views and recommendations above are those of individual analysts, experts, and brokerage firms, not Mint. We advise investors to consult certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-crashes-over-800-points-whats-behind-rs-5-lakh-crore-market-rout-today-here-are-5-key-reasons-11737436076143.html",
    "original_url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxOcllOclhJQXFzcDlPbkVZWnZwN0pOSEtJaFFxa2s3MS1YenQ4T3BQX0p6cTVza0ROcEh5UUU4Rmk1eUU0eksyUmNpbXN0TzZKeHNCVk9rbUdsdjVhUnJSWGR6MWtRMUtBZWE3RUt5WWhKa0FIWjhBdVpKSmJ5bjJXcnpqRllpN0xkbUFoSVA2UU1DanJyaXVIWUFfWXNhMzNRNk5Bd1Q1UnFaQkNPd202SWl4akhoa3NKR2VUVDBmMlFzVUJrYU5NOXBfZGFDRElLZ3pKYkVyMmZkSE90NWVaLXc5a3c1ZGRLRmJjVXdxRXdrbk12RmxvZzNqRkM3NU3SAYQCQVVfeXFMTzVmYUxQZ2RVSjdBaENFNHJiVXVoZklpOVJmOG9sWUI1TFhrZC1CdExMU0J6ZmJOeDdzUUpJT0tlUUg3VGhqX1FnT1EzYVQ3bzh3TEQ3Zm5BYUwzUVl5NUhpemRFdHdJVEV3aHJQOEVSZVR4c3F6RC03Vlc4VklYTmZXeERVRHZfNXk2NVJKNVoyeDBLenBGaFh5ejlibVdwMWJmN3pMWWJYRko0aXNDaDcxaV83aVlWeklzYlJrX1p0a2E3TDJZQzVQMGp1dUdBeDNlekh4ajdSV2pDQ1o5SUFqZnd5NDdTZzdVNUFhTk9uNGNENnJERmxlREtQc3E3QW51Znk?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4421,
    "word_count": 676,
    "gnews_title": "Sensex crashes over 1,200 points: What's behind ₹7 lakh crore market rout today? Here are 5 key reasons - Mint",
    "published_date": "21/01/2025",
    "publisher": "Mint",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex tumbles over 800 points. Is Trump 2.0 behind stock market bloodbath?",
    "body": "Benchmark stock market indices fell sharply during Tuesday’s trading session after rising in early trade. The S&P BSE Sensex was trading 800.18 points lower at 76,281 at 11:12 am, while the NSE Nifty50 dipped 200 points to 23,144.75. All other broader market indices also declined sharply during the session, impacting smallcap and midcap stocks. Volatility also registered a sharp increase during the trading session. Donald Trump has returned to the White House for his second term as US President. Hesigned a bunch of executive orders, but it was his remark on tariffs that seemed to have rattled global stock markets, including Dalal Street. He announced plans to announce trade tariffs on neighbouring countries just hours after taking office. Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd, said Trump’s tariff decisions remain a wildcard despite no immediate announcement. Dr. VK Vijayakumar, Chief Investment Strategist, Geojit Financial Services, added that Trump 2.0 has kicked off without much clarity on his likely economic decisions. \"In his inaugural address, he was clear on immigration but sounded vague on tariffs. The indication of a likely 25% tariffs on Canada and Mexico suggests that the tariff hike policy will be implemented gradually,\" Vijayakumar said. \"It is likely that further delays in tariff hikes will weaken the dollar and bring down the bond yields. If this happens, it will be good for emerging markets like India. But if the FII flows to India are to turn positive consistently, we will have to see a pickup in India’s GDP growth and corporate earnings,\" he explained. \"That’s the crucial macro data to watch,\" he added.",
    "url": "https://www.indiatoday.in/business/story/sensex-tumbles-over-800-points-is-trump-20-behind-stock-market-bloodbath-2667838-2025-01-21",
    "original_url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQYU9QbXVMcGNpNU4ta2gydkh1LUVkZWZLVzFYdnlrTmNyekJtMFA5LTBrZEpNSG1aUzdtdnQ0RmhRazYwN0s2NFZRUmt3Njh1OElhWXV0RV9DUlZVaXZQbkdXV0RUMXA4TXBKU2tQMllHaXZCOGkycTNTMllsTTg4SG5GQnRsdGtsVEwwX3RwYUVUSHlWa0wxYlpmWnkyUkkzeTE2Tk1Yby1iaXN5SHY3dEwtdXlUR2V6eHRIRkw2ZVoyaGEtQ2hZcjVYZWrSAdIBQVVfeXFMTnpLT0xXXzZ2LU1BX3JxU0dtckZaTVVBTHJxYWpjcndlSFlZSkpJdGdPYkZsOTMzSDEyTEF1TkdaSUFPby1HME5MTWJ0bHg4bjB1MF9hVXZEUVg3M2RTd1p5OGRrbE9hYlo0bHcwLUxncERfcktCQjNSZ1NKWVdrM29LOEprMXptdDg3R0hWX0xOOW5CbGFfT19TV0VwYkhCZVpyOWFZMndScmZHekZIN1JMSHB6d2dRNDdaUDFac294ZmNfVTdMbkF0c1lsSm1OTGl3?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1667,
    "word_count": 266,
    "gnews_title": "Sensex tumbles over 800 points. Is Trump 2.0 behind stock market bloodbath? - India Today",
    "published_date": "21/01/2025",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Highlights: Nifty forms a bullish hammer pattern. What traders should do on Tuesday",
    "body": "Om Mehra, SAMCO Securities, notes that Nifty's daily chart shows a bullish hammer pattern, hinting at a trend reversal. After consolidating around 23,150–23,200, the index seems poised for an upward move. Positive RSI divergence and a narrowing MACD histogram indicate reduced bearish pressure, supporting potential consolidation or a minor pullback before further gains. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-20-january-2025/liveblog/117382514.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPTXE0UEFEa1FKaFJVY3p6aURSTjdjRVR1ekFicS0yS3BsWG5kQlZ3VWVFalVIQUxLbS05U2hzMmVMaG9fR1lzdnZGSXE2ZkVMbDhNeDA4SnZwbXZpVnBHZlBOWmZGY0R5bWN0TW84Y2JLNGw2eVFRNXNDOUJQdE82Um9jQmloS2RiTVhPLXVhUW0zN0ZYUHlySEY3QjRoaTZxdVFFNUhpWmdBUGxGeWtId1BDaU9qV3ZqZU81SHFoMnBhcXBSVnJ0aks4WmZ1M1BPV0ZNcWUxWdIB3AFBVV95cUxNdDltWXNpXzl4MjVoUDdmcWl3Z3dDeTAzSDNwQU1zb3FETFJWdHBrWGhrTFRZMmVTNnROVl9NM0tWQWsxc0thb2tFaE00UWx2SUpwWVJaOWNRVURlbTFRM3BiMDE5cGNtTkV2c0dWVXhGVlJ2MHl1aTVydGFwNXZDY0hoTE9LRy0zTjJxckJCYUN3WHd2TzFOOEFRWFhyc0h4ZFE3MXZFZE5rampUQ3NZcGRlVVFVV0tsdUVOUEJZU2FqdXFDMnBNTXhPWWgzalJjams2dnNrbUh1d2VU?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 685,
    "word_count": 105,
    "gnews_title": "Stock Market Highlights: Nifty forms a bullish hammer pattern. What traders should do on Tuesday - The Economic Times",
    "published_date": "20/01/2025",
    "publisher": "The Economic Times",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Crash Highlights: Sensex sinks 1,235pts, Nifty ends at 23,024; broader indices bleed 2%",
    "body": "Stock Market LIVE Updates: Market expert view Stock Market LIVE Updates: Technical view Stock Market LIVE Updates: A glance at broader market Stock Market LIVE Updates: Here's a look at Nifty gainers and loser at close Stock Market LIVE Updates: Here's a look at Sensex gainers and loser at close Stock Market LIVE Updates: Nifty settles 320 pts lower at 23,024.65 Stock Market LIVE Updates: Sensex closes 1235.08 pts lower at 75,838.36 Stock Market LIVE Updates: Infosys recognised as a Top 3 IT services brand by Brand Finance Stock Market LIVE Updates: Indian economy projected to grow in range of 6.5-6.8% in FY25: Deloitte Stock Market LIVE Updates: 3 PM update; Sensex down 1220 pts; Nifty below 23,100 Stock Market LIVE Updates: ICICI Bank shares fall nearly 3%, hits four-month low ahead of Q3 results Stock Market LIVE Updates: Sensex down over 1200 pts, Nifty tanks 340 pts to 23,000 levels Stock Market LIVE Updates: Reached Rs 6-trn AUM without ads: Nithin Kamath on 16 mn Zerodha clients Stock Market LIVE Updates: Adani Energy wins mega order Stock Market LIVE Updates: Indoco Remedies drops 4% on weak Q3 performance; revenue falls 11% YoY Stock Market LIVE Updates: 2 PM market update - Sensex, Nifty continue to trade lower amid volatility Stock Market LIVE Updates: Indoco Remedies drops 4% on weak Q3 performance, revenue falls 11% YoY Stock Market LIVE Updates: Kalyan Jewellers slips 7%, hits 6-mth low; tanks 38% in 13 days; here's why Stock Market LIVE Updates: Indian refiners seek crude after US sanctions disrupt Russia oil supply Stock Market LIVE Updates: Apollo Hospitals rises 3%; Kotak upgrades to 'Buy' from 'Add', raises TP Stock Market LIVE Updates: DEE Development surges 7% after increasing capacity of Gujarat facility Stock Market LIVE Updates: Venus Remedies share price surges 12% on renewal of EU GMP certification Stock Market LIVE Updates: 1 PM market update - Sensex, Nifty trade lower amid volatility Stock Market LIVE Updates: Tanla Platforms share price gains 8% ahead of Q3FY25 results annoucement Stock Market LIVE Updates: This Mukul Agrawal portfolio stock surges 23% in 3 days; hits new high Stock Market LIVE Updates: How to trade in Paytm, Zomato post Q3 results? Charts hint at diverse trend Stock Market LIVE Updates: Paytm falls 7% on profit booking post Q3 results; up 161% in past 6 months Stock Market LIVE Updates: Analysts rule out pre-budget market rally; Trump, Q3FY25 earnings in focus Stock Market LIVE Updates: 12 PM market update - Sensex, Nifty in the green amid volatile trade Stock Market LIVE Updates: Oberoi Realty drops 8% despite posting strong Q3 show; here's why Stock Market LIVE Updates: HAL drags over 3% on reports GE seeking higher prices for tech transfer Stock Market LIVE Updates: MCX share price slips 8% despite posting strong Q3 show; revenue up 57% Stock Market LIVE Updates: 10 AM market update - Sensex, Nifty trade lower Stock Market LIVE Updates: Newgen Software slips 10% post Q3 results; stock down 22% in 4 days Stock Market LIVE Updates: Sunteck Realty jumps 11% after stellar Q3 results; profit soars 537% Stock Market LIVE Updates: Zomato tanks 12% in 2 days post Q3; analysts cut earnings, target estimates Stock Market LIVE Updates: 10 AM market update - Sensex, Nifty decline Stock Market LIVE Updates: AGI Greenpac jumps nearly 10% as Q3 net profit climbs 34.9% YoY to Rs 90.5 crore Stock Market LIVE Updates: Mobile, EMS growth fuels Dixon Technologies stellar Q3; analysts up targets Stock Market LIVE Updates: Here's a look at Nifty gainers and loser Stock Market LIVE Updates: Here's a look at Sensex gainers and loser Stock Market LIVE Updates: A glance at broader market after market opens Stock Market LIVE Updates: Sensex up over 60 pts, above 73,100 after market opens Stock Market LIVE Updates: Nifty rises over 65 pts, above 23,400 after market opens Stock Market LIVE Updates: Technical view Stock Market LIVE Updates: Market expert view Stock Market LIVE Updates: A glance at broader market during pre open Stock Market LIVE Updates: Nifty up over 90 pts, above 23,400 in pre open Stock Market LIVE Updates: Sensex up over 450 pts, above 77,500 in pre open Stock Market LIVE Updates: Analysts estimate weak profit growth for HDFC Bank; NIM, NPA eyed Stock Market LIVE Updates: HUL Q3 preview: Analysts see muted quarter; PAT may rise 2% YoY, revenue 1% Stock Market LIVE Updates: Sectoral funds dominate 2024 investments: Does chasing hotshot MFs work? Stock Market LIVE Updates: RBI may turn to longer buy-sell swaps amid rising $ short positions Stock Market LIVE Updates: Increase in room rates, higher occupancy to drive gains for Indian Hotels Stock Market LIVE Updates: Gold climbs Rs 10, silver down Rs 100; yellow metal trading at Rs 81,240 Stock Market LIVE Updates: Dr Reddy's Labs Q3 Preview: Revlimid to dent US sales, profits may rise 12% Stock Market LIVE Updates: US Presidential inauguration is a historical positive catalyst for equities Stock Market LIVE Updates: Zomato, Dixon Tech, MCX, Oberoi Realty, IDBI Bank Stock Market LIVE Updates: Chandan Taparia of MOFSL recommends buying these stocks on January 21 Stock Market LIVE Updates: Trump; Zomato, Dixon, ICICI Pru Q3; Stallion India allotment to be in focus today Stock Market LIVE Updates: GIFT Nifty futures hint flat start for Sensex, Nifty Stock Market LIVE Updates: Asian markets Mixed Stock Market LIVE Updates: US index futures gain Stock Market LIVE Updates: Good morning readers! Track the latest live market updates here Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 21 2025 | 7:42 AMIST RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8%",
    "url": "https://www.business-standard.com/markets/news/stock-market-today-live-updates-sensex-today-nifty-jan-21-nse-bse-equity-zomato-dixon-tech-q3-result-125012100124_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxOSzl1YWVjNFZ4cnhjS21jSm5MUXYzNzl4NWVpUnNRWTEtRXRzVmsxbGZnbGZrSFZneUhlY1Y0OXRaaWs1aGVIVUVBbmFyTjVDdUpibEJLQkIzSEYzelY0bUhBM0hSV1phVlNIVXFIZzRxSnA5eXY4bXlPNzhPUUp2VkExU1NkdG5xRUFiSmJBdUIzYmkxdmFXdGp5Uk9GRXRwN0poSU0xR2w5OXUzX0ZBUy1LajRlR3pRUWxzODNBVHZvVDVycmx1dDMybWwtZkRMLWZhVkVfNHlQTTU1NnFkeE9td0ZmemZIZVlKOTZBc0lIb3BnREtUR29SRdIBgAJBVV95cUxNX2JMV1hiTTJpb3RjTm04cXRPR3kzZ1FNSnNuSmpmNkQwUmZaTnU5VjlLSG1wMGNPSnliNGhTOU1tV21nNE00RWhXa1JXQ1pBc2hiVFhIbEI2cnRTUHZyMklUSEpFZ0gwOHhad0VibzRiZjNDd2lGX1M4b3FZYTlYX2ZIeEszbEhISFRFRWNRQ3VRVVlfWVJlaFRubkE1LVVGeGp2cXdNenVqM3pGdEpMZzAza3U0X0lBT1hQYXFPVkJJbVo4WVptODlFT1dkRDJjcGN4cTdieDRjTWVxQk9ncFNyRkF0Wk9yb3pSUGR4VFZhYkxSZ1VvTzVIeHpNUXJv?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6020,
    "word_count": 1008,
    "gnews_title": "Stock Market Crash Highlights: Sensex sinks 1,235pts, Nifty ends at 23,024; broader indices bleed 2% - Business Standard",
    "published_date": "21/01/2025",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  }
]