[
  {
    "title": "Stock market today: Sensex and Nifty tanks, rupee hits all-time low",
    "body": "Stock market today: The stock market crashed upon open on Monday, January 13, dragged down by real estate, financial services, and consumer durables stocks. At 9:20 am IST, the benchmark BSE Sensex tumbled by 677.22 points or 0.88%, reaching 76,701.69. The broader NSE Nifty was down by 212.90 points or 0.91%, reaching 23,218.60. Also Read:TCS to hire 40,000 freshers from campuses this year with AI skills expected at all levels, CHRO says: Report This also comes with the rupee hitting an all-time low of 86.3537 per dollar, as per Bloomberg data. This is because the US dollar is currently rallying because of positive jobs data. Among the 30 Sensex stocks, Zomato Ltd fell the most by 2.86%, trading at₹236.05. This was followed by Mahindra & Mahindra Ltd, which fell 2.13%, trading at₹3,026.05, and Power Grid Corporation of India Ltd, which fell 2.07%, trading at₹293.60. Only 2 Sensex stocks were in the green. These included IndusInd Bank Ltd which rose by 2.05%, trading at₹956.80 and Axis Bank Ltd which was up by 0.44%, trading at₹1,045.40. Also Read:Big Four firms urge employees to limit work travel, use public transport: Report Among the Nifty sectoral indices, Nifty Realty fell the most by 2.06%, reaching 943.50, followed by Nifty Midsmall Financial Services which fell 1.84%, reaching 14,730.20, and Nifty Consumer Durables which fell 1.61% reaching 39,930.70. All the sectoral indices were in the red. Even IT, which was the only index in the green during the previous week's close, fell by 0.44%, reaching 44,413.20. Also Read:Foxconn stops sending Chinese workers to India iPhone factories: Report The stock market closed in the red after the trading session for the previous week ended on Friday, January 10, 2025. The Sensex closed 241.30 points or 0.31% lower at 77,378.91, while the Nifty closed 95 points or 0.4% lower at 23,431.50. All the Nifty sectoral indices were in the red except for IT, which was significantly up by 3.44%, reaching 44,609.50. All the stocks within the index closed in the green. This was also reflected in the Sensex, with IT stocks rising the most. Tata Consultancy Services Ltd (TCS) was up the most by 5.67%, reaching 4,265.55. This was followed by Tech Mahindra Ltd which was up 3.78%, reaching₹1,705.35, HCL Technologies Ltd which was up 3.13%, reaching₹1,995.60, and Infosys Ltd which was up 2.55%, reaching₹1,966.70. Only 9 out of the 30 Sensex stocks closed in the green. IndusInd Bank Ltd fell the most by 4.41%, closing at₹937.60. This was followed by NTPC Ltd, which fell 3.78%, reaching₹308.20, and UltraTech Cement Ltd, which fell 3.57%, reaching₹10,866.20. Among the Nifty sectoral indices, Nifty Media fell the most by 3.59%, reaching 1,743.65. this was followed by Nifty Midsmall Healthcare which fell 3.14%, reaching 42,746.55, and Nifty Realty which fell 2.77% reaching 963.30.",
    "url": "https://www.hindustantimes.com/business/stock-market-crash-sensex-tanks-nearly-700-points-on-open-nifty-down-over-200-101736737599073.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQTHdZVzVIZURoLVg4Y0JJLU93ek80R0xCMEhUNXNGbUR4QzZzS3czbUQ0R1RtQlBQMS1JQXlvS1FETWtGZlgtcnFjTERyRHRDY3p1OGQ2cHBFdnUxRnliY0xGc25TX0RKcUtyQzJXcGUtSUhoS1FUZHRfRGducXdvY1ROcEhRRENURHVPcVBLZ0wxdktzZUdjOUJEOGUtSHlkQnpJMnh5UEFaM0R1VHdZUThGcW8tM2tFMXpKcHFhbU53NlJUejh5T0d6cVpBandiUFdURdIB2gFBVV95cUxQdklRbHRGcDNvMXJfU0FwUmowZGVkRDRTcE9LMlpQNjlqWW5PWEw5aTJ4RjFpV0ZwMGxrbmFqMzlOM1Q0ZlVtanNwWXZfVnJVd016RnhYUWJVNVBUTDNfNHBNLUlrWVRScEF4LXlQMkhWT1FEeHJtR2RXbUVwdnJ0X1h1VDlpT2ppdkR6WS01b2xsSVhYN3oyOC1VVjBqRFd0Mm52N2N6N1JmVm1xOXAtODRYVy0tLXpvWmhmbjJ2dFRjcDFLa09fSEUwWFNNczRnTk54aExRQ1B1dw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2849,
    "word_count": 461,
    "gnews_title": "Stock market today: Sensex and Nifty tanks, rupee hits all-time low | Business News - Hindustan Times",
    "published_date": "13/01/2025",
    "publisher": "Hindustan Times",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex, Nifty continue winning streak: 3 reasons why stock market gained today",
    "body": "The stock markets have shown signs of recovery after falling almost 12% from it's September high as it continued its winning streak, extending gains for the third starlight session on Thursday. Sensex gained over 400 points in early trade while Nifty was up nearly 150 points. The S&P BSE Sensex was up 308.61 points to 77,032.69, while the NSE Nifty50 added 105.75 points to 23,318.95 as of 10:25 AM. Rise in the stock marketcould be attributed to several factors, of which the positive US inflation data was the biggest trigger for Sensex and Nifty. US stocks rose on Wednesday night after new numbers showed US core inflation grew less than what experts had thought it would. This good news spread to Asian stock markets on Thursday, pushing them higher too. The US dollar and interest rates on US government bonds have come down a bit in the last few days. Some market watchers think the recent rise in stocks tied to Donald Trump might have reached its peak. Adding to the positive market sentiment in markets, Israel and Hamas agreed to stop fighting in Gaza, which helped calm worries about the conflict. This made investors feel better about putting money into stocks. Many think this could slow down the recent trend of foreign investors taking their money out of markets. Closer to home, investors were waiting eagerly for three big Indian companies - Reliance Industries, Infosys, and Axis Bank - to share their latest earnings reports later in the day. Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services said that macro indicators from the US suggest that as the swearing-in of Mr Trump nears, the Trump trade has peaked. \"The decline in US bond yields and the dollar index are indications of this. This downshift in the dollar index and bond yields has been assisted by the lower-than-expected CPI inflation in the US, again igniting hopes of more rate cuts by the Fed this year. Hope of an end to the conflict in Gaza is another major relief. This global backdrop is positive for the market,\" he added.He also said that a relief rally in India is certainly on the cards, but the sustainability of the rally will depend on the Indian macros, particularly the revival of GDP and earnings growth. \"Budget expectations can aid a rally in the market but it will soon give way to the trends in GDP and earnings growth. Investors should focus on largecaps which have been more stable than the mid and small caps. Broadly speaking, segments with growth visibility like Pharma and health care, IT and discretionary consumption will remain resilient,\" said Vijayakumar. Theshare price of HDFC Life Insurance Company surgedalmost 11% on January 16 after the insurer announced its October-December quarter results, which was much better than what Dalal Street had expected. HDFC Life shares were up 10.28% to Rs 655.35 at around 10:17 am. Earlier, the stock had reached a days high of Rs 657.80. The company posted a 14% rise in net profit in Q3 FY25 at Rs 415 crore, higher than Rs 365 crore in the same period last year, driving positive investor sentiment.",
    "url": "https://www.indiatoday.in/business/story/sensex-nifty-continue-winning-streak-3-reasons-why-stock-market-gained-today-us-inflation-gaza-ceasefire-2665519-2025-01-16",
    "original_url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPTm05OWpiZE84ak9CekRhaEhpYXFUVmZGWGlTQVdONFFmcFNqdDVrNFNyVEFpWWtITnFYa01zaTRGRl9uTVFsZzVVUTJLb1JPd3d3MmRTX0t5NFktNG1XSE5seUhyUE5uQ29yd3g0cnZKNUJOR21reWx3d0NtRHVSX0N4eHJxMF9hY0pINkk0R09NemRfb1ZOekdZaXRUMjM2RXo1VWdiQllmQ1pHX0lZQTlhUFdiM21OZUNVU2c0c3drY2s0Z0ZvcVpvcVhFM1ZSalM5NGJJTU5lcFAtcEwzVFRzQmRMMEtTbjFjZzJrZHZRbUVVZkNF0gH8AUFVX3lxTE55anVzT3hSZS1VWXhyajljS0xyd3dKWmthNkc1eEdXT1hFVXZOMHZjb1VmZUtCQWotX1E2ckJ1QklsdE9sY2FyX2FDci14MFhibEFJck9rQV9ScldVQ1dHNDNxU0YxczN4S1ROSkdYajR5UFBLb0hlS1YybGJRbG9tZFpnTzdoLVhpdDNIWTVHQ2VVdlpyM1pibzVyaXRwaGlXRXBXeUtrNFZBc3hLZkNJN3JVREpsYmJ0Z1RPcHJhb2t4YTFBaUw4MG9Qd0NVWFpYbEJUdXdHSWNZUnBrN3laTkN4QXdoZHNOd0syZmZTYXI2dHQ3QjNlVE05MA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3086,
    "word_count": 527,
    "gnews_title": "Sensex, Nifty continue winning streak: 3 reasons why stock market gained today - India Today",
    "published_date": "16/01/2025",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Highlights: Nifty finds next hurdle at 200-DSMA. How to trade on Friday",
    "body": "On the daily chart, the Nifty formed a red candle but respected the demand zone of 23,460–23,500, settling near the 200-day Simple Moving Average (250-DSMA) support. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-9-january-2025/liveblog/117068778.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNX21iWFkwX0lpM0M3dTFnQWV0cTh4c1VZcXNxci1zTUw0WmJKNkNrUnRlYkV1SFg1R1o4ZDN2dU9nNEJpdjBmRzdPTlhtZ01STGYteHZUUnZ2dnNZMW5Idm0zdnE4eWRHamJ1ZGpNZ1lrNTZaSkJ3THNfenBSLV9IMndVWkstUnBlTnlTOExHN0FOcm5wSHZhNTl4eHdvUnNGV2ZWdGE3bDlnbGVEVndITktKN3VmMXphNml3SDZEbGFfWmJ2aFlxNXMxaWdyN19RZlJUb3JB0gHbAUFVX3lxTE5nLWR5RU5UTU5sTW5JcVI1Ty1ILVh0T0lwYVdpT3VwTFlYWGY3WEowbDFiTjc4M1ZwLUlOZVN2VFhMa2YzQTd1SzVfMjhLeDRZRFc5MFllUDRmYzR3NTFEbzZzYXJxT2d0RkM2UXpPN2NJOHp4R0Ntc1cyWFFWNDJzZWdvVFkya2ZpdFFCSDBaM0tlUDREeVBiRjZMX0dkMVYwbzBYU1BjbDFmWWdrWTZLejVHbkVvcERSOTVKN1lGZEtEN0doZk5qdzZTNlFCYzJ4VjFFSGU5NDJBaw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 479,
    "word_count": 78,
    "gnews_title": "Stock Market Highlights: Nifty finds next hurdle at 200-DSMA. How to trade on Friday - The Economic Times",
    "published_date": "09/01/2025",
    "publisher": "The Economic Times",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Crash Highlights: Sensex tumbles 1,031pts, Nifty at 23,086; NSE Mid, SmallCap fall 4%",
    "body": "Stock Market Highlights LIVE Updates: Decisive fall below 23,000 may trigger deeper correction Stock Market Highlights LIVE Updates: Domestic sell-off led by global cues Stock Market Highlights LIVE Updates: Adani Ent, Trent, BPCL on NSE Stock Market Highlights LIVE Updates: Nifty Realty, Metal, Consumer Durables bleed Stock Market Highlights LIVE Updates: SmallCap, MidCap indices bleed heavy Stock Market Highlights LIVE Updates: Heatmap check Stock Market Highlights LIVE Updates: Nifty50 down 335 points, dips below 23,100 Stock Market LIVE Updates: Sensex drops 1,048 points Stock Market LIVE Updates: Nifty Realty records sharpest intraday fall in 7 months; tanks 6% today Stock Market LIVE Updates: 3 PM market update - Sensex, Nifty trade with deep cuts Stock Market LIVE Updates: Groww in talks to launch IPO, looks to raise $700 mn for $7-8 bn valuation Stock Market LIVE Updates: India Inc's leverage to improve in FY26-27 despite high capex: Fitch Stock Market LIVE Updates: Nifty Realty records sharpest intraday fall in 7 months; tanks 6% today Stock Market LIVE Updates: Equinox India shares dip 4% despite posting good Q3 nos; revenue up 176% Stock Market LIVE Updates: MRF, L&T Finance, IOC, SAIL among 50 stocks from BSE500 to hit 52-week lows Stock Market LIVE Updates: Monday mayhem: When will stock markets recover? Check outlook, strategy Stock Market LIVE Updates: BSE, Asia's oldest stock bourse, seeks ways to dent rival NSE's dominance Stock Market LIVE Updates: 2 PM market update - Sensex, Nifty extend intraday decline Stock Market LIVE Updates: Here's why Waaree Energies share was buzzing in trade on Jan 13; details Stock Market LIVE Updates: MTNL shares dip 3% as company struggles to fund escrow account Stock Market LIVE Updates: Interarch Building Products shares rise 4% after order win worth Rs 221 cr Stock Market LIVE Updates: NCL Industries shares decline 4% after posting Q3 biz update; here's why Stock Market LIVE Updates: Wockhardt gains 4% as drug shows 97% efficacy for drug-resistant bacteria Stock Market LIVE Updates: Nifty SmallCap index can break 22-month up trend; MidCap index may tank 12% Stock Market LIVE Updates: 1 AM market update - Sensex, Nifty trade lower Stock Market LIVE Updates: Afcom Holdings shares hit 5% upper circuit on long-term pact with Etihad Stock Market LIVE Updates: SunTeck Realty slips 4% after posting Q3 biz update; key details here Stock Market LIVE Updates: Goldman Sachs initiates coverage with 'Neutral' on BSE; share price up 2% Stock Market LIVE Updates: Adani Wilmar stks fall below OFS floor price; at lowest level since Feb'22 Stock Market LIVE Updates: Just Dial shares slip 9% after posting Q3 results; check details here Stock Market LIVE Updates: 12 AM market update - Sensex, Nifty trade lower Stock Market LIVE Updates: Sensex dips 840pts intraday, 25 out of 30 trade in red; realty, metals drag Stock Market LIVE Updates: Kumbh Mela 2025: Time for stock market cleansing? Here's what history shows Stock Market LIVE Updates: Laxmi Dental IPO opens today: GMP zooms 38%; Should you subscribe? Stock Market LIVE Updates: Ceat, MRF, BPCL: Oil-linked stocks slip as crude oil rises above $81/bbl Stock Market LIVE Updates: PCBL tanks 11%, hits 5-month low on disappointing December quarter results Stock Market LIVE Updates: 11 AM market update - Sensex, Nifty pare some losses; still in red Stock Market LIVE Updates: Biocon shares gain 4% after USFDA gives VAI tag to its Malaysia unit Stock Market LIVE Updates: DMart bleeds 6% as brokerages cut target after Q3 result misses estimates Stock Market LIVE Updates: Standard Glass Lining Tech shares make decent debut, list at 26% premium Stock Market LIVE Updates: Bumper listing! Indobell Insulation shares list at 90% premium on BSE SME Stock Market LIVE Updates: 10 AM market update - Sensex, Nifty trade lower Stock Market LIVE Updates: Macquarie likes pvt banks over PSBs as FY26 may be the 'year of stability' Stock Market LIVE Updates: Biocon up 4.5% as USFDA classifies Co's Malaysia site as Voluntary Action Indicated Stock Market LIVE Updates: Avenue Supermarts drops 5.7% after 5% YoY rise in Q3 cons net profit at Rs 723 cr Stock Market LIVE Updates: Technical view Stock Market LIVE Updates: Market expert view Stock Market LIVE Updates: Sensex may test 76,300 this week; Nifty can fall another 8% from here on Stock Market LIVE Updates: A glance at broader market Stock Market LIVE Updates: Here's a look at Nifty gainers and losers Stock Market LIVE Updates: Here's a look at Sensex gainers and loser during open Stock Market LIVE Updates: Nifty down over 200 pts, below 23,200 Stock Market LIVE Updates: Sensex down over 700 pts, below 76,650 Stock Market LIVE Updates: Broader markets trade lower in pre open Stock Market LIVE Updates: Nifty50 down over 200 pts below 23,250 in pre open Stock Market LIVE Updates: Sensex was down over 200 pts below 77,150 during pre open Stock Market LIVE: 'Push above 23,540 signals strength, while slippage towards 23,000 could let bulls regroup' Stock Market LIVE Updates: 'FIIs will continue to sell, offering opportunities for long-term investors' Stock Market LIVE Updates: Paytm, Angel One, Kalyan Jewellers among 6 stocks with huge short build-up Stock Market LIVE Updates: FPIs withdraw Rs 22,194 cr in Jan amid weak earnings outlook, rising dollar Stock Market LIVE Updates: Under Noronha's leadership, DMart's market capitalisation soared 500% Stock Market LIVE Updates: Street signs: Laxmi Dental GMP at 37%, market mood rides the seesaw Stock Market LIVE Updates: Inflation data, Q3 earnings, FII trading to drive mkts this week: Analysts Stock Market LIVE Updates: Under Noronha's leadership, DMart's market capitalisation soared 500% Stock Market LIVE Updates: Adani surpasses Mukesh Ambani's RIL group firms in 2024 M&A deals Stock Market LIVE Updates: FY26 profit growth hinges on revenue trajectory: UTI AMC CIO Subramaniam Stock Market LIVE Updates: Steady heartbeat of growth in diagnostics stock keeps sector pulsing Stock Market LIVE Updates: Consumer inflation likely eased to 5.3% in Dec on modest food prices: Poll Stock Market LIVE Updates: Tax shift throws a wrench in the gears of buyback offers in 2024 Stock Market LIVE Updates: FoFs get their groove back: Tax tune-up resets growth tempo, shows data Stock Market LIVE Updates: CP, CD rates harden amid tight liquidity conditions in the market Stock Market LIVE Updates: HCLTech Q3 Preview: Revenue may jump up to Rs 30,200 cr; PAT to rise 5-10% Stock Market LIVE Updates: Ahead of Feb policy, RBI guv Malhotra to meet bank chiefs on Thursday Stock Market LIVE Updates: US sanctions on Russian oil supply chain pose challenge for Indian refiners Stock Market LIVE Updates: Trump 2.0 era: Govt asks industries to identify import prospects from US Stock Market LIVE Updates: Tech M, Uno Minda: Rajesh Bhosale of Angel One picks 2 stocks to buy today Stock Market LIVE Updates: How to trade Bank Nifty, Nifty50 today? Check strategy, levels to watch out Stock Market LIVE Updates: Markets Today: GIFT Nifty; Dec Inflation; HCLTech Q3; Standard Glass IPO Stock Market LIVE Updates: US markets decline on Friday Stock Market LIVE Updates: Asia markets mostly lower Stock Market LIVE Updates: Good morning readers! Track the latest live market updates here Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 13 2025 | 7:45 AMIST RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8%",
    "url": "https://www.business-standard.com/markets/news/stock-market-today-live-updates-sensex-today-nifty-jan-13-nse-bse-standard-glass-ipo-gmp-hcltech-q3-125011300061_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxNaExOVXVDcDVUWjhMYUtkZXEweEV0bHFhWGtGVjc5SDNDcFRGM3VyNGxlVERMLXFlU2VNd1dGZ2hhUXpqX1FqV3V2UWNJdDVzOHV3MHllNDFwU0Jiam5ndk04MW1aVi1sZXJtdmxKaWppLXpzcnVKaEtqZncxOVRnaEZhazl3U1dwM0k2LXdTYXZSVkRYV1BpeVdCUkpBQzR5VEExeFBZcGcwYnhLN0xZc2N3SW1vX2V4QkVMT0VoVUJfaEFCaF9wRmtPNzR0SW5kTEszSTMwOEVoVTB2dmJlaF94Q2hob0tmazdsVXlLbVY4LVN2Mnl0VGdn0gH_AUFVX3lxTFBlWDlEMndWZlcwQ19TUWxkTkV5YTMtYnVrRngyd18xeHRlWTZkdmpWN0dWNW85UkJGSktqbGpXdlZqaGV5ZTJQWDFnaFo1cEdtSHJTTFhlVl9IRGJRdmNRR3VnRUEzQi14U0JGbmpHcHB0ckU5ei1FckZ0VGIwejF5bFk4ZDlTQVJ3dDhoeFItXzZjWWpYT2l2clk3Y1h4eHlTclBVYkUxZDVadDZxcTZ5bVhTMHo2ajFJMl9XTTB6eHhDOEE5TEtwYXhvSVFzd0lqNU1pVGdXUlFCVjNZLXJRS1k0aXdmMEtIcy03eVhCajgwb1R5RC1ObVlBMHpvMA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7828,
    "word_count": 1280,
    "gnews_title": "Stock Market Crash Highlights: Sensex tumbles 1,031pts, Nifty at 23,086; NSE Mid, SmallCap fall 4% - Business Standard",
    "published_date": "13/01/2025",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex falls over 600 points: Why is stock market down today? 3 key reasons",
    "body": "Benchmark stock market indices tanked in early trade on Monday extending their downward momentum and continued to be under pressure, led by a decline in auto, banking and metal sector stocks. The S&P BSE Sensex was down by 657.97 points to 76,720.94, while the NSE Nifty50 fell 199.60 points to 23,231.90 as of 9:20 AM. Sensex and Nifty closed lower on Friday for the third straight session, extending their losses, and the same trend continued in today's trading session, marking the fourth consecutive session of falls. Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services said that market will continue to be under pressure from the many strong headwinds. Rupee hits a record low -TheIndian rupee crashed 23 paise to a historic low of 86.27against the US dollar in early trade. This drop came after stronger-than-expected US jobs data dampened hopes for significant interest rate cuts by the Federal Reserve in 2025. The rupee opened at 86.2050 against Friday’s close of 85.9650. A weak rupee increases import costs, particularly for crude oil, and adds to inflationary pressures in the economy. US jobs data and rate concerns -The US added 2.56 lakh jobs in December, far exceeding expectations of 1.65 lakh. This pushed the US unemployment rate down to 4.1%. While this highlights a strong US economy, it has led to reduced expectations of rate cuts by the Federal Reserve. Dr V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, said, “The robust US jobs data means the Fed is unlikely to cut rates significantly this year. This good economic news for the US is turning out to be bad news for global markets, including India, which were hoping for rate cuts to boost liquidity.” Rising crude oil prices -Brent crude prices rose to $81 per barrel, creating concerns for India, a major importer of crude oil. Higher crude prices increase input costs for businesses and could lead to higher inflation, adding to the challenges for the Indian economy. IndusInd Bank emerged as the top gainer on Nifty50 in early trade, rising by 3.09%, while Shriram Finance moved up by 0.27%. Oil and Natural Gas Corporation (ONGC) gained 0.25%, followed by Britannia Industries with a 0.12% increase, and Axis Bank which edged up by 0.10%. On the losing side, Bharat Petroleum Corporation Limited (BPCL) led the declines with a drop of 2.38%, while Apollo Hospitals Enterprise fell 1.93%. SBI Life Insurance Company declined by 1.90%, followed by Mahindra & Mahindra which slipped 1.77%. Wipro rounded out the major losers with a decline of 1.61%. Analysts suggest that while the near-term outlook remains challenging, there could be opportunities for long-term investors. Anand James, Chief Market Strategist at Geojit Financial Services, said, “The market is approaching critical levels, with Nifty near its recent low of 23,263. A break below this level could see the index falling to 23,000 or even 22,260. However, any recovery above 23,540 could signal strength and give bulls a chance to regroup.” Dr Vijayakumar added that the strength of the US economy could support IT stocks, which have been relatively resilient. He also said that healthcare and pharma sectors may remain stable due to steady demand.",
    "url": "https://www.indiatoday.in/business/story/stock-market-down-today-why-reason-sensex-falls-600-points-nifty-below-23500-2663829-2025-01-13",
    "original_url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxQdk80TnB3NGotN2YzMi1IVzhoTkpLcTZSQTVJZWdGUU9vM0lZM1JFU2lPbHpMY0JhSTlLV2dLaC1VdzFsZ0dOOWkzMFp1YXR4dUg2Q1RIbmhEMzJ4VzZhOU4xT3JkWUhZOXBiQ2pLa3h0a3Vrd3VpNTlyLXBNZ2VuX0VyQWtoSXUzR0dyVmw5SFRYMHNhY2hiRjNQYjd3X0lvSnZab1JvSHcxZzRRRERUVEdrWEc3TUlzVFkxanV4SjFGay15a1Q0N05PZWRpSGI5dGfSAdcBQVVfeXFMTmxfZ0szcnFieFlUZmxuOTBIb1BsX0JPSGRxY3QtbW9ET3l3OUxCOHZ2dDBBLWtXLWs3RDg3cjFHbGVYV0x6V213TUxyT1NlSnYxMW5MNS1Eb085akZaWHk5Mzl6QTk4bHkxTXkzbFQ2TVpQYmFLelhjbS14U0xiRVZEaFV4VDktQzN5MFJ6eEpLQ2xEYl9Ra3hTdEJ2T2g1UU53UjdseHdFeUlybS1hUjliN09tRjJiRjlCYVo2aTVhbGF4U1NBOWlvREFabHA2Z2xjOUZ3NWM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3244,
    "word_count": 529,
    "gnews_title": "Sensex falls over 600 points: Why is stock market down today? 3 key reasons - India Today",
    "published_date": "13/01/2025",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Stock Market Highlights: Sensex snaps 4-day losing streak, ends 170pts up; Adani Group shares shine",
    "body": "Stock Market Highlights LIVE Updates: The downtrend is still intact for Nifty50 Stock Market Highlights LIVE Updates: CPI inflation provided respite to the broader indices Stock Market Highlights LIVE Updates: Broader indices outperform Stock Market Highlights LIVE Updates: Nifty PSU Bank, Metal, Auto lead among sectors Stock Market Highlights LIVE Updates: Adani Ent, Hindalco, Adani Ports rise on NSE Stock Market Highlights LIVE Updates: Heatmap check Stock Market Highlights LIVE Updates: Nifty closes above 23,150 Stock Market Highlights LIVE Updates: Sensex ends 169 points higher Stock Market LIVE Updates: KPI Green slips 28% in 8 days after stock turns ex-bonus; hits 11-month low Stock Market LIVE Updates: 3 PM market update - Sensex, Nifty hold higher levels Stock Market LIVE Updates: Lotus Chocolate hits 5% lower circuit after releasing Q3FY25 results Stock Market LIVE Updates: Urja Global shares hit 5% upper circuit after posting Q3FY25 results Stock Market LIVE Updates: Last day! Sat Kartar Shopping IPO ends today: 63x subscription, GMP up 37% Stock Market LIVE Updates: Goldiam International stock hits new high; zooms 32% thus far in January Stock Market LIVE Updates: Awfis Space Solutions launches first centre in Lucknow Stock Market LIVE Updates: Piramal Enterprises jumps 7%; here's what is boosting rally in stock Stock Market LIVE Updates: Mahanagar Gas share pops 6% as Morgan Stanley initiates with 'Overweight' Stock Market LIVE Updates: 2 PM market update - Sensex, Nifty trade in green; off day's highs Stock Market LIVE Updates: WPI inflation rises from 1.89% to 2.37% in Dec; food prices see decline Stock Market LIVE Updates: Redemptions from equity funds increase by 40% to Rs 4,645 billion in 2024 Stock Market LIVE Updates: LIC stock hits 52-week low; down 34% from August high Stock Market LIVE Updates: Barflex Polyfilms IPO Day 3; Subscription surpasses 6x, GMP at 17% Stock Market LIVE Updates: Jindal Stainless races 4% as Nuvama upgrades to 'Buy,' raises target price Stock Market LIVE Updates: 1 PM market update - Sensex, Nifty hold higher levels; off day's highs Stock Market LIVE Updates: Tembo Global group co to sign MoU with Maha govt for defence mfg facility in state Stock Market LIVE Updates: Bajel Projects rallies 7% after order win from Adani Energy Solutions Stock Market LIVE Updates: Angel One shares drop 7% in trade; here's how company fared in Q3FY25 Stock Market LIVE Updates: Adani Group shares in focus; Power, Green, Energy Solutions gain up to 12% Stock Market LIVE Updates: Bharat Electronics shares rise 2.5% on additional orders worth Rs 561 crore Stock Market LIVE Updates: 12 PM market update - Sensex, Nifty maintain gains Stock Market LIVE Updates: Delta Corp shares hit 52-week low after subdued Q3 results; revenue dips 7% Stock Market LIVE Updates: United Spirits plummets 5% after Hina Nagarajan set to step down as MD, CEO Stock Market LIVE Updates: Biocon extends rally, up 6% in 2 days on HSBC, Motilal Oswal 'Buy' upgrade Stock Market LIVE Updates: IndusInd Bk up 4% in 2 days as reports indicate higher weight on MSCI index Stock Market LIVE Updates: HCL Tech shares tumble 10%; market valuation erodes by Rs 46,987 cr Stock Market LIVE Updates: 11 AM market update - Sensex, Nifty maintain gains Stock Market LIVE Updates: JSW Energy up 5% on receiving LoI for 3,600 MW KSK Mahanadi thermal plant Stock Market LIVE Updates: Delta Autocorp shares list at 35% premium, hits 5% upper circuit later Stock Market LIVE Updates: Quadrant Future Tek makes steady debut; lists at 29% premium on BSE Stock Market LIVE Updates: Jefferies, CLSA, Morgan Stanley retain 'Hold' on HCLTech despite Q3 miss Stock Market LIVE Updates: 10 AM market update - Sensex, Nifty trade higher Stock Market LIVE Updates: Surendra Goyal of Citi India on valuations in Indian markets on CNBC TV18 Stock Market LIVE Updates: Surendra Goyal of Citi India on valuations in Indian markets on CNBC TV18 Stock Market LIVE Updates: Surendra Goyal of Citi India on valuations in Indian markets on CNBC TV18 Stock Market LIVE Updates: Surendra Goyal of Citi India on valuations in Indian markets on CNBC TV18 Stock Market LIVE Updates: Nifty PSU Bank, Metals lead among sectors Stock Market LIVE Updates: Broader indices advance Stock Market LIVE Updates: HCL Tech top loser on NSE Stock Market LIVE Updates: Heatmap check Stock Market LIVE Updates: Nifty above 23,200 Stock Market LIVE Updates: Sensex surges 300 pts Stock Market LIVE Updates: Nifty above 23,150 level in pre-open Stock Market LIVE Updates: Sensex flat in pre-open Stock Market LIVE Updates: 23,000 region has prompted the bulls to regroup Stock Market LIVE Updates: Buy beaten down quality largecaps and wait patiently Stock Market LIVE Updates: HCLTech Q3 net profit up 5.5%, lower end of revenue forecast raised Stock Market LIVE Updates: Six EU countries call for lowering of G7 price cap on Russian oil Stock Market LIVE Updates: India Inc's leverage to improve in FY26-27 despite high capex: Fitch Stock Market LIVE Updates: With IPO hopes high, AIFs inclining towards late-stage startups: Report Stock Market LIVE Updates: Govt 10-year bond yield logs biggest single-day rise in over 7 months Stock Market LIVE Updates: Budget key trigger for life insurance companies' stocks in near term Stock Market LIVE Updates: Laxmi Dental IPO receives 5.28 times subscription on first day of bidding Stock Market LIVE Updates: Rupee depreciation may exacerbate market sell-off if downtrend continues Stock Market LIVE Updates: Bet on quality funds amid slowing economic growth, market turbulence Stock Market LIVE Updates: Economy strong but equities face near-term challenges: ICICI Pru MF Stock Market LIVE Updates: Risk-reward balance poor despite the recent correction, says report Stock Market LIVE Updates: India's retail inflation eases to 4-month low of 5.2% in December Stock Market LIVE Updates: India's billionaire promoters' club surpasses 200 members in 2024 Stock Market LIVE Updates: India's $556 bn equity rout worsens amid growth, inflation concerns Stock Market LIVE Updates: Sebi gives nod to JSW Cement's Rs 4,000 cr IPO after 4-month hold-up Stock Market LIVE Updates: Rupee depreciation unlikely to trigger sustained selloff Stocks to Watch, Jan 14: HCL Tech, Angel One, Quadrant Future, BEL Stock Market LIVE Updates: Ravi Nathani recommends sell-on-rise strategy for Nifty IT, Auto indices Stock Market LIVE Updates: WPI, CPI; GIFT Nifty; HCLTech; Quadrant, Capital Infra IPOs Stock Market LIVE Updates: GIFT Nifty suggests positive start for Sensex, Nifty Stock Market LIVE Updates: Asia-Pacific markets mixed Stock Market LIVE Updates: US stocks end mixed Stock Market LIVE Updates: Good morning readers! Track the latest live market updates here Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 14 2025 | 8:18 AMIST Zubeen Garg death case: Festival organiser & manager arrested; what’s going on? RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US",
    "url": "https://www.business-standard.com/markets/news/stock-market-today-live-updates-sensex-today-nifty-jan-14-nse-bse-equity-quadrant-future-ipo-gmp-wpi-125011400087_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxOREZhN0c1SFFKRnVPUTd1S1JhT2wyUDItczN6a2QydmgtZXFKU1c4blZnX3hDSnJOV21GXzBBQV9SU1l1MW5BSjU1azE5djNUeUpEYXBJOUtvM0VrUFVjelZHekpBOC1QODl0N282YTRZMGl5MUlMYWtOTHhLYjlxWm9CWk5kRl9Tb0tLdjJabmhPV0dXNGc4UERpMlc5YzJiMm5ab3RMZ0t2NDVrdWpBRjlMZGo4UVctUTRXY1k1VERfa0ZqUnEyS0o1cjdRSkJuSF9iQVR6VlB5My1uTTkwZ1lGaTZibXhaMUpjSmZEeDlZWDFHVFNDU0JVMNIBgAJBVV95cUxNbGJiRVJnVE9wRTB4V2NrRnB1NHZDOGNkQUh2THRlTlg1c3lhcVFxZVVldnVPN1VQM0cyaGgzZUhsN3p6ZnNTdTVETW1WaEpzZVRTN0YtakQ0TXc1OW96dzN4dkxKMm5yNG1JTDlXSGFmaE5lM3lXZVdETVlLQ2t3cXRNOWJjWFViUGJnYjcxT3p1a2tVYU50VG9zeXlVY0w4cVpMMjhCRWJmNk50VTNNNm1iRkhlTW53OEY1NEMxbHJJdE5yVUc2cktrNS1aR1pBd3Z5S1JTNVQyMWU5ZGxYVk94Wktzdk5rYTltQlhJaFVwcEVfM0pVcWQ5TEZIdFpn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7282,
    "word_count": 1176,
    "gnews_title": "Stock Market Highlights: Sensex snaps 4-day losing streak, ends 170pts up; Adani Group shares shine - Business Standard",
    "published_date": "14/01/2025",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  }
]