[
  {
    "title": "Sensex hits all-time high: Will the dream run continue?",
    "body": "Benchmark index S&P BSE Sensexhit an all-time high during intraday trade on Wednesday, surpassing the previous peak it achieved in 2022. In December 2022, the Sensex achieved its previous all-time high of 63,583.07. The 30-share index rose over 260 points to hit a fresh all-time high of 63,588.31 in early trade but fell shortly after due to selling pressure. The NSE Nifty 50 is also eyeing a fresh record and was roughly 30 points away from achieving the milestone at around 1:40 pm. So, what's driving the bull run on Dalal Street? Both benchmark indices have been gaining over the past few months, driven by a host of macroeconomic factors such as lower inflation and stronger growth projections. Persistent foreign inflows have also been a key factor in boosting the domestic benchmark indices. It may be noted that foreign investors have put in over 73 lakh crore so far this financial year. Compared to this, foreign institutional investors were net sellers in the two previous financial years. V.L.A. Ambala (SEBI Registered Research Analyst), Stock Market Today (SMT), said, \"It is another record day in India's stock market. As we had said yesterday, the price was getting ready for a new all-time high, and today Sensex has made a new all-time high of 63,588.31.\" \"We are still in a bull run and the trend is very steep. Fundamentally strong and financially stable stocks are seeing an increase in their volumes,\" she added. Meanwhile, Gaurav Dua, senior vice president and head of capital market strategy at Sharekhan, told news agency Reuters that the Indian economy is in a multi-year upcycle, which is a major positive. \"While there are pockets of overvaluation, pockets of opportunity also exist in markets,\" said Dua. \"The indexes may be at or near record highs, but the valuations are not, thanks to healthy earnings growth over the past 20 months,\" he added. One of the key reasons behind the bull run can be attributed to a sharp acceleration in India's economic growth in the March quarter, in addition to a sharp drop in inflation. With this, the country remains on track to be the fastest-growing economy in the world. Analysts said that the fundamentals of the domestic stocks remain strong, but it is better to wait and watch as upcoming events could provide cues for the future. \"I must say just wait and watch for some time. Right now, I do not see any reason to sell the price except that we are near to an all-time high, so hold it until there is no signal of profit booking,\" Ambala said. \"To be more specific, 62,000 is a strong support level for this bullish movement and if the price sustains at the current range, we will be proudly witnessing Sensex trade in the 65,000 to 75,000 range in this financial year,\" she added. \"Keep in mind that as an economy, we are attracting global interest, and that is a positive side for us,\" she added. Also Read |Dalal Street eyes key milestone after cautious opening",
    "url": "https://www.indiatoday.in/business/story/stock-market-dalal-street-sensex-all-time-high-economic-factors-foreign-investments-2395847-2023-06-21",
    "original_url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxQeVlKT1JrMDVfYWJsbTkweTJGZDFDZUVjc25uTS1WM3Q3VTYwREdpLWZPMGxkY05vSVhYX2FRNXoxZVIyYjlBWUhqRHZQYnBKZ0tLYzE5MXpzdnlvdXBJMUdoTVRualhDbExmMmp2NHFyTUpiQk15YzR3bXhfekhvMXh0dWtKdGllenFHUWJSdnFtblFPaUkzb0dxbXdDQlppbndTNG5SM2FINWFFcnZubVJ1VGgyZGhSdXE0dkhaSk5jeTM1bDVGSmZTWkxjRU9jRmotdGlwMXRRaWvSAeABQVVfeXFMT2hsT2ExaW5oRlRnVUdyQ1U1MjNINndkVmxreGdpNFQza08yLS1leFpyaURxbEtWVXFCWEQxMFlUd0hmeVNIc2k0NUxMcGpKbEZUV1FIRmRrZFRFSGJWWW9iT1liTlJ4MkFRTnFlWi1kVWxRbkZsa2NhMXRhck4wbzdsbFM3RmJsdjdPOWJmbDFWdDZYU09rdUZTaEdpdEFZWDMzVzR3LXczNTNsZHlMVmRPWF8ybXY0OVZpLUpUd1REN2pVaXRqREloNVNhUG5SYi1QOXBBbWtzVlNsakxxMTA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2940,
    "word_count": 507,
    "gnews_title": "Sensex hits all-time high: Will the dream run continue? - India Today",
    "published_date": "21/06/2023",
    "publisher": "India Today",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex slips 542 pts, Nifty holds 19,350; Vedanta sinks 7%, Adani Ent up 2%",
    "body": "MRF gains 4%, hits new high in weak market on strong Q1 results KSB zooms 19% in a weak market on healthy June quarter performance Ambuja Cements gains 3% on acquisition of Sanghi Industries for Rs 5,000 cr FDC surges 9% as board to consider buyback on August 9 Dixon Tech, Optiemus, HCL Info rally 8-9% on laptops, tablets import curbs CLOSING BELL:: S&P BSE benchmark falls for the third straight day; ends 542 pts lower at 65,241 ALERT:: Adani Enterprises Q1 net jumps 44%; stock up 1.5% Dixon Tech, Optiemus, HCL Info rally 8-9% on laptops, tablets import curbs Varun Beverages rises 3% on strong Q2 results; stock up 26% so far in 2023 ALERT :: Temasek to invest Rs 1,200 crore in Mahindra Electric These bull riders have dipped below 200-SMA as markets tumble IndiGo's troubles may mount in Q2FY24, warn analysts Zydus Lifesciences rallies 3% on USFDA's nod to arthritis drug Mid-, smallcaps rise up to 0.3%, outrun benchmark indices July Services PMI rises most rise since June 2010 on robust global demand Fitch downgrades US' rating: How soon can the markets recover? Titan dips nearly 3% on disappointing Q1 operational performance Gold needs to clear this hurdle for sentiment revival, shows chart New era of Indian equity outperformance is dawning: Morgan Stanley Vedanta slips 9%, nears 52-week low on huge block deals Ambuja Cements gains 1% on acquisition of Sanghi Industries for Rs 5,000 cr Nifty Pharma leaps 1% in weak market; Realty index dips most Broader markets hold relative strength Ultratech, Hindalco lead losses on Nifty Adani Enterprises, Bajaj Auto top Nifty gainers FEW GAINERS: Sun Pharma, NTPC, HDFC Bank defy weakness on Sensex OPENING BELL: Sensex starts 250 pts lower OPENING BELL: Nifty opens near 19,450 CURRENCY ALERT: Rupee opens at 82.72/$ vs last close of 82.58/$ Reliance jumps 16 places, now at number 88 on Fortune Global 500 list ALERT :: Ambuja Cements enters into inter-corporate deposit agreement with Sanghi Industries Surging gold prices take sheen off Indian jewellery maker Titan's profit Q1 Preview: Airtel ARPU may near Rs 200-mark; Voda to see muted subs churn Stocks to Watch on Aug 3: Titan, IndiGo, MMTC, Airtel, Adani Ent, Nykaa Morgan Stanley upgrades India to overweight WATCH VIDEO | How should you trade in a range-bound market? FIIs sell equities worth Rs 1,878 crore on Wednesday, August 2 Nifty Metal to be range-bound; Pharma index bullish with need for caution Gift Nifty signals a quiet start on Thursday Morgan Stanley cuts rating on Chinese shares to equal-weight No respite for bitcoin; trades below $29,300-mark US companies added more jobs in July than expected, up 324,000: ADP Brent Crude trades at $83 per barrel US dollar index steady at 102-levels Hong Kong markets start Thursday's trade on a weak note Japan's Nikkei 225 index falls over 1% in early trade Australia's S&P 200 index slips 0.6% in early deals Sharp selloff seen across US markets overnight Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Aug 03 2023 | 7:21 AMIST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/markets/news/stock-market-live-august-3-nse-bse-sensex-nifty-rupee-global-markets-q1-results-market-news-updates-123080300079_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxPdkJsQzlpeWhvcmtMdjM0b3JMWFF1REVYSWxTMzY2bjQxWVFzdW0yZDZJRzIxNml6bmZMSFRWYmUzUTQ4N2dhSm80RVdzdVN4X3dlV3BHMXZiM1dwQlJKNXNLQUtpNGtwd0VsaVBuNHNSQTlpUGhiX1F0ZDBvUkdqQnlRUjQ4WXRONDdycGkzdW5PaEFxZ1FsbnRBSVFUTDNPWlIwYTl5NzFVTTlEQk5SWmNKUWZObXNERS1yWXgtNExNcHByOUViMHluZWphVFdyTlVKMlZLWlo5OGJoQkxZX2JRcS10R1lqR014aHBkQjRiUEtzWHZKZDNB0gH_AUFVX3lxTE5HRmV3Ml9EUm0xNVRHZEI2TmhDYVUyaVVQS2NHZ3czS2tPM2V1dElwREVzWHozaUNoako1V3BvRDF0MXV0ZlplYkVQRDFuNkFFMzFaMlRnampGNWZNeWZ4bnQxMVpla2F0MDRkc2dOSmI2cmhzVzE4NjUwOUNHV2hnLTl1ckMyR2k4ZmZ0enh6R1doYkFRMUxSQWMzaXZTbC1yemVCdXVKOERpWi1Ua3R5NUZ1eGkyM25US0tZM1dHZ2tBd3B5T21hOFFZMl9VeTZ1S2ZmZWEydlJaV215TzRFR3NOR0txWEVWeFhrLURYQ0VIQXYxcEszWVBlVEU5Zw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3426,
    "word_count": 572,
    "gnews_title": "Sensex slips 542 pts, Nifty holds 19,350; Vedanta sinks 7%, Adani Ent up 2% - Business Standard",
    "published_date": "03/08/2023",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Indian shares extend rally, end at fresh highs on financials boost",
    "body": "People walk past the Bombay Stock Exchange (BSE) building in Mumbai, India, March 9, 2020. REUTERS/Francis Mascarenhas/File Photo Purchase Licensing Rights , opens new tab BENGALURU, July 3 (Reuters) - India's blue chip indexes Nifty 50 and Sensex ended at fresh highs for the third consecutive session on Monday, aided by broad sectoral gains, with financial services in the lead. The Nifty (.NSEI) , opens new tab rose 0.70% to 19,322.55, while the S&P BSE Sensex (.BSESN) , opens new tab gained 0.75% to close above 65,000 for the first time. Both indexes hit fresh record highs earlier in the session. Make sense of global markets with the Trading Day newsletter. Sign up here. Reuters Graphics Financial services stocks (.NIFTYFIN) , opens new tab were among the top gainers on Nifty's sectoral indexes, rising 1%. Index heavyweights HDFC (HDFC.NS) , opens new tab and HDFC Bank (HDBK.NS) , opens new tab gained 1.75% and 1.08%, respectively, after approving July 1 as the effective date of their $40 billion merger. Several brokerages, including Haitong International, Nomura, and Macquarie expected further pick-up in credit growth and improvement in asset quality for financials in the June quarter. Banks (.NSEBANK) , opens new tab hit a record high for the second consecutive session, while public sector banks (.NIFTYPSU) , opens new tab rose 3.61% and were the top sectoral gainers. The rally extended to broader markets as well, with smallcaps (.NIFSMCP100) , opens new tab and midcaps (.NIFMDCP100) , opens new tab settling at an over 1-year high and a new closing high, respectively. Advertisement · Scroll to continue Analysts cited foreign inflows, steady earnings, monsoon revival and positive impact of HDFC merger as major triggers for the recent rise in domestic equities. However, they cautioned investors to remain patient despite the sharp rise in benchmarks, citing lack of valuation comfort. \"Valuation comfort is only in out-of-favour sectors and fresh positions will need to be built in these sectors,\" said Amit Kumar Gupta, founder and chief investment officer at Fintrekk Capital. Advertisement · Scroll to continue Among individual stocks, Reliance Industries (RELI.NS) , opens new tab rose over 2.5% to a six-month high after commencing production from third deepwater field in Krishna-Godavari D6 block, in collaboration with a local unit of British oil company BP (BP.L) , opens new tab . Meanwhile, Mahindra and Mahindra (MAHM.NS) , opens new tab and UltraTech Cement (ULTC.NS) , opens new tab hit record highs, after reporting strong monthly and quarterly sales growth, respectively. Advertisement · Scroll to continue ($1 = 82.0355 Indian rupees) Reporting by Bharath Rajeswaran in Bengaluru; Editing by Nivedita Bhattacharjee and Varun H K Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Read Next 1 hour ago Asian Markets category Sriwijaya Capital raises over $200 million for debut fund, eyes $300 million cap, sources say 2 hours ago Asian Markets category Kumpulan Wang Persaraan targets 30% private market allocation in 5 years 7 mins ago Wealth category Asia draws $100 billion in capital as investors diversify beyond US, Goldman executive says 5 hours ago India category India's September manufacturing growth cools as price rises soar to 12-year high, PMI shows 1 hour ago Business category Oil pauses as markets assess OPEC+ plans, demand concerns 5 hours ago VIEW India central bank keeps repo rate steady as widely expected",
    "url": "https://www.reuters.com/markets/asia/indian-shares-set-open-higher-positive-global-cues-2023-07-03/",
    "original_url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNTjEtWTV4eTZUOXdNcXV1c1MtYmlTZG1CQmtmN0x2N3llaUVkai1tNjY3dkFqYUZ3WkZMNVJhNXFvWU9GZVlMQm80UkZ2WFV6b3dlVHNqRGl2WU9hYkNZRHM4TGFSVDNhdEpudzBEcGpTc0l2YlZsUnd1VXF6bUw4dnZyWWJDSHQwajd0bF9XN3dyRzlCMHJ4UFV6cHJpNlVJ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3559,
    "word_count": 566,
    "gnews_title": "Indian shares extend rally, end at fresh highs on financials boost - Reuters",
    "published_date": "03/07/2023",
    "publisher": "Reuters",
    "topic": "BSE Sensex India stock market"
  },
  {
    "title": "Sensex soars 463pts, ends atop 61K; Nifty tops 18050; mid-, smallcaps shine",
    "body": "Axis Bank slips 2% post Q4 results; what should investors do? Godrej Consumer, Raymond tumbled up to 7% day after reporting Rs 2,825 cr deal PI Industries soars 10% on twin acquisitions in pharma API, CDMO space Wipro gains 3% after it declares Rs 12,000 cr share buyback CLOSING BELL:: S&P BSE Sensex jumps 463 pts, ends higher for 7th straight day Tyre stocks in focus: Ceat, JK Tyre surge up to 11% on healthy margin hopes L&T gains over 2%, hits record high on hopes of strong order inflows Nifty Smallcap index crosses 200-DMA; these 9 stocks may rally up to 40% Axis Bank shares slide 3% post Q4 results; what should investors do? Glenmark Life rallies 10%, hits 52-week high on strong Q4FY23 results Godrej Consumer, Raymond dip up to 6% day after reporting Rs 2,825 cr deal PI Industries surges 10% on twin acquisitions in pharma API, CDMO space Wipro gains 3% on announcing Rs 12,000 crore share buyback via tender route PI Industries surges 9% as arm announces twin acquisitions in API & CDMO space ONGC lead loser on Nifty index Apollo Hospital, UPL additional winners on Nifty HEATMAP: Wipro, Infy lead Sensex gains; Bajaj Finserv drags OPENING BELL: Nifty rises to around 17,950 OPENING BELL: Sensex opens 90 pts higher Hindustan Zinc turns into a net debt firm for first time in 20 years WATCH :: Should investors sell stocks in May and go away? Q4 results: India's IT services biggies fail to meet expectations Mankind Pharma's Rs 4,326-crore IPO garners bids worth Rs 50,000 crore SGX Nifty :: Nifty may top 18,000 in early deals Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Apr 28 2023 | 7:48 AMIST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/markets/news/stock-market-live-sensex-nifty-axis-bank-raymond-tech-mahindra-wipro-sbi-123042800119_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPZ1RjX3NIdVNKZERZSEQ0Uk9VaW9DYXBiaUJHT3hyWXhBeGR4UEhkSEZrX3dEZkFSb2FmT29sX1BCTTVENFJXV3pPa3AzU041YWtPS1BQRi1CTTc4QmthSkNUQjhxT3N6bXc1VHFIOXNiWnlTQ2MwQ1J3WlZYOVl1SWNUejFJZkszeXh6WmtjMy1waUNIREc1X0NqRG54WGZKaHlfTDN5RV9WLW9ETVZZTlpOb0hPMlBBaENweUtPSVVmSEUzTkt1eHNfMmtqQkFHMnI1bWtn0gHbAUFVX3lxTFBYTmhwNjFoVnRpaUtOdUtqZ19MN1pyQklMVXRpYnBIVFBZeUtmOXJaMVJrb1gxQ21Ibm5PMlNMWi0wdkJhMG52elIwR1pTSmJrU1VDS1pCdUFQMEtjVXRYVENhT3JubFRyeHpMalRaSDBNc3V3cFNhWFpWVU5QYWZPb3gyenlIb3p4YlZSS1lKVGp1Nml5UGVlWm5hTDVEVGxyMGFaaFhNYzNEV0ZfUlhha1M0SzQydExkUElQeUlDRk5KS2VOc056UlgyUjE3M0xYSUJvaURzWGNsSQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2035,
    "word_count": 352,
    "gnews_title": "Sensex soars 463pts, ends atop 61K; Nifty tops 18050; mid-, smallcaps shine - Business Standard",
    "published_date": "28/04/2023",
    "publisher": "Business Standard",
    "topic": "BSE Sensex India stock market"
  }
]