[
  {
    "title": "Indian stock markets reverse 2025 losses! Bulls party as foreign investors return to D-Street - but is the rally sustainable?",
    "body": "Smriti Jain is a business and economy journalist with over 15 years of reporting and editing experience. She writes extensively on the Indian economy, infrastructure stock markets, personal finance and Indian Railways. She has also hosted weekly video shows on TOI - TOI Business Bytes and TOI Wallet Talks. A graduate in Economics (H) from Delhi University, she has worked in Economic Times Digital and Financial Express Digital in her previous stints.Read More Chill out this summer: 9 Indian spots that feel like winter Rubina Dilaik inspired top 10 ultra-glam looks 10 most visited countries in the world, and why everyone’s going there 10 easy quinoa breakfasts that can be made in under 20 minutes 10 rare animals that can be spotted in Sundarban National Park Preity Mukhundhan looks stunning in every frame How to spot a liar in seconds: 10 unmissable body language signs Disha Parmar looks like a dream in white 10 simple mistakes that parents commit shatter a child's confidence Sharvari Wagh stuns with her bold take on beauty and style Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/indian-stock-markets-reverse-2025-losses-bulls-party-as-foreign-investors-return-to-d-street-but-is-the-rally-sustainable/articleshow/119429164.cms",
    "original_url": "https://news.google.com/rss/articles/CBMisAJBVV95cUxOM2VScXlvRVA2MlpLTmZZbUNoaWF4MXNmY3p0bVIybkQwbHEwZEdBZU1tbUp2ZjNYenZQcjBEd1g4Q0g1OVJIX3dmTVFZOE5mdHpQRmlnLXV5ZE9jYXlyQ3o0eS1ZRF92ZzM0RXZyUEo2T1VTV3pEdUhSS2lDSnF5UmFnb2M5dFRoZkwzVGpjUWNqRzB5Vy1JREdRR0hCR2wtNGxydU9RNEtzM2gzYng3NW9nLVpsTEQ3NU9sYndPMGdrSjFmVVA5WThveGx0LVc0RUY4c0lxQURsakNzRGpvMFVxYmltSFhvXy05QVQyQVRhamtSVTZvUXUyOTJadDE4c3kzM1FtbS1Jbm5aeDhhTGtMOHRKWGl1VEdEREhfZVROVEhvWWdLQkZPSUkwc2Nt0gG2AkFVX3lxTFBfeDB6TWtoYjgwUmZyNnFBNHcyOEowcDkxSzFDVlpfTjd5VnF6WEZaNkxKdlU5bmxXVHNvUWR1N0VReUpTYjhtd1Z1b2pmMFdnaE1ON25SY2pQX1FjbjVSazRwQTlvVVgtQjRVeVV4VE1feW51WGRRQmFPeTBVVnZzUVo4cFJQNFdjUl9jRjRXS3hZUUZvb1hFLWJwWVJfZmZmZnRmcmJOV3RBN3JxbUdHeUpfNDJtZWtGY2tNdjdBNGtPYUZhWGFvUnFCcWpERkdFRnF6bV9leV9OZG5FRDBSLU9LTXRwaTNTQmxqWldrdVlQdWdqN1JQTHZ6YW92WmlPd0N3dXNkcU9qdW5XVzRrZWVSQ1UxcEtEVlhWT0VKdHdwa3Nlb05xSnFnSW1IajhWV1dfTEE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1389,
    "word_count": 228,
    "gnews_title": "Indian stock markets reverse 2025 losses! Bulls party as foreign investors return to D-Street - but is th - The Times of India",
    "published_date": "24/03/2025",
    "publisher": "The Times of India",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian Stock Market Plummets Amidst Global and Domestic Pressures",
    "body": "The Indian stock market experienced a significant downturn, with the Sensex crashing 2,300 points in five days, down by 1.32%. This decline was influenced by a combination of global and domestic factors, creating selling pressure in the market. The Nifty 50 briefly hovered below the 23,000 level, down by 0.41 % before recovering. Investors have lost nearly ₹ 18 lakh crore in five days, marking a brutal week for them in the market. Aggressive FPI Selling:Foreign Portfolio Investors (FPIs) have been selling Indian stocks since October, leading to significant outflows from the market. This selling is attributed to: Global Trade War Fears:Tensions arising fromUS President Donald Trump'stariff policies have heightened concerns about a global trade war. These issues also acted as a major contribution to the FPi withdrawal from India. Weak Q3 Earnings:The earnings reports for the December quarter (Q3) of India Inc. have not met expectations, raising concerns regarding their growth prospects. This, along with steep valuations, adds to the market jitters. Valuation Concerns:Despite the recent market correction, there are still worries that the Indian stock market is overvalued. As of February 12, 2025, the ratio of India's total market capitalization to its Gross Domestic Product (GDP) stands at 114.46%, indicating a \"modestly overvalued\" status. This assessment is based on the Buffett Indicator, which compares market capitalization to GDP to gauge valuation levels. Disclaimer:This news is solely for educational purposes. The securities/investments quoted here are not recommendatory. To read the RA disclaimer, please clickhere",
    "url": "https://groww.in/blog/indian-stock-market-plummets-amidst-global-and-domestic-pressures",
    "original_url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPZld6YXZDVlF6ZnpReHY0NnY2ampVT3cxSDBxVHZKRkdISVFVaE4tY0dxTHNGd2FWWGdraDNMbG1vZmxvdGdreUJ2ZW1kNWFVR0dRNlMtSDNsVFlDc2dqWmhLN0RldXhrSk85WUVhcTFsM3N0dmNYNEN3VjRlbGJKUHVGMWNqMGNHYm5tY190NVo?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1645,
    "word_count": 245,
    "gnews_title": "Indian Stock Market Faces Major Downturn Amid Global & Domestic Pressures - Groww",
    "published_date": "12/02/2025",
    "publisher": "Groww",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock market today: Trade setup for Nifty 50 to Israel-Iran news; eight stocks to buy or sell on Thursday",
    "body": "Stock market today: The benchmark Nifty-50 index managed to end above the level of 25,200, settling at 25,244.75, with gains of 0.80% on Wednesday. Bank Nifty at 56,621.15 also ended 0.28% higher as all indices ended with gains led by Auto, IT, and FMCG. Even mid- and small caps ended with gains of 0.44 to 1.49%. For the Nifty-50 Index, now, 25000 and 25100 would act as key support zones, and above these levels, the bullish sentiment may continue. On the higher side, 25300 would act as an immediate resistance, while above this could push the market towards 25450-25500, as per Shrikant Chouhan, Head of Equity Research, Kotak Securities. Bank Nifty has retraced more than 80% of its recent breather (57049-55149),, andmomentumremains firmly positive above the 55,400 zone, as per Bajaj Broking. Investors would now await the US Q1 GDP data, scheduled for release on Thursday, which could provide insights into the US economic growth trajectory. On the domestic front, investors would focus on financials. Monsoon-linked sectors are also expected to be in the spotlight as rainfall trends improve, said Siddhartha Khemka, Head of Research,WealthManagement,Motilal Oswal Financial ServicesLtd. The capital market-related stocks are expected to benefit from heightened activity in the broader market and a robust IPO pipeline. Overall, Khemka expects the Indian market to remain firm on the back of reduced global geopolitical concerns and positive domestic cues. Sumeet Bagadia, Executive Director at Choice Broking, has recommended two stock picks for today. Ganesh Dongre, Senior Manager of Technical Research at Anand Rathi, suggested three stocks, while Shiju Koothupalakkal, Senior Manager of Technical Research at Prabhudas Lilladher, has given three stock picks. These includeJubilant FoodWorksLtd.,BirlasoftLtd.,State Bank of India, Ambuja Cements Ltd.,Tata ChemicalsLtd., Greaves Cotton Ltd., Swiggy Ltd., andGujarat State Fertilizers & Chemicals Ltd. JUBLFOOD is currently trading at₹713, having recently rebounded from a key support zone. The stock has successfully broken above a recent swing high of₹702, forming a bullish candlestick on the daily timeframe, which signals a potential trend reversal. This bullish setup is further supported by rising trading volumes, indicating strong buying interest and renewed market participation. 2. Birlasoft Ltd.—Bagadia recommends buyingBSOFTat around₹443.65, keeping stop-loss at₹428 for a target price of₹475 BSOFT is currently trading at₹443.65 and has recently given a breakout from a symmetrical triangle pattern on the daily chart. This breakout, supported by a strong bullish candlestick and a notable surge in trading volume, signals robust bullish momentum and reinforces the positive technical outlook. The stock is now eyeing the immediate resistance at₹450. A sustained move and close above this level would further validate the breakout and open the path for an upside move towards the short-term target of₹475. 3. State Bank of India (SBI)—Dongre recommends buying SBI at around₹800, keeping stop-loss at₹775 for a target price of₹830. A short-term trend analysis of the stock reveals encouraging technical signals that suggest a potential bullish reversal. On the short-term chart, a prominent bullish engulfing candlestick pattern has emerged, signaling a shift in momentum from selling pressure to buying interest. Adding strength to this view, the Relative Strength Index (RSI) has recently entered the oversold zone, indicating that the stock may be poised for a rebound from current levels. This confluence of technical indicators increases the likelihood of a near-term price retracement. 4.Ambuja CementsLtd.—Dongre recommends buying Ambuja Cements or AMBUJACEM at around₹560, keeping stop-loss at₹552 for a target price of₹575 In the recent short-term trend analysis, the stock has shown signs of a potential bullish retracement, supported by emerging technical indicators. A reversal pattern on the chart suggests the possibility of an upward move, with a near-term target around Rs.575. 5. Tata Chemicals Ltd.—Dongre recommends buying Tata Chemicals, or TATACHEM, at around₹940, keeping stop-loss at₹910 for a target price of₹985. A recent short-term analysis of the stock reveals the emergence of a bullish reversal pattern on the chart, indicating a possible near-term price rebound. This formation suggests the potential for a move towards the Rs.985 level, supported by improving price action. 6. Greaves Cotton Ltd.—Koothupalakkal recommends buyingGREAVES COTTONat around₹203.70 for a target price of₹215, keeping Stop loss at₹198 The stock has indicated a rising trend with a series of higher lows formation on the daily chart, currently having a bullish candle to improve the bias and anticipating a further rise in the coming sessions. The RSI has indicated a positive trend reversal to signal a buy, and there is much upside potential visible from the current rate. With the chart technically looking good, we suggest buying the stock. 7. Swiggy Ltd.—Koothupalakkal recommends buying SWIGGY at around₹399.90 for a target price of₹420, keeping a Stop loss at₹392 The stock, after indicating a breakout above the inverted head and shoulder pattern on the daily chart at the₹375 zone, has maintained the strong uptrend and is steadily on the rise with further upward movement anticipated in the coming sessions. The volume participation is on the rise, and with the RSI showing strength, there is scope for further positive move. With the chart technically looking attractive, we suggest buying the stock. 8. Gujarat State Fertilizers & Chemicals Ltd.-Koothupalakkal recommends buyingGujarat State Fertilizers & Chemicals, or GSFC, at around₹203 for a target price of₹215, keeping stop loss at₹198 The stock has recently taken support near the 100-period moving average at the₹192 level and indicated a decent pullback to move past the 200-period MA at the₹201 level to strengthen the bias expecting further rise. The volume participation has been significant, with the RSI indicating a positive trend reversal to signal a buy, carrying on with the positive move further ahead in the coming sessions. With the chart looking good, we suggest buying the stock. Disclaimer:The views and recommendations made above are those of individual analysts or broking companies and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-israel-iran-news-eight-stocks-to-buy-or-sell-on-thursday-11750865918813.html",
    "original_url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxQTXNvelBQYVo4V2ZMUzc2Z0FZNFpDbC1lNHV2eTZqZ25pUEt5Z0NOSl83SWhsekNUdWFEdHF3cVBpdmVYUDRCN3J5Rk9sMjFMM0xfZGJoM3k5SXp6OElsTEZjaFpLTVJkaUJuTFVFZFFNSkkwWTZhTUNzRnFFYktVWlFOWkVUekMzQ2lzdGRTa2FPNjBfbktrN3UwS0l2OFdQaERBUkxHVThJTmFnU0otN3ZEU2FXbi1Wa2JwZkRJX1k5ZzBiVUJjSFFrXy1NRFRQSi13YzZId09mWEJrZnIyc09GZjlvaUxvcm1DRGRYUmRienA3UVliUzR1LURMc2t5b1hv0gGIAkFVX3lxTE1sdTg4bWwtWlEzenJraGxwYjVzUFZ5TEo1WGVyTi1JREZsZGE0REZvRkRLR0t1QVp2MF9JampyWmNEeTBZVjlxXy1MZGNPN3ZMSVZBdzhEWVBFazItc1p5NXFnS25BLXdXNXFLZ1JlQjZLWjVyaFRSM1otamtwNGgzNExMSFNyaFk1SnRCQzNKZ0xDTFlGOU5PQkhCTzQxVGx2NzJNdXhaR2R5eTR6SngtU180YmdIWDltcW5VaVNkNmlPZVl6NFVfS3JMX3J2TWpfUUFqX2ZQTWtNZWZFc20tY2wxemZNc2txYkNkZWZCM3hOYUlGVV9naE9zaGhzSExYdEZSOExoUg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6684,
    "word_count": 1004,
    "gnews_title": "Stock market today: Trade setup for Nifty 50 to Israel-Iran news; eight stocks to buy or sell on Thursday - Mint",
    "published_date": "26/06/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Why Indian Stock Market Crashed, Sensex Lost Over 3,000 Points Today",
    "body": "Why Indian Stock Market Crashed, Sensex Lost Over 3,000 Points Today The collapse of the Indian stock market reportedly wiped out investors' wealth worth Rs 20.16 lakh crore in early trade. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email Sensex lost 3,939.68 points in early trade New Delhi: Indian shares continued to fall sharply on Monday, with the Sensex and Nifty crashing about 5 per cent in early trade, mirroring a sharp fall in global equities. Sensex, a pack of India's top 30 companies listed on the Bombay Stock Exchange, lost 3,939.68 points or 5.22 per cent to 71,425.01, while Nifty, the National Stock Exchange index, dropped 1,160.8 points or 5.06 per cent to 21,743.65. The collapse reportedly wiped out investors' wealth worth Rs 20.16 lakh crore in early trade. Other Asian markets also slumped, with Hong Kong's Hang Seng dropping nearly 11 per cent, Tokyo's Nikkei 225 plunging nearly 7 per cent, Shanghai SSE Composite index tumbling over 6 per cent, and South Korea's Kospi index declining 5 per cent. Last week, the Sensex sank 2,050.23 points or 2.64 per cent, while the Nifty dropped 614.8 points or 2.61 per cent. Why Indian Stock Market Is Down Today The Indian stock market crashed as US President Donald Trump's tariff hikes and retaliation from China fuelled investors' jitters amid fears that a full-blown trade war will impact economic growth across the world. President Trump has sparked a market meltdown after he unveiled sweeping tariffs against US trading partners last week. China also hit back, saying it would impose retaliatory levies of 34 percent on all US goods from April 10. The tit-for-tat moves have now raised concerns of a prolonged trade war . \"Reciprocal tariffs, even if temporary, highlight the increased uncertainty for companies and investors,\" Reuters quoted Kotak Institutional Equities analyst Sanjeev Prasad as saying. \"The performance of Indian markets in the next few weeks will depend on whether there is a reconciliation or retaliation in the tariff situation and behaviour of India's retail and domestic institutional investors,\" he said. VK Vijayakumar, the Chief Investment Strategist at Geojit Financial Services, said that the markets globally are going through \"heightened volatility caused by extreme uncertainty\". Add NDTV As A Trusted Source \"No one has a clue about how this turbulence caused by Trump's tariffs will evolve. Wait and watch would be the best strategy in this turbulent phase of the market,\" he was quoted as saying by the news agency PTI. Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Sensex , Nifty 50 , Indian Stock Market",
    "url": "https://www.ndtv.com/business-news/nifty-50-sensex-why-indian-stock-share-market-crashed-lost-over-3-000-points-today-after-donald-trump-china-tariff-trade-war-8106583",
    "original_url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxPU0pfZkVsRkpsNzJodldHczJXeUR2SGtNZjVVazZYMHYweXppa1dMc2E4UmtrS283SmthSWN0UzBBTlBPY1hEbFlPNjkwSlNIdFFtSmppem1kX2tmY3FVRFpaUTRNWFREZDREVk93M0tCR1NIRC1wbnlleUV4S19BSHNCbGtYSTZPYnNMY1NLMEw0ZVVaZ2dhMGl6MEhnMXRTa0kzUTVMUzAwTS1FbWxsUzlDaWtVRU9UVVE2STJ2MnU2VEh3WWVkN1VMQ3E1YTlobENTRmYzYW5PdW91OGdqQ3I5ZXJCWVRKaGszeUc0ZWNab2tvZzVGTFU3UdIBgwJBVV95cUxNS29FTWhYalByS0RhNDFnRXVYdnVFRzVBelVvM3VWSTRiYXFyVnpXTlEtN196TmNOOEhybWF6a2RETWE4OE5Fc1h6bnByNDRpVlNrcTNjdjJ2Zk11YUYzSmlHWUx5cURjWGV0dTYwaUxFRTY2M1l6YnFlSDlqS3ktZnRQNzVVNEVKWGdWdnUxaVdUZDhvaU9qVk1fOWZnNjNaSzFFNDFuaU5PbEdJQXU3QlNCcnJMd3EtdWhDNjJDeXZyU3BZOEFWbkp0bmhsS3QzbThXVV9GM2VIcU13TmNHTnBLTDNCVmdKbnJWNlp3dkE1YV9tajBlTGkwN2ZBbWxqQVg4?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2702,
    "word_count": 442,
    "gnews_title": "Why Indian Stock Market Crashed, Sensex Lost Over 3,000 Points Today - NDTV",
    "published_date": "07/04/2025",
    "publisher": "NDTV",
    "topic": "Indian stock market news"
  }
]