[
  {
    "title": "Indian stock market: 10 things that changed for market over weekend- Gift Nifty, Trump tariffs to US govt shutdown fears",
    "body": "Indian stock market: The equity market benchmark indices, Sensex and Nifty 50, are expected to open higher on Monday, despite mixed global market cues. Asian markets traded mixed, while the US stock market ended higher last week, after inflation data. This week, investors will focus on keystock market triggers, including the RBI monetary policy, India-US trade deal, developments over US tariffs, domestic and global macroeconomic data, flow of foreign funds, trends in gold prices, and other key geopolitical developments. On Friday, the Indian stock market sharply ended lower, extending its losing streak for the sixth straight session, as fresh Trump tariffs on pharmaceuticals and persistent foreign fund outflow weighed on market sentiment. TheSensexdeclined 733.22 points, or 0.90%, to close at 80,426.46, while the Nifty 50 settled 236.15 points, or 0.95%, lower at 24,654.70. “We expect markets to remain under pressure in the near term, tracking global headwinds, key macroeconomic data, and potential development around the India–US trade talks,” said Siddhartha Khemka - Head of Research, Wealth Management, Motilal Oswal Financial Services Ltd. Here are key global market cues for Sensex today: Asia markets traded mixed on Monday as investors braced for a possible shutdown of the US government. Japan’sNikkei 225fell 0.68%, and the Topix declined 1.27%. South Korea’s Kospi gained 1.05% and the Kosdaq rose 0.82%. Hong Kong’s Hang Seng index futures indicated a higher opening. Gift Nifty was trading around 24,810 level, a premium of nearly 120 points from the Nifty futures’ previous close, indicating a gap-up start for the Indian stock market indices. US stock market ended higher on Friday after mostly in-line US inflation data, but the three major indexes posted losses for the week, with the S&P 500 and Nasdaq snapping three-week streaks of weekly gains. The Dow Jones Industrial Average gained 299.97 points, or 0.65%, to 46,247.29, while the S&P 500 rallied 38.98 points, or 0.59%, to 6,643.70. The Nasdaq Composite closed 99.37 points, or 0.44%, higher at 22,484.07. For the week, theDow Jonesfell 0.2%, the S&P 500 declined 0.3% and the Nasdaq dropped 0.7%. Nvidia share price gained 0.28, Apple shares fell 0.55%, Tesla stock price rallied 4.02%, while Eli Lilly rose 1.4%. Costco Wholesale shares fell 2.9% and Electronic Arts shares jumped 14.9%. Russia launched hundreds of drones and missiles at Kyiv and other parts of Ukraine early on Sunday, killing at least four people and injuring dozens, in one of the most sustained attacks on the capital since the full-scale war began. Russia’s defence ministry said it had carried out a ‘massive’ attack on Ukraine using long-range air- and sea-based weapons and drones to target military infrastructure, including airfields. The US Federal Reserve’s preferred inflation measure edged up in August. The Personal Consumption Expenditures (PCE) Price Index increased 0.3% in August after gaining 0.2% in July. In the 12 months through August, the PCE Price Index advanced 2.7%. That was the biggest year-on-year increase since February and followed a 2.6% rise in July. US consumer spending increased slightly more than expected in August. Consumer spending, which accounts for more than two-thirds of economic activity, rose 0.6% last month after an unrevised 0.5% advance in July. Economists polled by Reuters had forecast consumer spending increasing 0.5%. US government shutdown date is approaching fast. President Donald Trump will meet with the top Democratic and Republican leaders in Congress to discuss extending government funding. The last date for the government funding is September 30. Without a deal a shutdown would begin from October 1, which is also when new US tariffs on heavy trucks, pharmaceuticals and other items go into effect. The US dollar was on the defensive ahead of a slew of economic data releases. The US dollar index was steady at 98.134. Against the yen, the dollar was down 0.2% to 149.24, after having risen over 1% against the Japanese currency last week, Reuters reported. The euro rose 0.15% to $1.1717, while sterling edged 0.11% higher to $1.3418. Gold prices traded higher after notching a sixth weekly gain as traders weighed a potential US government shutdown. Gold price traded near $3,773 an ounce after gaining 2% last week. Crude oil prices fell nearly 1% after Iraq’s Kurdistan region resumed crude oil exports via Turkey over the weekend and as OPEC plans another oil output hike in November. Brent crude futures fell 0.99% to $69.46 a barrel, while US West Texas Intermediate crude declined 1% to $65.06 a barrel. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-10-things-that-changed-for-market-over-weekend-gift-nifty-trump-tariffs-to-us-govt-shutdown-fears-11759109875742.html",
    "original_url": "https://news.google.com/rss/articles/CBMilgJBVV95cUxPcXdUNXJISkFXanlpTkpCTDN3em91eVlVUC14Rkd0dnNET1hTQmtqMTg1TEV1WGtscjdnNDB1a2dnMC1WSmllV09lcU1KVHpwajVUVzZuLUNQSHZZcTB1XzduLXV6UEdyTU5CdDJoSFpRUC1qdDBsMHR6aGlnZUxTVE5DeXA0eFg5ZkJ2eFU3UDh4Q0tmVU1lTjdMMDFKVWFSUDBLR2J2Yl8zY2FGbWdHUGdqWWlPdl9ac2Q1WnotdW9RQUtuQ1ZRVWk3Tmk5blBVTEItVDhSNkZKMkNhLU9iMFItZXNFWU1RczNweXQ2VmVKcWxHc3NpdE5GVzVOeWNsVVhidG0wa3Rod3gyamJEbmZzQWZiQdIBmwJBVV95cUxNblpDQ1NaWUcxdmtxU3RWNXd0RXIwSTc3a2VJV01KaF9JZVFTNThNTkVGbDUwNHlsMlRxdTgxQk42U0tnWXBXZTRLTkxYMFh4UEJrbm43OG8yaGUwVVd2SThGMXJCNGF6WWFsVWlnTDdBZDdoYkdrS2xDRnZnWm5qT2pDYmdZRGp4QzIxRFM0dnBnMjNGb1lzV3VFd3FaclJLdUNDTGtfajc4d2lpTVN1RzUtdl9NQUp3MTFOZU9TNmRmeUI2N3o4OGJrR0JER2lwWU9mbkx4cTFRSlR6M01FUHhib3owRFZna1VTYlJHdnlCdjJDTmpuX2tVRURsdUt5MmRGRlpJTEZqN2lIUVRfc1Q4QllPOTdiTTg0?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5080,
    "word_count": 800,
    "gnews_title": "Indian stock market: 10 things that changed for market over weekend- Gift Nifty, Trump tariffs to US govt shutdown fears - Mint",
    "published_date": "29/09/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock market today: Nifty50 ends above 24,700; BSE Sensex up over 400 points",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More How to grow expensive lettuce for salad in balcony garden and the best time to sow it The rainbow of the wild: 10 colourful and rare insects across the globe Mixing this one ingredient in your Mehendi can give your hair a natural black colour 10 freshwater aquarium fish that grow too big for small tanks Shweta Tiwari’s top 10 ultra-glam looks that prove she’s aging in reverse Saree Diaries: Nivetha Pethuraj’s traditional style turns heads Rashami Desai’s Festive Glam in Ethnic Elegance Saiee Manjrekar stuns in dazzling evening attire 10 times Mrunal Thakur dressed like a K-Drama star 10 Stunning ethnic looks of Amulya Gowda Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-september-03-2025-dalal-street-indian-equities-global-markets-gst-council-donald-trump-tariffs/articleshow/123668438.cms",
    "original_url": "https://news.google.com/rss/articles/CBMivwJBVV95cUxOME1CaFo2am1Rc3pXM1ZkMmJsaVNlYVBBN1o4aVllYUlaRmFpejJIUHhiR1RqZzRfTHpYNlVhLUM0NTdOd3V4SkYtS1NXR3ZWTWtDOUlsM2drZ1RNQ3o0Z28zcHpuU05sMzJlWGl2aDNqODB0SnlqdHY0U1o3aTNOLXJsZHc5YWM0UHdPRjdtQm9ydHBURUxhV19xT0NDLV84VWVBZkZCYUVYUTV3QzdSRjV1b01LZjlOeGgyTE5iRWR0a0NvbnNIVFpZVXhQanNDdngxQ3hLZDRkdXUtNmszVlFoN2xNRF9BWmF3akR0Zk5KUy1uTUsxeEZkM05INU4tb1k4RFNEbUxMWmp0UmtsMk9nTi1kVFVCU1E4S2U5QU8yc0VJNGlwTUVGTVNna0hxenR0c19jMXU0Zm5HZ1dj0gHEAkFVX3lxTE01d0s1SGgyLVp4bXRYMjNMd1FzOGNOZ0ZzOElyQXdWYlRISGRxN3I0LVdITHhMaEJGTXlkc01fMEI3ZDhaeWdvVjNmQlpaaHd2N1o1MGZRanNEYWo5ZGJRMGNGaVBrbk5IekdYbHlvYzRrRHA3RzRFQ3VnTXpMWWdYb29QeWg0RDRjbmtPdGM5bXAxT2laWEdORkdHUzU5a3ItWWUtNWk0b0dTZ0g0QnFhcUgtSWNEYzMzRVNzUjl1bmpkcTc1R2Utb0QyX2phMnJKYzhLYmhNcm0tX25GLTBFVDdTX2cxaXRkekN1RkZZd2M1dnBWaGNPREp6YU5SUGswaWFRcFlyYnVfWXVFSWFlSzdSc0Q0bnZPSmQ0eWh2Z19NeUJTTUs5UENDM1JGem5BTkNsczdpRndGdDd2Tl9SWGN4cA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1660,
    "word_count": 268,
    "gnews_title": "Stock market today: Nifty50 ends above 24,700; BSE Sensex up over 400 points - The Times of India",
    "published_date": "03/09/2025",
    "publisher": "The Times of India",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market: 10 key things that changed for market overnight - Gift Nifty, US govt shutdown to Trump tariffs",
    "body": "Indian stock market: The equity market benchmark indices, Sensex and Nifty 50, are expected to open on a flat note Tuesday, following mixed global market cues. Asian markets traded mixed, while the US stock market ended higher overnight, led by a rally in technology stocks. On Monday, the Indian stock market ended lower, extending its losing streak to the seventh consecutive session. TheSensexdeclined 61.52 points, or 0.08%, to close at 80,364.94, while the Nifty 50 settled 19.80 points, or 0.08%, lower at 24,634.90. “On one hand, the overhang of recent US policy actions has eased slightly; however, persistent foreign fund outflows and caution ahead of the MPC meeting continue to weigh on sentiment. Participants should focus on selective stock opportunities aligned with sectoral trends while keeping position sizes under check,” said Ajit Mishra – SVP, Research, Religare Broking Ltd. Here are key global market cues for Sensex today: Asian markets traded mixed on Tuesday, following overnight gains on Wall Street. Japan’sNikkei 225fell 0.32%, while the Topix declined 0.21%. South Korea’s Kospi gained 0.27%, while the Kosdaq rose 0.18%. Hong Kong’s Hang Seng index futures indicated a higher opening. Gift Nifty was trading around 24,692 level, a premium of nearly 7 points from the Nifty futures’ previous close, indicating a flat start for the Indian stock market indices. US stock market ended higher on Monday, led by gains in technology stocks. The Dow Jones Industrial Average gained 68.78 points, or 0.15%, to 46,316.07, while the S&P 500 rose 17.51 points, or 0.26%, to 6,661.21. The Nasdaq Composite closed 107.09 points, or 0.48%, higher at 22,591.15. Nvidia share price rallied 2.07%, Amazon shares gained 1.09%, Intel stock dipped 2.9%, while Tesla stock price rose 0.64%. Electronic Arts shares surged 4.5%, Lam Research shares advanced 2.15%, Canopy Growth share price jumped 17% while Cronos Group shares spiked 13.15% and Tilray Brands shares jumped 60.9%. US President Donald Trump set a 10% tariff rate on imports of lumber and 25% on vanities, kitchen cabinets and upholstered wooden products. The tariffs will take effect on October 14. On January 1, the tariff rates would increase to 30% for upholstered wooden products and to 50% for kitchen cabinets and vanities imported from countries that fail to reach an agreement with the US. US Vice President JD Vance said he believes the US government is on track to shut down. “I think we're headed to a shutdown,” Vice President JD Vance said. President Donald Trump and his Democratic opponents appeared to make little progress at a White House meeting aimed at heading off a government shutdown. St. Louis Federal Reserve President Alberto Musalem said he was open to further interest rate cuts but the Fed must be cautious and keep rates high enough to continue to lean against inflation that remains roughly a percentage point above the central bank’s 2% target, Reuters reported. Federal Reserve Bank of New York President John Williams said that emerging signs of weakness in the labor market drove his support for cutting interest rates at the most recent central bank meeting. China’s manufacturing activity shrank for a sixth month in September. The official purchasing managers’ index (PMI) rose to 49.8 in September versus 49.4 in August, below the 50-mark separating growth from contraction, and beating a median forecast of 49.6 in a Reuters poll. Bank of Japan board members debated the feasibility of raising interest rates in the near term, with one suggesting the timing may be appropriate, a summary of opinions at the central bank’s September policy meeting showed. Crude oil prices fell on another anticipated production increase by OPEC and the resumption of oil exports from Iraq’s Kurdistan region via Turkey. Brent crude futures for November delivery fell 0.66% to $67.52 a barrel, while US West Texas Intermediate crude price was trading at $63.07 a barrel, down 0.60%. The US dollar fell in cautious trading as investors braced for a possible US government shutdown. US dollar index, which has dropped 9.7% this year, eased a bit to 97.948. The euro was flat at $1.17275, while sterling was at $1.3433. The Japanese yen was slightly weaker at 148.72 per US dollar. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-10-key-things-that-changed-for-market-overnight-gift-nifty-us-govt-shutdown-to-trump-tariffs-11759196279705.html",
    "original_url": "https://news.google.com/rss/articles/CBMijwJBVV95cUxPRG5vdzNfcklnSkEyVmFUbFZnR0JwOWlYclA1a29oeXN5SWZrUVJLWklfSVhhZ19mYnpfc2M1NDBpWWlnMEt1QnFYdWhGcFpjNk5SSGpLSzl1ZlV0b2pnZ0JsYWtiVHNCZjI4bG90VTYzaVdiOTVDNXQ0dGduNFNPdXBUN2hIMWRCdHZORzQzQW5QVWhmYzFjT2FsTkN5ZGhCY1dONmNyXzllclByYlJDRXE2NkppaUxYN2VSc3BxWDZUUU1QOE9iai1iTjhLbkhnQ2sxM2h2MHgyWEEyTnNROF80dHlRMDUtWW16bGpPWUJjOXFzbVozb21FbkxJN1dEZzBPb200QWw5ME1LT0FZ0gGUAkFVX3lxTE1oZU00UkIxMllva0QtNTNXYndObml3TUJhM19MV09HN2doeHdJRldHajR3SFNDOTJZZU9IMUFLaDdVSkVHcWRzZVNhX3djTDZmckpKcl91NUNDSjQyQkNLT3FzY3JJUm0tVFRLS1pEYnlkSTJwSUQwODgtbFRLaC16SWo3Q3NVWGgzMDNubGh1LWZNdmRMeEFCemF5Rl9XSUpxR25PQ2o4dEZLMnNvUHItYkNTT0tNcjR2Qmgxc2FFNmU0NDkzZ29pMEwwWmNDS01nSFRTeUg3UWRDeE5CYnJRZTAtOFpocjFCRy1KYUNfbnR0TXNZUzBxbUNWTExGMV8wQ1AzZDc5TnYwWExUYkhnajNhUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4737,
    "word_count": 759,
    "gnews_title": "Indian stock market: 10 key things that changed for market overnight - Gift Nifty, US govt shutdown to Trump tariffs - Mint",
    "published_date": "30/09/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock market today: Nifty50 opens above 24,650; BSE Sensex up over 200 points",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Bigg Boss 19: Ashnoor Kaur’s top 10 stylish looks Daniel Balaji's journey from TV to Tamil Cinema’s iconic villain 'Dude' actor Mamitha Baiju charms fans with her graceful elegance Farhana Bodi brings Dubai glamour to the Venice Film Festival Bigg Boss Telugu fame Yashmi Gowda's beautiful looks 9 beautiful baby names inspired by flowers Inspirational reads that spark hope and light 9 small creatures that cost more than gold and here’s the list Bigg Boss Malayalam 7: Gorgeous pics of Mastani Best days to manifest in September 2025 Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-september-02-2025-dalal-street-indian-equities-global-markets-donald-trump-tariffs/articleshow/123646187.cms",
    "original_url": "https://news.google.com/rss/articles/CBMirwJBVV95cUxNVmVaXzNnT2Mxc2hpc0hsalJQc282eFFocFd1WXlEWUUwcXhuYUstR0xveGg3Xy1DSHZycnpvYkl3VnhIOEp3SUIxYXlzVGcwOHdKMlBSVjNkU2V1OHM2YmFucVdFTndBalZTNFRwVFhOMnl1VmRTTkhJeFRoN2lDLTNoRjI1OFdoUFFWUTM4QlhDb1ZPejBZbWs3aWJodEdCTmFkQ0pqcFhvR2h3akxRTUlBazlWUFNxOGg3ai1YWjlucUg2aUdTSHh6NG9XVVJvb205VFpSRmYxQVVYV28zbnlmZW5uZzZPVVhzX3JMd2p1SFdDX29SM2RNelVTMk94NDd3WDJybDNJU1p4QjdpS2tYWVZYOGZsdjVvamVrc2w4U3VkeXdZbEkydlhEQTDSAbQCQVVfeXFMT0pOUEVpcUNCQzRfVkcwM1IzS0pzOXBma0lSYjFSS2o5NFFiVTNzRDU0U0RReExld0tCN25iQmI4SC1TNlc3V2sxRGRobzVETDF6WWk0c2g5VjBwT0M1cHczZlRCajM1RkdrUXlqOUZXRmlXVEw2QjczS194YmNnbFF0LUVrNFAzWXlpZ29ndkZyQ1pSNTMxVlFVVWVKTjZwTHhMcThaMlVncHpKNWg2YUpMNnJhcFlpRDJpY2lucU54VWFqeE5uNTlfby1makY5c3RCMzl1OS1Qam5kS2lWODBhQ21GNE90Sk5qbUtMWE1YSlh1czVfZXNtQW1ZY2gtcHFtMFZ4OFIzaTFGYnB5WWRGSEVyd2dNdTN0UXlQWGNSZUsycVEyX1ZZUE44RzlyamROZnM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1564,
    "word_count": 250,
    "gnews_title": "Stock market today: Nifty50 opens above 24,650; BSE Sensex up over 200 points - The Times of India",
    "published_date": "02/09/2025",
    "publisher": "The Times of India",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market: 10 things that changed for market overnight- Gift Nifty, Trump tariffs, US GDP to Accenture results",
    "body": "Indian stock market: The equity market benchmark indices, Sensex and Nifty 50, are expected to extend losses and open lower on Friday, following weak global market cues, after US President Donald Trump announced fresh tariffs on pharmaceutical products, furniture, and heavy trucks. Asian markets slipped, while the US stock market ended lower overnight, after stronger US economic data cast doubt on the Federal Reserve’s rate cut outlook. On Thursday, the Indian stock market ended sharply lower, extending losses for the fifth straight session, with the benchmark Nifty 50 index slipping below 24,900. TheSensexdeclined 555.95 points, or 0.68%, to close at 81,159.68, while the Nifty 50 settled 166.05 points, or 0.66%, lower at 24,890.85. “We expect markets to remain under pressure in the near term, tracking global headwinds, macroeconomic data releases, and developments around the India–U.S. trade talks. Concerns over economic growth persist amid the impact of rising global commodity prices, weakening Rupee and US tariffs adding to investor caution,” said Siddhartha Khemka - Head of Research, Wealth Management, Motilal Oswal Financial Services Ltd. Here are key global market cues for Sensex today: Asian markets traded lower on Friday after Donald Trump announced fresh tariffs on furniture, heavy trucks and pharmaceutical products. Japan’s Nikkei 225 declined 0.28%, while the Topix rose 0.39% to reach a fresh record high. South Korea’s Kospi dropped 1.54%, while the Kosdaq retreated 1.45%. Hong Kong’s Hang Seng index futures indicated a lower opening. Gift Nifty was trading around 24,902 level, a discount of nearly 66 points from the Nifty futures’ previous close, indicating a negative start for the Indian stock market indices. US stock market ended lower on Thursday after economic data increased uncertainty over the outlook for interest rate cuts from the Federal Reserve. The Dow Jones Industrial Average declined 173.96 points, or 0.38%, to 45,947.32, while the S&P 500 dropped 33.25 points, or 0.50%, to 6,604.72. The Nasdaq Composite ended 113.16 points, or 0.50%, lower at 22,384.70. Accenture shares fell 2.7%, Nvidia share price rose 0.41%, Apple stock price rallied 1.81%, Microsoft stock declined 0.61, while Intel shares jumped 8.9% and Tesla stock price plunged 4.38%. CarMax shares fell 20.1%. The US economy grew faster than previously estimated in the second quarter. US Q2 GDP increased at an upwardly revised 3.8% annualized rate, the fastest pace since the Q3 of 2023. The economy was previously reported to have grown at a 3.3% pace in the second quarter. Economists polled by Reuters had expected GDP growth would be unrevised. US GDP contracted at a 0.6% pace in the Q1, revised slightly down from the previously reported 0.5% pace of decline. President Donald Trump said that he will putimport taxes of 100% on pharmaceutical drugs, 50% on kitchen cabinets and bathroom vanities, 30% on upholstered furniture and 25% on heavy trucks starting on October 1. The number of Americans filing new applications for unemployment benefits fell last week. Initial claims for state unemployment benefits dropped 14,000 to a seasonally adjusted 218,000 for the week ended September 20. Economists polled by Reuters had forecast 235,000 claims for the latest week. New orders for key US-manufactured capital goods unexpectedly increased in August. Non-defense capital goods orders excluding aircraft rose 0.6% last month after a downwardly revised 0.8% jump in July. Economists polled by Reuters had forecast these core capital goods orders dipping 0.1%. Orders for durable goods, items ranging from toasters to aircraft meant to last three years or more, rebounded 2.9% in August after falling 2.7% in July. Accenture reported a 7% YoY rise in revenue to $17.60 billion in the June-August 2025 quarter, beating analysts’ average estimate of $17.36 billion. The revenues reflect a foreign-exchange impact of about 2.5%, the company said. New bookings increased 6% to $21.31 billion during the quarter. The firm posted a 7% increase in full-year revenues to $69.7 billion.Accenturesees full-year 2026 revenue growth between 2% and 5%, slightly below estimates of 5.3%, according to data compiled by LSEG. The company said it expects to return at least $9.3 billion in cash to shareholders in FY26. Gold prices fell after stronger-than-expected US economic data weighed on Fed rate cut outlook and lifted the dollar. Spot gold price dropped 0.2% to $3,741.71 per ounce. Bullion rose 1.7% so far this week. US gold futures for December delivery were unchanged at $3,772.20. The US dollar index hovered near a three-week high at 98.42 on reduced expectations of Fed rate cuts. The dollar hovered close to the 150 yen level. The euro last bought $1.1668, having lost 0.6% in the previous session, while sterling was little changed at $1.3344. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-10-things-that-changed-for-market-overnight-gift-nifty-trump-tariffs-us-gdp-to-accenture-results-11758849817810.html",
    "original_url": "https://news.google.com/rss/articles/CBMilAJBVV95cUxOT1RwVjc0ejRFYXoxaFY2ZnRKQWN6am5UOUs4UHZ5cndTSkRrSlRWUUZmOXVRRU1CUkx4cG1UUmdmSGROUUZqdmpkRVF6SHVsaUF4Y1pleDg3d3h6b1ZxcEtVcUVkZXZqUnk3TzdNdkVaamxKeVVycU9NdjdmUlVOckNiSkZWY2g3MjlDOUE3RnBhb0JYb0ZMOEFueDZXVUtJU3h5UnJhLUtTY0RLRElnbU1fTElUbTZSTVdDRDhZVVY4VzF6NzlzcEZicFhLRFNNZ3piLXpUYll5RTBENTBlQ0xiS3ZWWGtwbGhOZ2UydDdfQmRBTHRUQy1jRDhWZTZvSlNGUmlCQlpDZnQtWkphYXhxNjfSAZoCQVVfeXFMTTlVdFhOcmhJTTRqS0dzNXEtMThhMWozOWQxVnotT0xXREJvSldIOU9ncEJoYW4tVlpibmtyeWlYT0M0b2s5bGxqZHR3c01zdGQycF9VUHNzaFNHeFNrVkV6OUpEZ3IxaFlsSWozdDlnNWhWOGZsUzE5UVhsZWUyX0UzcXZPdWJkTXM2LWZwLUNpRnAyRVNKRno1ZzkwbnBIVU5sTkJqQmJ6NHZfa0FTQTNndm9CNFhJbktUaGd5TFdLdHo4RktlNkdsYVNlOUZPTU9DdGY3TkZqT1lNUDhGODRBYksybjJpVjZ4OEdydDMydklaazk3LUlNMWUydmt0V1drTV8xaDVwRU9aQUx5T2pzVUhwZ1Nfb25R?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5337,
    "word_count": 833,
    "gnews_title": "Indian stock market: 10 things that changed for market overnight- Gift Nifty, Trump tariffs, US GDP to Accenture results - Mint",
    "published_date": "26/09/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Sensex falls 400 points, investors lose  ₹3 lakh crore in a day— 10 key highlights from Indian stock market today",
    "body": "Stock market today: The Indian stock market ended with significant losses on Wednesday, September 24, tracking weak global cues. The Sensex closed the day at 81,715.63, down 386 points, or 0.47 per cent, while the Nifty 50 settled at 25,056.90, down 113 points, or 0.45 per cent. Thus, the benchmarks extended their losing run to the fourth consecutive session. The BSE Midcap and Smallcap indices fell 0.85 per cent and 0.50 per cent, respectively. Investors lost nearly₹3 lakh crore in a single session as the overall market capitalisation of BSE-listed firms dropped to nearly₹460.5 lakh crore from₹463.6 lakh crore in the previous session. Weak global cues, the dollar's rise, and persisting concerns over valuations, FII selling and Trump's tariffs kept the market down for the fourth consecutive session. Major European markets, including the UK's FTSE, France's CAC 40, and Germany's DAX, traded in the red when the Sensex ended amid a rise in the US dollar after theUS Federal Reserve Chair Jerome Powell'smixed signals on rate cuts on Tuesday. In his speech on Tuesday, 23 September, Powell said that if the Fed cuts its rates too fast, it will leave the task of containing inflation unfinished to bring it under the central bank's target range. With optimism over GST cuts behind, investors have shifted their focus back to valuations, earnings, and tariff chatter following the H-1B visa fee hike. \"Profit booking has been observed in Indian markets post-GST reforms, as investors recalibrate valuations and Q2 earnings expectations. IT stocks underperformed due to H-1B fee hikes, while US trade rhetoric amid ongoing trade negotiations and weak global cues are prompting cautious investor sentiment,\" said Vinod Nair, Head of Research, Geojit Investments. \"India’s relatively high valuations, coupled with moderation in earnings growth, continue to lead FIIs to trim their positions. That said, structural reforms and domestic growth drivers are keeping the underlying trend constructive. Current headwinds appear transitory, with headwinds likely to ease over time,\" Nair said. As many as 34 stocks ended in the red in the Nifty 50 index. Shares of Tata Motors (down 2.62 per cent), BEL (down 2.16 per cent), and Jio Financial Services (down 2.02 per cent) ended as the top losers. Shares of Power Grid Corporation (up 1.68 per cent), HUL (up 1.36 per cent), and NTPC (up 1.31 per cent) ended as the top gainers in the Nifty index. Barring Nifty FMCG (up 0.18 per cent), all sectoral indices ended with losses, with Nifty Realty (down 2.49 per cent) ending as the top loser. Nifty Auto (down 1.15 per cent), Private Bank (down 0.86 per cent), Media (down 0.81 per cent), and IT (down 0.72 per cent) ended with significant losses. Nifty Bank fell 0.70 per cent, while the Financial Services index declined 0.64 per cent. Vodafone Idea (66.84 crore shares), Adani Power (13.60 crore shares), and YES Bank (7.7 crore shares) were the most active stocks in terms of volume on the NSE. Zuari Industries, Raj Packaging Industries, NACDAC Infrastructure, Machino Plastics, Ishaan Infrastructures and Shelters, Sacheta Metals, Universal Arts, and Incap were the eight stocks that jumped over 15 per cent on the BSE, defying weak market sentiment. On the other hand, Adani Power, Diggi Multitrade, Eimco Elecon (India), and PDP Shipping & Projects were the four stocks that crashed over 10 per cent on the BSE. Out of 4,320 stocks traded on the BSE, 1,602 advanced, while 2,565 declined. Some 153 stocks remained unchanged. As many as 176 stocks, including Maruti Suzuki India, SBI, Tata Steel, Bajaj Finance, and Canara Bank, hit their 52-week highs in intraday trade on the BSE. SpiceJet, Symphony, Crompton Greaves Consumer Electricals, Quess Corp, Praj Industries, Ganesha Ecosphere, and Aurionpro Solutions were among the 76 stocks that hit their 52-week lows on the BSE. According to Shrikant Chouhan, the head of equity research at Kotak Securities, on intraday charts, the Nifty 50 is holding a lower top formation, and on daily charts, it formed a bearish candle, which is largely negative. \"We are of the view that the intraday market texture is weak, but a fresh selloff is possible only after the dismissal of the 25,000 level. Below this, the market could slip to 24,900–24,810. On the flip side, above 25,100, the pullback move could extend up to 25,200-25250. The intraday market texture is volatile; hence, level-based trading would be the ideal strategy for day traders,\" said Chouhan. Nilesh Jain, the head technical and derivatives research analyst at Centrum Broking, said the Nifty 50 has now completed a 38.2 per cent Fibonacci retracement of the rally from 24,404 to the recent peak of 25,448, with the key level around 25,050. \"A decisive move below this level could open the door for further downside towards 24,920, which coincides with the 50-day and 100-day moving averages, as well as the 50 per cent retracement of the recent uptrend,\" said Jain. \"Despite the ongoing weakness, the broader structure remains positive as long as Nifty holds above 24,900. On the upside, a breakout above 25,150 would invalidate the current bearish setup and may trigger a short-covering rally towards 25,300,\" Jain said. Read all market-related newshere Read more stories byNishant Kumar Disclaimer:This story is for educational purposes only. The views and recommendations expressed are those of individual analysts or broking firms, not Mint. We advise investors to consult with certified experts before making any investment decisions, as market conditions can change rapidly and circumstances may vary. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-falls-400-points-investors-lose-3-lakh-crore-in-a-day-10-key-highlights-from-indian-stock-market-today-11758707155344.html",
    "original_url": "https://news.google.com/rss/articles/CBMiiwJBVV95cUxQUUtyekZtRHdYb0tLY05IQk9UeWpZV0tmR2NGekw1aWtBZHNYV0xzVVJxNkY4dTBHc1RXR09ZdjUwY0J6NXY4XzlPQWUxRndyb1NZbWpPSmNFRVZmei1wbDFEVjVPSGJBQ29HdXowQURBejVDV1dSYV9lSU5PYnI3TXpSTVV1cWlMOE9tZmUzempaTEFlUEhhekc3dnpIMTZMMGpGQi1RQW5VOGROejRXUl9PbkZwb1gtQlB4VVM3ZnpDNEdHcFd6NHJTM3U2WVBIMTNyRS12TGNfUnF4RmEyZjhrU2UxejJtZ195RWJMU1owdGJmUkZ1bmdOb1J0eFViQ1dESml4OHNJN2PSAZACQVVfeXFMT1NCTXktdGYwTl9aMkZmMnZ1X1hvR0M1YjFKa3h0cFgtcldCeFZCcFNCekNDY2lJQVg4ZWMyeFZaOS1PUGx2STVRQ3BqQkt5V3duN0JiYzYtUlRhYnVYajJmdzIxWHZwWVNtOTdOWVNYaDB1TzUtSzgtQlhJLUNhTzNWWWFVVkxZdVBWX0lrLXhqRVpZbzdQTVU4YjZVd2dPUGRhanNfaDlTLUpxOHpwOGZrSm9kYU5NaUNTNUc5bnl3Q2dGR3ZEM0hWMjhNUGpxMGFWNUFVZjRBYmtZOVBQUUkyWTBrRExIVy1qbnEtZURzMTY4OXlIcGFPVGQ1OFhQNGkyMTdNSFhjcFlmeVNEdlk?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5844,
    "word_count": 937,
    "gnews_title": "Sensex falls 400 points, investors lose ₹3 lakh crore in a day— 10 key highlights from Indian stock market today - Mint",
    "published_date": "24/09/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market: 8 key things that changed for market overnight - Gift Nifty, Wall Street losses to gold prices",
    "body": "Indian stock market: The equity benchmark indices, Sensex and Nifty 50, are expected to open lower on Thursday, following weak global market cues. Asian markets traded mixed, while the US stock market ended lower overnight, extending its fall for the second straight session. On Wednesday, the Indian stock market ended lower, extending losses for the fourth consecutive session, amid selling across the board. TheSensexdeclined 386.47 points, or 0.47%, to close at 81,715.63, while the Nifty 50 settled 112.60 points, or 0.45%, lower at 25,056.90. “Overall, while festive demand and GST-led structural reforms provide support, currency weakness and global headwinds including uncertainty related to India-US trade deal are likely to keep markets range-bound in the near term,” said Siddhartha Khemka - Head of Research, Wealth Management, Motilal Oswal Financial Services Ltd. Here are key global market cues for Sensex today: Asian markets traded mixed on Thursday, following overnight losses on Wall Street. Japan’sNikkei 225fell 0.11%, while the Topix gained 0.18%. South Korea’s Kospi eased 0.02%, and the Kosdaq dropped 0.27%. Hong Kong Hang Seng index futures indicated a lower opening. Gift Nifty was trading around 25,065 level, a discount of nearly 47 points from the Nifty futures’ previous close, indicating a negative start for the Indian stock market indices. US stock market indices ended lower for a second straight session on Wednesday, as investors booked profits. The Dow Jones Industrial Average declined 171.50 points, or 0.37%, to 46,121.28, while the S&P 500 fell 18.94 points, or 0.28%, to 6,637.98. The Nasdaq Composite closed 75.62 points, or 0.33%, lower at 22,497.86. Nvidia share price fell 0.82%, Apple shares dropped 0.83%, while Microsoft shares gained 0.18%. Tesla stock price rallied 3.98%, Freeport-McMoRan share price plunged 16.95%, and General Motors shares rose 2.3%. Micron Technology stock declined 2.8% and Oracle shares dropped 1.7%. Sales of new US single-family homes surged 20.5% to a seasonally adjusted annualized rate of 800,000 units in August. The sales pace for July was revised higher to a rate of 664,000 units from the previously reported pace of 652,000 units. Economists polled by Reuters had forecast new home sales, which make up about 14% of US home sales, easing to a rate of 650,000 units. The goods and services tax (GST) reforms should help lower retail prices and support consumption growth, the Reserve Bank of India said in its monthly bulletin. The GST reforms should “progressively result in a sustained positive impact through significant gains in ease of doing business, lower retail prices and strengthening of consumption growth drivers”, the bulletin said. Higher seasonal agricultural sowing is also expected to keep food prices in check, it said. Gold prices rebounded, driven by expectations of further US interest rate cuts, geopolitical risks, and a slightly weaker dollar. Spot gold price rose 0.3% to $3,747.59 per ounce, while US gold futures for December delivery gained 0.3% to $3,778.50. The US dollar was steady, holding its overnight gains. The dollar index, which measures the US currency against six other units, was at 97.813, hovering near a three-week high. The euro was steady at $1.17425, while Sterling was little changed at $1.3451. The yen was last at 148.62 per US dollar. Crude oil prices fell as investors booked profits after a jump to a seven-week high during the prior session. Brent crude futures fell 0.03% to $69.29 a barrel, while US West Texas Intermediate (WTI) crude futures fell 0.15% to $64.89 a barrel. Both benchmarks gained 2.5% in the previous session. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-8-key-things-that-changed-for-market-overnight-gift-nifty-wall-street-losses-to-gold-prices-11758731936334.html",
    "original_url": "https://news.google.com/rss/articles/CBMijgJBVV95cUxQV2F4RElyME85YVNDY2ppRE5XSkQ4SVo1QWNVQzMxVVI5TWVPZEs5YVRHUC1lSVBVWFQ5NEJSWVQyR19zUllFWEVfdVdFVXJ2WGdjMVk4Y1Ezd0RPY1k2Z0JpMUFYbUhKUUtlSGpXTFNRZU9sN1l0SlhtLWlWMUJZUFgwUlB3bE9BbWdrb3NXeXRnN2RNZ3Bzdy04U2l0S2hEQ1hoWWRWVm1mSG9XbVl4MXhFNXlQM0RCM0pfTEtKSFk2Z0RrZ1o4V3VQSFExTTlPRmY4YTRnaF9XNlVKd3RRZGtzTnladmNtREhVbm5DWkNUM2ZtQ244SHY4MEs2bWxsU0ZrN3dJd0pIcmxwSGfSAZMCQVVfeXFMTnUxTWtkekZuZVNEYmNNcGE3NE82UFFkdW5BdmhmeFllaVZZSVJHRGl2UlZyMUFWWlZZZ09jcFdzcjNhTmZuV2JJWFpUX2ttaFExZnhlYWNCZGlEWU5fMHcxc29NdEFFQVFuVEVlRlhFSTg5cmdxeFAzVDFoZVlQOGhVQnNWSmZmX3lHSlhQT3N5TExUeHhkM1luRTN0U29JM2xneDlYVTVUTFZ2ekxqOGRtQnU3WGVjVUNQMW9lNjhHaFo3LVRMSnV5WGZLX1BHSFU0UmNuUmtjTUxJMzVEZlFFb09TX2pzYmx3LU82QzF5N3dOU0ROZGNaYnNXa245NWhuTktXQmo3X3JMekVzaUdsNDg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4133,
    "word_count": 646,
    "gnews_title": "Indian stock market: 8 key things that changed for market overnight - Gift Nifty, Wall Street losses to gold prices - Mint",
    "published_date": "25/09/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Sensex, Nifty 50 extend losses to 7th consecutive session— 10 key highlights from Indian stock market today",
    "body": "Stock market today:Indian stock market benchmarks—the Sensex and the Nifty 50—ended in negative territory on Monday, September 29, extending their losing streak to the seventh consecutive session. In these seven sessions, both indices have declined by over 3 per cent each. The Sensex ended 62 points, or 0.08 per cent, lower at 80,364.94, while the Nifty 50 settled at 24,634.90, down 20 points, or 0.08 per cent on Monday. The BSE Midcap index outperformed, rising 0.34 per cent, but the Smallcap index slipped 0.17 per cent. ICICI Bank, Axis Bank, and Bharti Airtel were the top drags on the Sensex, while HDFC Bank and SBI offered the strongest support to the index. The Indian stock market's fall over the last seven sessions could be largely attributed to US President Donald Trump's fresh protectionist measures—an H-1B visa fee hike and a tariff on pharma imports. Relentless selling by foreign institutional investors (FIIs) and the lack of fresh positive triggers are also affecting market sentiment. \"The domestic market concluded a volatile session on a flat note as investors turned more cautious ahead of a holiday-led truncated week and continued FII selling. Lack of clarity in the US-India trade deal and prolonged pressure on IT and pharma indices are near-term concerns for the market,\" said Vinod Nair, Head of Research, Geojit Investments Limited. Nair observed that investors await the RBI policy outcome on Wednesday, and the central bank is expected to keep the rates unchanged to contain volatility in the rupee. Shares of Maruti Suzuki India (down 1.76 per cent), Axis Bank (down 1.73 per cent), and Dr. Reddy's Laboratories (down 1.13 per cent) ended as the top losers. Shares of IndusInd Bank (up 3.07 per cent), Titan Company (up 2.70 per cent), and Hindalco Industries (up 1.65 per cent) ended as the top gainers in the Nifty index. Nifty PSU Bank ended with a stellar gain of 1.78 per cent, followed by Nifty Oil and Gas, which rose 1.35 per cent and Nifty Realty, which gained 0.88 per cent. The Nifty Bank index climbed 0.13 per cent. Vodafone Idea (73.91 crore shares), Sammaan Capital (15.67 crore shares), and PC Jeweller (6.97 crore shares) were the most active stocks in terms of volume on the NSE. Bazel International, Graviss Hospitality, Natura Hue Chem, Vascon Engineers, and Sacheta Metals were among the 10 stocks that jumped over 10 per cent on the BSE. Out of 4,377 stocks traded on the BSE, 1,919 advanced, while 2,275 declined. Some 183 stocks remained unchanged. As many as 146 stocks, including Usha Martin, Tata Investment Corporation, Supreme Petrochem, RBL Bank, Minda Corporation, and Indian Bank, hit their 52-week highs in intraday trade on the BSE. Five-Star Business Finance, Vedant Fashions, Praj Industries, and Ramkrishna Forgings were among the 166 stocks that hit their 52-week lows on the BSE. According to Shrikant Chouhan, the head of equity research at Kotak Securities, the Nifty formed a bearish candle on daily charts, and on intraday charts, it continues to show a lower top formation, which is largely negative. Chouhan believes that the short-term market outlook is weak, but since it is oversold, a quick pullback rally is a strong possibility. \"For day traders, 24,800 would act as an immediate resistance zone. If the market successfully clears this level, it could bounce back up to 24,900-24,925. On the other side, below 24,600, the selling pressure is likely to accelerate. Below this level, it could retest the levels of 24,500–24,450,\" said Chouhan. Ajit Mishra, SVP of research at Religare Broking, believes oversold positions may now lead to some consolidation in the Nifty. Strong support is around the 24,400–24,500 zone, and resistance is placed at 24,800–25,000. Read all market-related newshere Read more stories byNishant Kumar Disclaimer:This story is for educational purposes only. The views and recommendations expressed are those of individual analysts or broking firms, not Mint. We advise investors to consult with certified experts before making any investment decisions, as market conditions can change rapidly and circumstances may vary. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-nifty-50-extend-losses-to-7th-consecutive-session-10-key-highlights-from-indian-stock-market-today-11759139399450.html",
    "original_url": "https://news.google.com/rss/articles/CBMihgJBVV95cUxNRTRvYWJlWVZwWkd2Umo0bjgtZWswQnc3SWM3OUpnbDRaWnpKVzQ0RlhQZ2VfZU11dlZDOFQtWXdrcUhTcWs4ZTJFOWVOMVBRYW1McC1CblFRX0RJME9NY2VqU0JuLTZpdWcwVjRpaDI5Qnp2d1Y0T25ILUpiWmF0SmFtel9kb3pOY2g3WEh1YjhiaF9DOEFIMzVBUlZST19JVFd0a1lWa3RmTkVKUVJrcWthUC1JYk9ZQmFlQnc5ekFwWWtvWlJnaEhFSDZPeW1LUGkwNWlFR2h1STN5XzFUX2RtcVluYXF3VTNKcU1ES2ZObHlHdTZsdkRpU1JDaG4yUjdfLWRB0gGLAkFVX3lxTE5qdFhBOWVrX1FIeHRfN01GQThIQnVXS0JVR2xVcng3ZUpLRXM0Yk9WUnhqYkllUDJDcDJKVHVNQk4tdW9sUlNkblRIeno0TXgzQnZDc1hkY29TbGVYUExWV2ZjV3Y1MEQwbWdFZ1FzOWFpRDVUTHhpV0Z5MUJsRk9kR01WcDVCVTNsaGNWcVhNUXkwMFc4c3QtQlZmaFp4dnN6cDlvM3VtdEVzaDdVbWVyYkVhS3E0anhieVdiemdpLXVORk5uUUZFMnNvRmw3WUxNM3I3TDgydnlySmhfQW9EWk1qTzFia212RzZVZ0xITWE5VFZ5U1MtbHFycWQ4enB6R2szS3RyNl82OA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4357,
    "word_count": 699,
    "gnews_title": "Sensex, Nifty 50 extend losses to 7th consecutive session— 10 key highlights from Indian stock market today - Mint",
    "published_date": "29/09/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Nifty ends below 25,000, investors lose  ₹3 lakh crore in a day— 10 key highlights from Indian stock market today",
    "body": "Stock market today: The Indian stock market ended with significant losses on Thursday, September 25, for the fifth straight session tracking weak global cues. The Sensex closed the day at 81,159.68, down 555.95 points, or 0.68 per cent, while the Nifty 50 settled at 24,890.85, down 166.05 points, or 0.66 per cent. Broader markets were also down. Nifty MidCap 100 index slipped 0.64 per cent, while Nifty SmallCap 100 index was down 0.57 per cent. Investors lost nearly₹3 lakh crore in a single session as the overall market capitalisation of BSE-listed firms dropped to nearly₹457.4 lakh crore from₹460.5 lakh crore in the previous session. Weak global cues, the dollar's rise, and persisting concerns over valuations, FII selling and Trump's tariffs kept the market down for the fifth consecutive session. \"Indian markets extended its losing streak for a fifth straight session as investors booked profits amid persistent FII outflows and uncertainty over US-India trade talks, which is expected to dent Q2 GDP growth. Broad based selling prevailed in the market with heavy selling across auto, IT, pharma, and healthcare sectors, while metals gained on the back of China’s liquidity support and copper supply concerns. Overall, sentiment remains cautious ahead of India’s H2FY26 borrowing and US macroeconomic data, expected to be released over the end of the week,\" said Vinod Nair, Head of Research, Geojit Investments Limited. As many as 43 stocks ended in the red in the Nifty 50 index. Shares of Trent (down 3.61 per cent), PowerGrid (down 3.10 per cent), and Tata Motors (down 2.64 per cent) ended as the top losers. Shares of BEL (up 2.07 per cent), Hero MotoCorp (up 1.51 per cent), and Hindalco (up 0.80 per cent) ended as the top gainers in the Nifty index. Barring Nifty Metal (up 0.22 per cent), all sectoral indices ended with losses, with Nifty Realty (down 1.65 per cent) ending as the top loser. Nifty IT (down 1.27 per cent), Auto (down 0.92 per cent), Pharma (down 0.92 per cent), and FMCG (down 0.50 per cent) ended with significant losses. Nifty Bank fell 0.26 per cent, while the Financial Services index declined 0.53 per cent. Adani Power (15.77 crore shares), Hind Copper (6.16 crore shares), and Finotex Chemicals (3.66 crore shares) were the most active stocks in terms of volume on the NSE. TVS Electronics, Natural Capsules, Madhav Copper, Chemcon Speciality Chemicals, Max India, and Akme Fintrade India were the 6 stocks that jumped over 10 per cent on the NSE, defying weak market sentiment. On the other hand, Prudential Sugar Corp and Emkay Global Financial Services were the 2 stocks that crashed over 10 per cent on the BSE. Out of 3,135 stocks traded on the NSE, 912 advanced, while 2,124 declined. Some 89 stocks remained unchanged. As many as 53 stocks, including Chemcon Speciality Chemicals, CreditAccess Grameen, Netweb Technologies, and Lumax Industries, hit their 52-week highs in intraday trade on the NSE. Vedant Fashions, TCS, Route Mobile, Praj Industries and United Breweries were among the 77 stocks that hit their 52-week lows on the BSE. \"The Nifty has fallen below the crucial support level of 25,050, which also coincides with the 38.20% Fibonacci retracement of the previous rise from 24,400 to 25,450. Additionally, the index has slipped below the 21 EMA on the daily timeframe, confirming increasing bearish sentiment. It appears that the bulls are stepping back, giving bears more control over the market. On the downside, immediate support is placed at 24,800; a break below this level could trigger a deeper and more serious correction. On the upside, resistance is seen at 25,000,\" said Rupak De, Senior Technical Analyst at LKP Securities. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-ends-below-25-000-investors-lose-rs-3-lakh-crore-in-a-day-10-key-highlights-from-indian-stock-market-today-11758793373720.html",
    "original_url": "https://news.google.com/rss/articles/CBMijwJBVV95cUxQSU5IMDBvQUZnSWhTWWNPd21zSzBZNFF4elJNTUxyeEFUVXhpU3IzQUFkbWZDREdyRGU1bXJTczdLM19QajFfaGhqdzdZSkdmR1cyTzEyYWFyWS1DdGdmNWR1NVVXOENxNV9yWWJnSkxZamwyRTJXSHMxdXBwdFNPcjMzTE85TFI0U2VRVFJvZHhoWmVDNk15THd1V0thUWpmSnNZNkp0dGhQYlhUTmk5XzJRdFZBbmJtaHQ3OU9VQjVSMzhuRTJKaXdEWnJEdC13MGU1UUQwRDJlbHhob3N3b2VmYXdSNHZsbHI4LW5xZ3ducDhOWWs0Q0VMU0FUa1NRczhGX0JvU0EzR3VDZlNz0gGUAkFVX3lxTE9QZUplTUFDdk1EVHFfNVZkZS1vZ2V1NU5obVkzbWRNLVk1dERhQ3FHbWxxRlJoYWVVNjB2Qkx4WExZOTRXNXZrSmJpZGk4VkpMSlVLLWhOYUNScTJUcG9sQVpiSG9aaTBSUmlVdElHQVRtSEgwTUkxdE9QWjVXQk9WT213ejJXMHJXaFQxSWNkSkM4eTMzczJnek9HQ2pGME5mLTMzMm1IY2g1dllXejJpQXRuQUJJbVU5cl9wSkNUamtrb18xNTNZZUs1aHMxUjZlUTBSOVhkMjlkd0lVZ2VnRlNNckJzTFZxUUhvMnQ1VFg2Q2pKNnBtQ0xxTXNYMTZ4MS1BWGNjT05oak55UFZzTWNBRw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4142,
    "word_count": 672,
    "gnews_title": "Nifty ends below 25,000, investors lose ₹3 lakh crore in a day— 10 key highlights from Indian stock market today - Mint",
    "published_date": "25/09/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Sensex, Nifty 50 fall for 3rd consecutive session— 10 key highlights from Indian stock market today",
    "body": "Stock market today:The Indian stock market ended lower on Tuesday, September 23, with frontline indices, the Sensex and the Nifty 50, extending losses to their third consecutive session as concerns over an H-1B visa fee hike and uncertainty over India-US trade talks continued weighing on sentiment. However, expectations of favourable growth-inflation dynamics amid GST reforms, a normal monsoon, and interest rate cuts limited losses for the markets. The Sensex closed at 82,102.10, down 58 points, or 0.07 per cent, while the Nifty 50 settled at 25,169.50, down 33 points, or 0.13 per cent. The mid and small-cap segments underperformed as the BSE Midcap and Smallcap indices fell 0.29 per cent and 0.35 per cent, respectively. The overall market capitalisation of BSE-listed firms stood at below₹464 lakh crore from slightly over₹465 lakh crore in the previous session, making investors poorer by over₹1 lakh crore in a single session. Domestic market sentiment has turned weak due to lingering uncertainty over the India-US trade talks. While both nations remain engaged in reaching a deal, US President Donald Trump's surprise H-1B visa fee hike has raised concerns that a collapse of trade talks could result in more aggressive similar moves from the US administration. \"The Indian stock market witnessed a highly volatile session on Tuesday as a steep hike in H-1B visa fees kept investor sentiment cautious, prompting a flat-to-weak opening. Nifty initially faced selling pressure from the 25,250 zone and slipped to an intraday low of 25,100, where it found strong support. From there, the index staged a sharp recovery to touch the day’s high, reflecting strong buying interest at lower levels,\" Ashika Institutional Equities observed. As many as 31 stocks ended in the red in the Nifty 50 index, Tech Mahindra (down 2.16 per cent), Trent (down 2.11 per cent), and SBI Life Insurance Company (down 2 per cent) being the top losers. Shares of IndusInd Bank (up 2.82 per cent), Axis Bank (up 2.24 per cent), and Bajaj Finance (up 1.93 per cent) ended as the top gainers in the Nifty index. Nifty FMCG, Realty, and IT indices ended as the top losers, falling up to a per cent. On the other hand, Nifty PSU Bank and Metal indices rose by a per cent each. Nifty Bank index rose by 0.41 per cent, while the Financial Services index ended 0.12 per cent higher. \"Sector-wise, autos, metals, and financials gained on signs of robust festive demand post-GST cuts, while FMCG and realty stocks came under pressure from profit booking,\" said Vinod Nair, Head of Research, Geojit Investments Limited. Vodafone Idea (128.6 crore shares), Adani Power (19.25 crore shares), and YES Bank (8.24 crore shares) were the most active stocks in terms of volume on the NSE. Banaras Beads, Emkay Global Financial Services, Brand Concepts, and Risa International were among the 12 stocks that jumped over 15 per cent on the BSE. Out of 4,311 stocks traded on the BSE, 1,797 advanced, while 2,354 declined. Some 160 stocks remained unchanged. Despite weak market sentiment, as many as 173 stocks, including Maruti Suzuki India, Tata Steel, Adani Power, Bajaj Finance, Canara Bank, Eicher Motors, and JSW Steel, hit their 52-week highs in intraday trade on the BSE. SpiceJet, Symphony, Praj Industries, Pidilite Industries, and Crompton Greaves Consumer Electricals were among the 66 stocks that hit their 52-week lows on the BSE. Shrikant Chouhan, the head of equity research at Kotak Securities, believes that the intraday market texture is volatile and non-directional. Hence, he suggests that level-based trading would be the ideal strategy for day traders. On the higher side, a break above 25,250 is likely to maintain bullish momentum. Above this level, the index could move up to 25,350-25,380, said Chouhan. On the flip side, a decline below 25,100 may accelerate further, and the index could slip to 25,000-24,950, Chouhan said. According to Bajaj Broking, the Nifty 50 formed a second consecutive high wave candle with a lower high and lower low in the daily chart. The brokerage firm expects the index to extend the same and trade in the range of 25,500–25,000 in the coming sessions. The immediate support base is at 25,100–24,900, which coincides with the confluence of the 20- and 50-day exponential moving averages (EMA). \"We maintain the overall positive bias and believe the ongoing corrective pullback presents a tactical buying opportunity within the broader uptrend. On the upside, the index faces immediate resistance at the 25,500–25,600 zone,\" said the brokerage firm. Read all market-related newshere Read more stories byNishant Kumar Disclaimer:This story is for educational purposes only. The views and recommendations expressed are those of individual analysts or broking firms, not Mint. We advise investors to consult with certified experts before making any investment decisions, as market conditions can change rapidly and circumstances may vary. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-nifty-50-fall-for-3rd-consecutive-session-10-key-highlights-from-indian-stock-market-today-11758620487042.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxPVWMtcnZob2ptM3lGcU1QUjNZZDBhbTNSREJDUWZNYWc0UVlraHU1Y2h3d21LdUwzVkFZVS1GLWt0aURkOU5pYXQ0T1JxNzNCazBCNkdQX1FJUlZhVmp5TVVhdFU4U2VqemdUMzNoeHZUV3J6Q1RJckdyT3VsZGRIWnV5V2J5cjFFOFFPZGlqdXFpNHpxbE5GUWRTbENoVm9EQm1KYy1WQS1HdWd3ekJOYTBvN0U5Qzd2amQwc0RZY3BsV1ZDaUtWUENRNHh0eWtPdnEySEF6VXlqV1F6d3BnSG53UjNYU1hDZHQza19FcURwb0g4bkp0S2tDa9IBgAJBVV95cUxOdWlnQWpEVUVJcVhEbXh4VVk3UkM0SWZEYmFoSG1CLS1EQXZNOTdiOWNickI5M2RfTVVMeXFZbDNFTUdWQmVaRFozdkhXdVFVX1N0bzBOQlFoWDlybmMydV9iU2dlc29ybW9DYlVoVUpLWmF2c0RNdXoyVkdlOXFtdXBGdUQtMVhmaERiS1cyY2RSd1piWGk2eVlIQ0ZpMlFDM3FQTHpuSjdQNEF2eENhczVpa0ZUSUdyTURJajlBZU85NE9Pck84RjlTUURUWWZBdkdRZ0syT29GVkJUS1BtX2k2YUlONVVsdVZ0aGphbmR0QldDMmcyVFRZTDlGX1F5?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5182,
    "word_count": 828,
    "gnews_title": "Sensex, Nifty 50 fall for 3rd consecutive session— 10 key highlights from Indian stock market today - Mint",
    "published_date": "23/09/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock market today: Nifty50 ends above 24,600; BSE Sensex closes over 550 points up",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 10 popular pet dog breeds that don’t mix well with kids (Parents, take note!) 8 rare wildlife species of Indian deserts How to make herbal hair conditioner to stop hair fall Top zodiacs who are born to build empires Avneet Kaur approved top 10 trendy looks Charming looks of Shruthika Arjun 5 deadlift mistakes to avoid (if you don’t want to wreck your back) Anaswara Rajan’s candid glow 'Lokah' actress Kalyani Priyadarshan’s captivating pictures 7 times it is important to say no to children Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-september-01-2025-dalal-street-indian-equities-global-markets-donald-trump-tariffs/articleshow/123624999.cms",
    "original_url": "https://news.google.com/rss/articles/CBMirwJBVV95cUxOWmNNS1pyNWJ5MC1vUklCTmhMRUt6b21KWjdKZEdjNW1fWF9RUFFqejlxMjVBVWpHOVVXdTQyZW52QzVvblRJdUJCQjZ6UUxfdUl3RTNhNDhZQTMzOV9CejNTb09XOUhxYUlCelJfVXYtZlk1ZDZBS0hTYXVkbGZjeUVlQnNzUTctOWNySmo4MlFqZXlFZFhyY0h6UC04ekpaY3Z6U09MaGJVZTlXM1hERU1EY1Q5OXZuRTZVRXFZeExGYjJhUEVBNnZYdnlTbjdtTWQ0VjJUbER1b1NyM3owdk9KcEh1T0x4RmduTEd3dHRLTENxZVF1Y3M1aHpCTm5zUTRkOVBtZnJYbzNkMXNxZ2RraEJ5S0kwcHVZWWpsSlJLTXB1Q0ZxdlN3bDZrZXPSAbQCQVVfeXFMUFFqeWl6bjExTlVkalhFdzlmS1NrYWlrVU4yUG5Da052T3lFbHBlQU5yeW1HczlaQ3Q5eF9nYWdiLUJra0tyQ0M1YWwtWFY0ejl6Z25UbUNZejRGZGlhc0kyYXJQLXRnakV2Q2xtSm4xdjRMY2xvLUJQekpoLUZBYlRNSjBBaWg5TkNrSFgzUjV5bzJERlVXZDdoMmlfdEhWMUNqTHBVamYydi11YVNUQ2o3MHVnVFJoZlBMbTcxZWh6RFJBM3FQamk1OGVBYjZMR1hMc2F6NnNEajVTWkRzWko0Qy1ZWEY5SWdHVUdFdDMwSmYzRE05TlRXaTVEQkdEVkRjWTJWV2hpWjVELW44SG13WW5nZUhUc2pqZmczU0VIVzVMalhQc2thdEdtZDFtbFgwcWM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1522,
    "word_count": 246,
    "gnews_title": "Stock market today: Nifty50 ends above 24,600; BSE Sensex closes over 550 points up - The Times of India",
    "published_date": "01/09/2025",
    "publisher": "The Times of India",
    "topic": "Indian stock market news"
  }
]