[
  {
    "title": "BSE, NSE to remain closed today on account of Ramnavmi festival",
    "body": "On account of Ramnavmi festival, trading atIndian stock market(both BSE and NSE) will remain suspended today. As per the BSE India official website — bseindia.com, trading in equity segment, equity derivative segment and SLB segment will remain suspended on 21st April 2021 to celebrate Ramnavmi festival. Trading at commodity, currency derivative segment and interest rate derivative segment will also remain suspended today, claimed BSE India website. It is the third stock market holiday falling in April 2021. Earlier Indian share markets were closed on 2nd April and 14th April to commemorate Good Friday and Dr. Baba Saheb Bhim Rao Ambedkar Jayanti respectively. Next stock market holiday is falling on 13th May 2021 for Id-Ul-Fitr. After bleeding heavily on Monday, Indian indices showed some signs of short-covering in the opening bell yesterday but finally ended up in the red zone. The BSE Sensex slide 243 points and closed at 47,705 levels while the 50-stocks Nifty index dipped 63 points and closed at 14,296 levels. Bank Nifty index also went 95 points southward and closed at 31,112 levels. Healthcare index led the Bull Run and scaled 1.22 per cent in the intraday trade session yesterday. Auto and consumer goods also made some recovery on short-covering. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/bse-nse-to-remain-closed-today-on-account-of-ramnavmi-festival-11618914793982.html",
    "original_url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNOEZpZU5hbGUybERLU05FQkF2ODJXNXZXY0NFNk16bTU1VThHZXdBSUVic0lyZXVNRzRCT0VGYnRTVktsN2o3M0hzZHFINkV5Qmtqc1QtN1hLa3ZyWURMdl9fVG1uLUJzYktvM3dSN1BCODFOYWliMHN2ZFBJdEpucXRpYWFpdmI5bjFqbGk2b1h5ay1zcTNNVEQ5bzd1Q29QZ2hXVklGT19aeHhUeERoeUpNVjJVS1NUV08xTTRnU1gzZVNQRHh0SUpaYlHSAdIBQVVfeXFMUGZPMUt6WFIxWnhqZGZjYW5jNEkzSjZkN2poUmFvTko0WnRpQXBWeDUyeEdUbjZNcjhMbGxPUkdvSmgtbjdnMTVVeUVDcTFuWWRYN09jVl9XTklEWndSUmZDMkpSbGhLandxWkVZck5YaUV5eDAzTmFFeEtyaVozUVdKdVBhczgwRWE5aHB4NW1uaks2S2NwdjlNWi1aRmI3eHRVNnM3TlpFY3R0bkEtRFpJOE9FOUtzSXN6eE9DUmtVUzFiNXI4QUtsZjlsZC1EU2ZB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1493,
    "word_count": 236,
    "gnews_title": "BSE, NSE to remain closed today on account of Ramnavmi festival - Mint",
    "published_date": "21/04/2021",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Sensex today falls over 700 points and then recovers all losses",
    "body": "Indian stock markets ended flat in a volatile session, after falling sharply in early trade. Intra-daySensexfell over 700 points when it hit 51,601 at day's low but later ended 21 points higher at 52,344. Similarly, Nifty settled flat at 15,683, after sliding below 15,500 at day's low. The broader markets however ended weak with BSE midcap, smallcap indices falling over 0.7% and 0.9% respectively. The rupee also rebounded today from intra-day losses to settle at 73.86 against US dollar. Avinash Gorakshkar, head of research at Profitmart Securities, attributed the jitteriness in markets to two reasons: Fed changing its stance on interest rate earlier this week and China announcing to use its metal reserves to check metal price rise. Investor also weighed a sharp drop in commodity prices which have been pressured by China's plan to sell reserves and a firm dollar. The Nifty metal index fell nearly 1% today with Vedanta, JSW Steel and SAIL falling over 3% each. \"The market continued to be in the consolidation phase witnessing broad-based selling, taking cues from the Fed policy and mixed global markets. US bond yields have cooled off from its high as global markets seem to have digested the latest Fed comments. China’s plan to sell metal reserves to check recent price hikes has pulled down the sector's sentiments,\" said Vinod Nair, Head of Research at Geojit Financial Services. \"The market is likely to continue in the consolidation phase for a short while, which can be an opportunity for investors to buy on dips,\" he added. ONGC was the top loser in the Sensex pack, shedding around 4%, followed by NTPC, PowerGrid, M&M, Nestle India, SBI and HCL Tech. On the other hand, HUL, Bajaj Auto, Bharti Airtel, Bajaj Finserv were among the gainers. \"Nifty halted a four-week winning streak as it ended the week 0.73% lower. Panic selling has been absorbed well so far in the markets and local investors have taken these sell-offs as an opportunity to add to their positions. Absence of a sharp selloff in global markets is helping keep sentiments steady here. Follow through buying however may be selective and index gains from hereon may be relatively slow. On the upside the Nifty could face resistance at 15750 while 15430 could provide support on downmoves,\" said Deepak Jasani, Head of Retail Research, HDFC Securities. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/why-sensex-is-down-over-700-points-today-and-metal-stocks-are-tumbling-11623994760950.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOXzVGbmgzSklOS0FOaldjWmt4U2FBZE5ubWd2a1ZsT1U2OGJZZDc5djVXcTMwUGRLeWd0a2JqQmZXLXNnZDVYS3djeTFVZjZzRTRGNDd6aEFmaDNLeVZGZWhYbVpYNkpQVlo1aUx0TDFoQkdTb0xkaVM3QzFuZEVJMkhnN3RiQlNMLWlEbXo4Q05iSnJiVjMycWUxMVNuYmphV05QOXVabmNGOGRKZ3M1RktlcDFUU1dDS0gxZnBqbXl0a1g5RTBWamdQWTgweVBGOFQ1bzBhRdIB3AFBVV95cUxNdlVxdWNTZUdrSHpzYjBrN0NfOWhhN1lMNk9NMFFNcmZpN1BYbXVuMkZxcmVsUnVWcDc5Y2ZPQ1NDNnFOcUEyN0laczN1U1FzT2RuM0xzNURGaWRQaGZOQTBJVE1XUC0xNGUxVmdGRG9pZmU1cnhURGxLdHd1b2RTNEFyaUktV3lRT3FKVDVvdWV5NmxNb3ZOTzIxWHg2MHFfb3g2X2dfTDV6aWJKWnFVX2trSzFneExuMjVpVElZRG1LZ3JtRFdEVDMzeDJUcDQ1eEU2bnNJNTZuTHM2?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2561,
    "word_count": 421,
    "gnews_title": "Sensex today falls over 700 points and then recovers all losses - Mint",
    "published_date": "18/06/2021",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Sensex registers biggest one-day fall in 4.5 years, plunges 1,942 points on coronavirus fears, oil price crash",
    "body": "Share/Stock Market Today Live Updates:The benchmark equity indices on the BSE and the National Stock Exchange (NSE) tanked around 5 per cent lower on Monday, registering their biggest one-day fall since August 2015, tracking the weakness in the global markets which tumbled due to rising concerns over the economic impact of coronavirus outbreak and crashing crude oil prices. The S&PBSE Sensexfell 1,941.67 points (5.17 per cent), its worst fall since August 24, 2015, to settle at 35,634.95, its lowest level since February 19, 2019. During the intraday trade, the 30-share benchmark had crashed as much as 2,467.44 points (6.57 per cent) to hit a 15-month low of 35,109.18. Among the stocks on Sensex, shares of oil-to-telecom behemoth Reliance Industries (RIL) declined 13 per cent to end at Rs 1,105 apiece on Monday. The stock had crashed 13.79 per cent to Rs 1,094.95 per share in the intraday trade, its lowest level since August 2019. This apart, state-owned Oil and Natural Gas Corporation (ONGC) too declined 16.55 per cent to settle at Rs 74.40 per share. Earlier in the day, it had slipped 16.99 per cent to Rs 74.00 on the BSE, its lowest level since September 2004. The broaderNifty 50 indexon the NSE ended 538.00 points (4.90 per cent) lower to end the day at 10,451.45, its lowest since November 1, 2018. The 50-share NSE benchmark had slipped as much as 695.00 points (6.32 per cent) to 10,294.45. All the sectoral indices on NSE ended in a sea of red on Monday. The Nifty Metal index was the top laggard of the day, slipping 7.72 per cent dragged by Welspun Corp, Vedanta and NMDC. This apart, the Nifty PSU Bank index too slipped 6.07 per cent weighed by Bank of India, Union Bank of India and Canara Bank. In the broader market, the S&P BSE 500 index settled at 13,668.30, down 687.52 points (4.79 per cent). The index had slipped as much as 853.39 points (5.94 per cent). The S&P BSE MidCap index ended at 13,554.07, down 673.42 points (4.73 per cent), while the S&P BSE SmallCap settled at 12,770.55, down 559.23 points (4.20 per cent). The stock markets have been on a downward spiral since the past two weeks ascoronaviruscases in the country have risen sharply and the ongoing developments in the banking space regardingYes Bankduring the past weekend. The number ofcoronavirus cases in Indiaso far has risen to 43 as on Monday, after four fresh cases werereported from Jammu and Kashmir, NewDelhiand Uttar Pradesh and Kerala, respectively, officials in the health ministry said. No deaths due to the deadly virus have been reported yet. About Yes Bank, the shares of the private sector lender climbed 31.17 per cent to settle at Rs 21.25 on the BSE on Monday. During the day, the stock had surged 40.74 per cent to Rs 22.80 per share as State Bank of India (SBI) announced over the weekend that it will pick a 49 per cent stake in the troubled private lender. SBI shares slid 6.19 per cent to end at Rs 253.70 on the BSE. “Risk of recession increased fuelled by crash in crude oil prices and increasing virus cases outside China. Even though fall in crude oil prices is positive for India in the long term, short term concerns weighed with FII outflow in emerging markets. Coronavirus fear is intensifying and fresh travel bans seems to hurt the global economic sentiments more than feared,” Vinod Nair, Head of Research at Geojit Financial Services said in an aftermarket statement. Going ahead, the equity markets in India will be shut on Tuesday on account of Holi. The rupee breached the 74-mark against the US dollar as it had opened 25 paise lower against the greenback at 74.03 on Monday. During the intraday trade, it further slipped to 74.18 against the US currency, however, it pared some of its losses and was last seen hovering around 74.05-74.06 levels in late afternoon deals. Oil prices lost as much as a third of their value on Monday in their biggest daily rout since the 1991 Gulf War after Saudi Arabia signalled it would hike output to win market share when the coronavirus has already left the market oversupplied. Saudi Arabia slashed its official selling prices and made plans to ramp up crude output next month after Russia balked at making a further steep output cut proposed by the Organisation of Petroleum Exporting Countries to stabilise oil markets. Brent crude futures were down 22 per cent at $37.05 a barrel by 1000 GMT, after early dropping by as much as 31 per cent to $31.02, their lowest since February 12, 2016. US West Texas Intermediate (WTI) crude fell by more than 24 per cent, to $33.20 a barrel, after initially falling 33 per cent to $27.34, also the lowest since February 12, 2016. Global stocks plunged on Monday and prices for crude oil tumbled as much as 33 per cent after Saudi Arabia launched a price war with Russia, sending investors already panicked by the coronavirus fleeing for the safety of bonds and the yen. European markets suffered hefty losses in early trade with London dropping more than 8 per cent, Frankfurt falling more than 7 per cent and Paris almost matching those losses. The pan-regional STOXX 600 tumbled into bear market territory — a drop of more than 20 per cent from recent peaks. The number of people infected with the coronavirus topped 110,000 across the world as the outbreak reached more countries and caused more economic carnage. In Asia, the MSCI’s broadest index of Asia-Pacific shares outside Japan lost 4.4 per cent in its worst day since August 2015, while Shanghai blue chips fell 2.9 per cent. Japan’s Nikkei dropped 5.1 per cent and Australia’s commodity-heavy market closed down 7.3 per cent, its biggest daily fall since the 2008 global financial crisis. (With global markets and crude oil prices inputs from Reuters) Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/sensex-nifty-crash-live-updates-coronavirus-fears-oil-gold-6306233/",
    "original_url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQeEZEODdXbTIzU2xLTnA2c0RvOFJiOGlsVGJGdmlxWHl3ak9UcWJ6bmZDYnJRQk1wOG1iRFZUMGRmSmFydmc1WW93VTFLWEZaQ3RNS0cxNGdLX0hEZzB5WmwzREVjSVJzNG1yV1lfUG04b25qTXBRd1FPVi11RmtHc3pKaExyV25kRWpwS1cxWkpwZldsOU5aNkhBT3ZfYVRCdzBzQmZxemJNU2IxbUp1SFdTUkxpWnhQ0gG_AUFVX3lxTFBaMzFiSC1MUzJ2Vk13cmdZTGJNZmpYXzAtYUtOLW9tOGx1V1RDRm9iQ3Vyd3ZQenRNWm5oTWNQeEx3YldXMkMyb2NXUFBNcUZ1aDhIeWp6aDVlTmk0RV8zVlRIYlVBeTNfakd1bDU3a2hHaWloMmdaT0cyV0hrWldEMm4yQk4zd1R3YTl1NEExRmxId3paQ3Jta0doSGlTZm1vbzFveWFiaUp5UmZfME5sU1JFaE5VV01TU3F0LVFZ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6136,
    "word_count": 1052,
    "gnews_title": "Sensex registers biggest one-day fall in 4.5 years, plunges 1,942 points on coronavirus fears, oil price crash - The Indian Express",
    "published_date": "09/03/2020",
    "publisher": "The Indian Express",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock Market Holiday: BSE, NSE to remain closed today on account of Id-Ul-Fitr",
    "body": "Stock Market Holiday:On account of Id-Ul-Fitr (Ramadan), trading at Indian indices (both BSE and NSE) will remain closed today. According to the official website of BSE — bseindia.com — trading in equity, equity derivative and SLB Segment will remain closed today. Trading at commodities and currency derivative segment will also remain closed today for Id-Ul-Fitra celebrations, claims BSE India website. After Id-Ul-Fitra, next stock market holiday will fall on 21st July 2021 followed by 19th August 2021 for Bakri Id and Muharram respectively. Earlier, in April, stock market was closed thrice on 2nd April 2021, 14 April 2021 and 21st April 2021 on account of Good Friday, Dr. Baba Saheb Ambedkar Jayanti and Ram Navmi respectively. On May 12th, 2021, Indian benchmark equity indices fell for the second consecutive session on the back of negative global cues. Nifty opened gap down, but made an attempt to recover. At 1230Hrs, the previous day’s low proved to be a tough resistance for the Nifty and it began to fall making lower tops and lower bottoms. At close, the Nifty was down 154.30 points or 1.04% at 14696.50. Volumes on the NSE were above the recent averages. Among sectors, PSU Bank index was the main gainer, while Bank, Metal and energy indices were the main losers. Nifty fell on May 12 filling the up gap made on May 07. It closed near the intraday low; Advance decline ratio fell into the negative suggesting nervous profit taking by investors across stocks. Fears of a high April CPI number in the US today evening has dragged global stocks down. However unless the figure is substantially higher than forecast of 3.6%, markets could bounce in the near term. 14611 to 14790 is the band for the Nifty in the near term. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/stock-market-holiday-bse-nse-to-remain-closed-today-on-account-of-idulfitr-11620872545731.html",
    "original_url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNaGVpcEpScjhJdnlmRUwyM0k4Tkg3am8zQTNnZlVPZm9RTWdBdW1fSkNwY2F5RVctejBjdWtWUGs0blJ0ZGxZcXZHUjdTcE85dnlQa0hMMkpSS1lJZmNvdjBmREE5QXFyS1Y0NVF5TVpBbW5DV1hIOUoyVTJBZTFVUVlpZU1GU1BKWnR4bkNfVDE4ZGRWaUJZS2RwdnpKc1ZyR1lPR1ZIdE90UGxIX2dYWXg1dDlTNk1VLTlRajlXSV9iTWtJTE14VUpjYW5uRlY5THU1Zy1qY0MwQ0N50gHiAUFVX3lxTE1rRU1YUXZJRGVxNXBGZXQ2b21BS0lLNk13VWxFandmWC00Z0NtZ3JJMF9nQmhzWWtPcUJEOGVmQ18xZmZFSENSeGlmZmdVMnhBT2RzNU9tY3YyRHVPS3pzMmhPMGVrdmZBeFhheUVBYXFrUGprcUFvSHdFbTV3N3FHZUJIWWdlZEtiV2FoY3cwVVVsMEFmYWhaVVVydW02VGt3RzB0V3hfMlRIMkpING1FbmNKX2gzUnBFTy1aQXNwMloxYnlRWDM0V1N2d3cwRXlFb0VoaThnRC1SMWVfdHBrWkE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1961,
    "word_count": 328,
    "gnews_title": "Stock Market Holiday: BSE, NSE to remain closed today on account of Id-Ul-Fitr - Mint",
    "published_date": "13/05/2021",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Sensex rises 99 points, Nifty settles a tad above 10,800-mark; IT, metals gain, banks dip",
    "body": "The benchmark equity indices on the BSE and National Stock Exchange (NSE) gave up their day’s highs and ended with marginal gains on Monday. The S&PBSE Sensexended at 36,693.69, up 99.36 points (0.27 per cent) while the broader Nifty settled at 10,802.70, up 34.65 points (0.32 per cent). Both the topline indices had opened nearly 1 per cent higher earlier in the day and progressed further during the early morning trade with Sensex rising above the 37,000-mark to hit 37,024.20 and Nifty touching 10,894.05. However, in the afternoon session of trade, the indices pared their gains and briefly turned negative before picking up some steam and ending with minor gains. On the Sensex,Tech Mahindra,HCL Technologies, Reliance Industries (RIL),Bharti Airtel,Infosysand Hindustan Unilever were the top gainers of the day. On the other hand,Bajaj Finance,HDFC Bank, Housing Development Finance Corporation (HDFC), Power Grid, ICICI Bank and State Bank of India (SBI) were the top laggards.(see heatmap below) Among the sectoral indices, theNifty ITindex was the biggest gainer on Monday rising 1.71 per cent led by gains in Tech Mahindra, Larsen & Toubro Infotech and HCL Technologies. TheNifty Metalindex too climbed 1.50 per cent led by Hindalco Industries, Hindustan Zinc and JSW Steel. However, the keyNifty Bankindex ended 1.25 per cent lower weighed by Bank of Baroda, The Federal Bank and HDFC Bank. Here’s how the sectoral indices performed: In the broader market,S&P BSE MidCapindex ended at 13,403.74, up 6.91 points (0.05 per cent), while theS&P BSE SmallCapindex settled at 12,784.19, down 19.59 points (0.15 per cent). “In a volatile day of trade, the market gave up almost all of its early gains, before closing out the day with a positive bias. Financials ended negative while IT and FMCG led the sectoral gains. Markets are hoping for further stimulus measures from the RBI, following expectations of a softening ofinflationrates, which would give RBI room for further rate cuts. Investors are advised to be cautious and to look at stock specific movements with regards to earnings announcements and the commentary,”Vinod Nair, Head of Research at Geojit Financial Services, said in a statement. The rupee settled on a flat note at 75.19 (provisional) against the US dollar on Monday amid high volatility in the domestic equity market. The rupee, which opened at 75.20 against the US dollar, closed at 75.19 against the US dollar, up by just 1 paisa over its previous close. It had settled at 75.20 against the greenback on Friday. During the four-hour trading session, the domestic unit witnessed an intra-day high of 75.08 and a low of 75.21 against the US dollar. World shares were approaching a five-month peak and the dollar slipped on Monday as investors wagered the earnings season would see most companies beat forecasts given expectations had been lowered bycoronaviruslockdowns. The US earnings season kicks off this week with major Wall Street banks JPMorgan, Citigroup and Wells Fargo reporting on Tuesday. It’s expected to be the second-biggest quarterly earnings drop since 1968, according to Refinitiv data. MSCI’s broadest index of Asia-Pacific shares outside Japan added 0.8 per cent as Chinese stocks jumped 2.1 per cent on Monday. Japan’s Nikkei gained 2.2 per cent and South Korea 1.7 per cent. The optimism carried over to Europe, where stocks rose 1 per cent, even as the US on Friday slapped additional duties of 25 per cent on French luxury goods valued at $1.3 billion, in a tit-for-tat response to France’s digital services tax. MSCI’s All-Country World Index was just shy of hitting Feb. 26 highs. E-Mini futures for the S&P 500 ticked 0.5 per cent higher despite record new cases ofCOVID-19in the US over the weekend, a divergence that shows no sign of stopping. – rupee input from PTI, global market input from Reuters Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/bse-sensex-nse-nifty-markets-live-updates-stocks-shares-global-cues-6503066/",
    "original_url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPT2NZRUN3ZEFHSjhrZXVLOXRCRndseV9pbnZ6QURiVUE0MGFIeldEZGg5dFpMOEE3Q0YwSEtHNlNQWExVckxMQy1SZVVXd0xJbVZVVXBkcXRsWVgwRmM1MEF2b3Z0aEZPRnFROUdTcVNaRklwOVhPdUdxNFQwUWtjSWZpMmNJWGozM2RqZ2lYRVpPQ0duQVI3S2VuNjRQeU5PcVN5QTJaREFvekhnMFRVT1R4VzYtX0Q1aXFrTE8wc3BMYmoz0gHLAUFVX3lxTE0tZ21MdXY4R1VDVGVqeE9rcUdRU0F6aWQzejRPSkIwU3dfZm1SWFY5bHRqQVM1Y2RkeGd3MlVDVjBQMXViejgyaVRyNGxoTXFfNWl5aEJYRE5zY2xuYWZjT3p0Q2t2dXpsSHBLRkE3ZExqZ0EySGZ4VDBfYzBzazZMa2NHaDhHV2ktYnRENjJJQl9SYXZFTl9kWGxmTExWWEs1RHhSdmlLWlF2TmVKb0RJdGNkT3hqY0VTbmFXUXVERG1mV2lwcXVoOExz?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4256,
    "word_count": 689,
    "gnews_title": "Sensex rises 99 points, Nifty settles a tad above 10,800-mark; IT, metals gain, banks dip - The Indian Express",
    "published_date": "13/07/2020",
    "publisher": "The Indian Express",
    "topic": "Indian stock market news"
  },
  {
    "title": "Market cap of BSE firms hits a record $3 trillion as stocks rally",
    "body": "India’s stock market capitalization hit $3 trillion on Friday, fuelled by a rally in small and mid-cap stocks on the BSE. This comes even as the BSE Sensex remains 4% below its February peak, pulled down by large-cap stocks that make the benchmark index. In rupee terms, India’s current market value is pegged at₹218.05 trillion, raising investors’ wealth by₹30.01 trillion or $42.01 billion this year, despite pandemic worries and localized curbs affecting sentiments. In May itself, the market cap of BSE companies swelled by₹11.03 trillion or $19.62 billion. After two days of lacklustre trading following weak global equities, markets rallied on Friday, encouraged by easing covid concerns and a strengthening rupee. The Sensex closed 975.62 points or 1.97% higher at 50,540.48, while the Nifty ended 269.25 points or 1.81% higher at 15,175.30. At closing, the BSE had a market capitalization of $2.99 trillion. The only other countries that have a stock market capitalization of more than $3 trillion are the US, China, Hong Kong, Japan, UK, France, and Canada. BSE’s record market capitalization comes at a time when foreign institutional investors (FIIs) have been dumping Indian equities. Since 23 March, FIIs have sold Indian shares worth nearly $2.48 billion. However, domestic institutional investors, including mutual funds and insurance companies, continue to invest, thanks to abundant liquidity and optimism about mid- and small-cap stocks. According to analysts, the Nifty and the Sensex have been consolidating since mid-January, driving liquidity into midcap and small-cap segments. Also, with most large-caps fairly valued, value investors started moving down the market cap pyramid. From their 52-week lows, BSE MidCap has advanced 92%, BSE Smallcap 121% and BSE 500 75%. “As domestic covid cases fell below the three-lakh mark for the fifth day in a row since mid-April, helped by the extended lockdowns by major states, sentiments have turned buoyant. Hopes have accelerated that soon restrictions/curbs would be eased once cases decline further. Visibility on the economic recovery front improved as industrial activities largely continued even during the lockdown, and now, with restrictions likely to ease, consumer demand is expected to make a comeback. Thus, investors are heading more for mid-cap stocks as growing risk appetite, and cheaper valuations of these companies compared to large-cap peers have revived their popularity,” said Siddharth Khemka, head of retail research, Motilal Oswal Financial Services. The March quarter performance of good mid-cap and small-cap companies were also way ahead of Street estimates despite rising input costs, mostly due to higher revenues and various cost control measures. Analysts expect earnings to support the market valuation further while keeping an eye on covid-19 cases and vaccination progress. “India’s valuation premium with respect to MSCI emerging markets has remained stable at 40-45% over the last four months, indicating that the rally has been a global one. The headline valuations for the Nifty Midcap 100 suggest that we are in an acceptable zone that can act as a platform for the broader markets to do better from hereon. Midcaps in a growing market with market leadership and low leverage can be equally attractive investment option as any large-cap,” Tata Mutual Fund said. Meanwhile, the rupee rose for the second straight day to close at a two-month high. The domestic currency closed at 72.84 against the US dollar from its previous close of 73.11. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/in-a-first-market-cap-of-bse-listed-firms-hit-3-trillion-11621591912069.html",
    "original_url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOQzdLMTRFcy1sRmNra3dQSXJmYU8zeWg4NEgwR28zNElsRTVrTFdWYnF0NVRjbXk1RGVZdF9VN0ZUUDZadFR4NEQyWDNiQVNRLUlRd05Lb01wbVl1TDBtVUJaUi1YX3dRSUNQQ19zSEhwUTVEYWVuMmduT1JJUE5zd3g1N2Q4OFRyb0V5TW81R0dGd3h6eWp6WE0zREoxLTdQWlp6WGJUX011LTJBaFpxYnZPMnI5S1RDMWg2VFJDT2wzTEt30gHKAUFVX3lxTFBvd3dabXl4Sjk1bGhsVzgtSlpsZEhOZkktcm9YMTVZMmc3OE5mLUxBZm1OVDdWcWNxaXBkSkV0YmVWWXFYUVFBQTFXT0Y3VEJGM3Y0emkxbzFhUjY5cjU5UUJSZG1RNVhMQnJ2N2o5VDlnUlRDZkxiRk5RSVZBbGhtR29kRDc0aGdoSFBmTHVHMFE0SGw5VzItS0dnMmwwaHhaMHUxdklqajlhX2RuaV9YUVFXSlZmZ0FzTHNZTnhoZmxVMlhlTmpzc1E?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3766,
    "word_count": 582,
    "gnews_title": "Market cap of BSE firms hits a record $3 trillion as stocks rally - Mint",
    "published_date": "21/05/2021",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  }
]