[
  {
    "title": "Stock market crash: Sensex tumbles 700 points; what drove the Indian stock market down today?",
    "body": "Stock market today:A day after clocking a strong gain of nearly 2 per cent, Indian stock market benchmarks—the Sensex and the Nifty 50—suffered significant losses on Friday, January 3, due to profit booking amid the strengthening US dollar. The BSE benchmark Sensex opened at 80,072.99 against its previous close of 79,943.71 and fell 834 points to an intra-day low of 79,109.73. However, the 30-pack index recouped some losses and closed 721 points, or 0.90 per cent, down at 79,223.11. Meanwhile, its NSE counterpart, the Nifty 50 opened at 24,196.40 against its previous close of 24,188.65 and dropped 213 points, or 0.90 per cent, to 23,976 during the session. At close, the index was 184 points, or 0.76 per cent, down at 24,004.75. Mid and small-cap indices outperformed the benchmarks. The BSE Midcap index slipped 0.33 per cent, while the BSE Smallcap index, down 0.02 per cent, closed almost flat. Bank, financial, IT and pharma packs suffered strong losses today. Nifty Bank fell 1.20 per cent, while the Nifty Financial Services index dropped 1.13 per cent. The Nifty Private Bank index declined 0.90 per cent, but the Nifty PSU Bank index rose 0.31 per cent. Nifty IT (down 1.41 per cent), Pharma (down 1.23 per cent) and Healthcare (down 1.16 per cent) lost over a per cent. Experts have highlighted the following five key factors that might be behind the Indian stock market's decline. Take a look: Experts pointed out that profit booking in select heavyweights, including HDFC Bank, ICICI Bank, TCS, Zomato and ITC was the primary reason behind the downturn in the benchmark indices. Investors are booking profits in these stocks as concerns over stretched valuation and weak earnings persist while global uncertainty also weighs on sentiment. As per analysts, investors remain cautious ahead of Q3 earnings and amid anticipation of major policy shifts in the US administration afterDonald Trumptakes charge. They underscored that the market might see occasional gains due to short covering, but a decisive move could only be expected after the December quarter earnings start coming out. “Despite the short recovery in the past two sessions, markets lost the momentum as there is still a lot of pessimism due to slowing growth, higher domestic valuations, foreign fund outflows, and uncertainty over US trade policies post Trump's resumption as the country's president. Hence, markets may see bouts of correction, and investors will continue to maintain caution while keeping an eye on global developments,” said Prashanth Tapse, Senior VP -Research at Mehta Equities. According to Reuters, the dollar was at a two-year high against a basket of currencies amid concerns that the US interest rates will stay higher for a longer period. Significant gain in the dollar index is weighing on sentiment in emerging markets like India. A strong US dollar may accelerate foreign capital outflow from the Indian market. \"With the dollar index at 109.25 and the US 10-year yield at 4.56 per cent, the macro construct is not favourable for sustained FII buying,\" V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, observed. Banking, financial and IT sectors have significant weight in the benchmark index. When they fall, they drag the key indices down. On Friday, the Nifty IT, Nifty Bank and Financial Services indices dropped over 1 per cent each. These sectors are witnessing profit booking even though experts expect theirDecember quarter numbersto improve quarter-on-quarter. Experts expect the market to experiencevolatilityin January ahead of theUS Fed policydecision,Union Budget 2025and the Reserve Bank of India's (RBI) monetary policy. The US Fed's policy meeting is scheduled for January 28-29. Finance MinisterNirmala Sitharamanwill present the Union Budget 2025 on February 1, while the RBI MPC will meet to decide on policy rates on February 5-7. Apart from these, the Trump factor will also keep the market jittery. Donald Trump will assume office onJanuary 20. His policies on tariffs and work visas will be the focus of investors globally. Read all market-related newshere Disclaimer:The views and recommendations above are those of individual analysts, experts, and brokerage firms, not Mint. We advise investors to consult certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/stock-market-crash-sensex-tumbles-nearly-700-points-why-is-the-indian-stock-market-falling-today-11735882054944.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxPSmFNLUt6cmx1VVhBM20xRzVhbUdtRU1PLWdJR0lzdndYOS1yVEZOUHBJbmpKdkVMakplN1Ftai1YRG83cGJ2YWs0RE9kcFBMYXEzbmVZOE01Yi1RUnc1YU9nRHBReWpJeUNnS3RISGNyWG9UM0ZoNWQ3UC1yWXJMaEVNLUtSbVJ1clRFWDgyWFR0Z1pSZEFHUFFxWEdvZFVab0VsYllwS2FBTFotVngyeU5hVktfdHdRcXdTdlBlMmRoV0ppZmVzRk9KSlg2Zzk0VVVHU3dleVJsbllpQmFubDdMNDhYeWdyV3R1YXJaei1BVG1yOFlmTnZn0gH_AUFVX3lxTE5jdmNzbkVSbXh2WTJTSFVibXFIaFhJcUFpUHJKbFFtZmtDQ3ZiS3U2Y2Fma3ZMTEpKbGd5WmFGV0xCdXNCZkdjWjhEVEQ0clp1Q21ZSzE1V0g0NGh4d3puUmxqU25XNjBCcXJUcXRrNHJERWNZdjBuQ2dHaFZyblJ2R1FsSDlIZ2t0ckoySE5fdmotelBKSVpIQ1R4alprWnk5R0pKeklLZWxTWkZNcElEQWlMMnFPdjhmS2xWNFdrZVRhLUxzcWVYZTF5R295ZkNlTWJVdkRPTjdKaFk1cWU2d3puOHJ5akxaNUtWOUgzY3hsWk9sRnVwaXdTWEc3cw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4551,
    "word_count": 716,
    "gnews_title": "Stock market crash: Sensex tumbles 700 points; what drove the Indian stock market down today? - Mint",
    "published_date": "03/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "",
    "body": "03/01/25 | 4:34 pm | Indian stock market | Nifty | Sensex Share Indian stock market declines as cautious sentiment prevails After a strong start to the New Year, the Indian stock market stumbled on Friday, weighed down by losses in key sectors like IT, financial services, and pharmaceuticals. Weak global cues added to investor unease, halting the recent upward momentum. The Sensex dropped 720.60 points, or 0.90%, to close at 79,223.11, while the Nifty ended at 24,004.75, down 183.90 points or 0.76%. The Nifty Bank index fell by 1.20%, finishing at 50,988.8. Midcaps and small caps also faced pressure, with the Nifty Midcap 100 index down 0.30% at 57,931.05 and the Nifty Smallcap 100 index slipping 0.24% to close at 19,033.70. Market analysts attributed the downturn to investor caution amid uncertainties about upcoming earnings and weaker-than-expected economic data. IT, healthcare, pharmaceuticals, and banking stocks were among the hardest hit. Despite broad declines, some sectors showed resilience. PSU Banks, FMCG, Metals, Media, Energy, and Commodities sectors posted gains. Among Sensex stocks, major losers included HDFC Bank, Zomato, Tech Mahindra, TCS, Sun Pharma, ICICI Bank, HCL Tech, and Bharti Airtel. Meanwhile, Tata Motors, Titan, Hindustan Unilever, Maruti Suzuki, NTPC, Nestle India, IndusInd Bank, and Tata Steel emerged as gainers. On the Bombay Stock Exchange (BSE), the market breadth was slightly positive, with 2,115 stocks advancing, 1,871 declining, and 117 remaining unchanged. Foreign Institutional Investors (FIIs) purchased equities worth ₹1,506.75 crore on January 2, while Domestic Institutional Investors (DIIs) bought ₹22.14 crore worth of stocks, indicating continued interest in Indian markets despite the dip. According to Rupak De of LKP Securities, Nifty failed to break above its 50-day exponential moving average, leading to the correction. “On the upside, if Nifty manages to breach the 24,220 mark, it could rise further towards 24,500. Conversely, a fall below 24,000 may pull the index down to 23,700,” he said.",
    "url": "https://ddnews.gov.in/en/indian-stock-market-declines-as-cautious-sentiment-prevails/",
    "original_url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNVDdaU0ZXaGljeFN0X3ZCS3dYNGdHWnY0c1RONGg3UEc3TjFFWUQ3dmxEUjNrWEtpT1RveTNud0c3Z0Y1eG56bGJWUk1hNHpPT1B6YTd0QmlZUFZjYm9Scks1UndvbzlsMnpsa3YtazdpMkNfdWo3OGNWR1hIRGhQNnFPNFg2aDgxQU9XR3JB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2067,
    "word_count": 314,
    "gnews_title": "Indian stock market declines as cautious sentiment prevails - DD News",
    "published_date": "03/01/2025",
    "publisher": "DD News",
    "topic": "Indian stock market news"
  },
  {
    "title": "Sensex soars 1,500 pts; Nifty tops 24,150; What's boosting stock market?",
    "body": "Market rally, Sensex, Nifty surge Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 02 2025 | 12:41 PMIST RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8%",
    "url": "https://www.business-standard.com/markets/news/sensex-rallies-750-pts-nifty-above-23-950-what-s-boosting-rally-125010200312_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPcUdOelVDMjgtaG5yZ185RUdqLXcwVDk2bEtvN1VwQ0hCU2RycHNpX0tON0JtQ0V4ZWNqSlRWSDVFQnJKcktpcjhzUDlCVVhjX2FUSERZVHlUUThsU1VlcWRDdXp1S3RPYTc3VTJkYkMtM1hOTHp2d1FxNElfU0dpNEh3ZnVPNnk0WUVWMnhob05sRFhsLU1PV1BfQ3FBRE1Ud2hKV29UQ0RGdXFudUxfeDNRXzhkc1o4SG5hUlFRZW5LbFAwNHZpTmN30gHPAUFVX3lxTE5NSzJ5c3hWMDJvRlVSLUlXZkc3OG9YMmlzbml3VE5nRjdubjlad0ZrYWxVVy02SnpRcFFSY1dxWWFWeXFVOVlJV016ZU54M1l6MkNqYkpkNFpnazJqaXJLQ1lXZ1VDN2dpQUdUdEFNOU5VQ0pQQV9PN2FtWUxUeWM4V194MmZ4V0FEd1RtWTYtZkI5S3dKemVmdEQwdGdJWTJmOGk3SXNlMHpjRk5HV3o4NFcyQm1RaXRWMHlaSmZ2eGRXSkUzNVlZaUtjTVRudw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 534,
    "word_count": 101,
    "gnews_title": "Sensex soars 1,500 pts; Nifty tops 24,150; What's boosting stock market? - Business Standard",
    "published_date": "02/01/2025",
    "publisher": "Business Standard",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market: Sensex, Nifty 50 rise despite HMPV virus fears. Will the rally sustain?",
    "body": "Indian stock market benchmarks—theSensexand theNifty 50—recorded decent gains on Tuesday, January 7, ending their two-day losing streak. The Sensex closed 234 points, or 0.30 per cent, higher at 78,199.11, while the Nifty 50 ended with a gain of 92 points, or 0.39 per cent, at 23,707.90. The rally was stronger in the mid and small-cap segments as the BSE Midcap index climbed 0.77 per cent and Smallcap index rose 1.74 per cent. The overall market capitalisation of the BSE-listed firms rose to nearly₹442 lakh crore from about₹439 lakh crore, making investors richer by about₹3 lakh crore in a single session. In the last two sessions, the Sensex and the Nifty 50 had fallen over 2 per cent each, primarily because of sustained selling by foreign institutional investors amid a sustained rise in the US bond yields and rising cases of the HMPV virus. Market sentiment received a fresh blow after concerns emerged over the spread of theHMPV virus, reminding the early days of the COVID-19 pandemic. As Mint reported, Indian authorities confirmed the detection of several human metapneumovirus (HMPV) cases on Monday amid growing concern about the respiratory virus. Two cases were reported from Bengaluru in Karnataka, while a third tested positive after being hospitalised in Gujarat. The development comes even as China and other countries battle a major viral fever and pneumonia outbreak. Track Live Updates of HMPV CasesHere While the spread of HMPV cases remains in the focus of investors, the Indian stock market witnessed a relief rally on Tuesday, with the Sensex rising nearly 500 points during the session. The market witnessedbuyingat lower levels as reports of the virus not being as fatal as COVID-19 emerged. The government has clarified that people should take precautions but not be highly worried about the virus, as the infection is a seasonal disease. “Health experts have clarified that HMPV is not a new virus. It was first identified in 2001, and it has been circulating in the entire world for many years. HMPV spreads through the air through respiration. This can affect persons of all age groups. The virus spreads more during the winter and the early spring months,\" Health MinisterJP Naddasaid on Monday. Experts believe the sharp fall of over 1 per cent in the previous session was an overreaction to the HMPV virus cases. \"The 1.6 per cent cut in the Nifty 50 yesterday appears to be an overreaction to the HMPV virus concerns. Clarification by the government that there is no room for undue concern from the virus, which is not new, can facilitate a rebound in the market, led by momentum stocks,\" said V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services. Investors are using the dip to buy fundamentally strong and beaten-down stocks in many segments. Largely positive global cues also influenced sentiment back home. Several major Asian markets saw healthy buying on Tuesday amid reports that the incoming US President-elect,Donald Trump, could adopt a less aggressive tariff stance. On Monday, the Washington Post reported that Trump's aides were exploring tariff plans covering only certain sectors considered critical to national or economic security. Trump, however, later declined this report. At this point, it seems highly unlikely that the market will sustain the rally. Significant uncertainty surrounds how India Inc.'s Q3 earnings will unfold, the trade policies Trump will announce after assuming office on January 20, and the rate at which virus cases will rise. \"It doesn’t look like it will sustain as the global macros are not favourable. Also, if we consider our currency, it is weakening on a daily basis. This is compelling FIIs to reduce their exposure, and we think it will continue at least until America’s President takes the oath. Volatility will remain with a negative bias,\" said Shrikant Chouhan, the head of equity research at Kotak Securities. \"I don't think the market will sustain the current gains. The business updates of some banking heavyweights, such as HDFC Bank and IndusInd Bank, were lower than expectations. This signals the Q3 earnings seasons could come softer. There are also risks of yen-carry trade if Japan's central bank increases interest rates,\" said Prashanth Tapse, Senior Vice President of Research at Mehta Equities. Tapse believes the domestic market will remain volatile in January due to Q3 earnings, the Trump factor and the upcoming Union Budget 2025. The news flow surrounding virus cases will also influence the sentiment of retail investors and HNIs. \"Investors should wait and watch for Q3 earnings. If the December quarter results turn out to be better than that of the last two quarters, investors may consider buying quality stocks at that point,\" said Tapse. The stretched valuation of the Indian stock market remains a concern. Despite the recent correction, experts still believe the market lacks valuation comfort. Any disappointment on the earnings front will make the market fall further. \"While we remain bullish on the Nifty over the next two years, we view the index as fairly priced with a temporary downward bias of approximately 8–10 per cent,\"Anirudh Garg, Partner and Fund Manager at Invasset PMS, told Mint. Read all market-related newshere Disclaimer:The views and recommendations above are those of individual analysts, experts, and brokerage firms, not Mint. We advise investors to consult certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-sensex-nifty-50-rise-despite-hmpv-virus-fears-will-the-rally-sustain-11736228971220.html",
    "original_url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxPTF9qVUlQYWRBX0ttLTRpc2tXWUtiRWZ3Z3dmUGpZb2hrWUU2V0t4Y0E0ZW5waXYwODVnaENZb2hEOVhaVF82ZV9FYV9QR2gzVjh5c2hDOV9zUWJOV3o5bmxaUHhKN0RHaklqOUVjb3BkS2xadHRLaEJZcGxjek1BYW9VcjhtNDNEa2pRZExKby10UmR5RkV4NTRSaE9WMUVRU3ZRcENsalJUTlVmdldJcExZd25xckdtYWw5OXNUcFJMTkU2RlZyaDNPM1RZWnJ2al9FZklPa01YSWhtMHhPTlZTcnYybS1zeVN0dWxoWdIB9AFBVV95cUxPYWU1YjRmU3Q5Z2VMejB0SFlMaUxOSjlndWs4STNlNHVNMGc1UkFfZUlyVk9neTVScnE3VlRZTzhQemR2NU84TFIwMk5VWWJpRENuM1VPYWNLSkMzWFp3OU45SUs4b1dCMmdndUVOYVRnWUgyNmJ5TDUyU01tUDNWekZwalpEVEcyREZ2c1BQeTFERHBaVFVKUjNXVFE0c0FjR3o3akZPdnBPQTRaMmpmeWtEQlBhdTZEcW9wVHVQdEdyRlkzTm9neU8tWXhCZ0Y4UlBuaExrNVBUTGxucVlqakR1UEhWMFhYTnlYZHlPeUVTWHFv?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5709,
    "word_count": 913,
    "gnews_title": "Indian stock market: Sensex, Nifty 50 rise despite HMPV virus fears. Will the rally sustain? - Mint",
    "published_date": "07/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "HMPV virus, Trump inauguration, FII selling: Why Sensex crashed 1400 points",
    "body": "market falling, market crash, bse nse fall Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Jan 06 2025 | 1:31 PM IST RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8%",
    "url": "https://www.business-standard.com/markets/news/market-crash-sensex-tanks-1-200-pts-nifty-below-23-650-reasons-here-125010600444_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPeUpUWXFnX0RUQjE4bEswWkFENXRBMHVPNTR3dEFjcWxndFNEY2pSUi1WbVFsSEE5eVpHSF9DQ1J5SDExRjBLQklnNURKZ2h5bzMxTWVVdld3SmQya3JYMkhhc2dDTWJJUjJVQkM4YVpFNDRSTEVQNU5vaWxvZ2xEU3BrckxTX211ek9vQktPNVk4LVg2YWNPNU4xUFc3cVB3TEpDazIycUV5VDNDZTd4Yk9Ud0JqeHNUdVVDTHVmZkw3d3FHMVhtNXI4WnpnbGfSAdQBQVVfeXFMTWRtS05kX2FSY1JHUWNTemVaSHBhTi1CdnZQYmM1RldVY2cwd0pxWlZVT2hrUGhWcWZSc1EtdUFXbXZYMUV6bHJ3azdnZk55MDNzWmphMjJNWnd3UmphOW52aWVyUGdvaVAwRU5nMFdTWmdnaU05RldmcVVLX08wMXBOZmVPT3FJS05RejF5b0pKRzlHLV9GTDlSYndvTW9HeF9VRGdicV94UjZXSVhPOTUyUXNCQlYzQlpVZVFsaE9tWFJnWE5ibkpxbC1SX3Vna0pMSkE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 544,
    "word_count": 105,
    "gnews_title": "HMPV virus, Trump inauguration, FII selling: Why Sensex crashed 1400 points - Business Standard",
    "published_date": "06/01/2025",
    "publisher": "Business Standard",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock market holiday: Is Indian stock market open or closed on 1 January for New Year 2025?",
    "body": "Stock market holiday: The Indian stock market will remain open for trading today, January 1, New Year Day. The stock exchanges, BSE and NSE are open today and there is no trading holiday declared for the first day of the new year 2025. The Indian stock market, as well as the currency derivatives and commodity derivatives segments, are also open for trading on Wednesday. New Year’s Day, or January 1, is not included in the list of trading holidays in 2025, as per the stock market holiday calendar on NSE. Hence, the stock market timings today will be as usual. The pre-open trading will commence at 9:00 AM and run until 9:15 AM. The regular stock market trading will begin at 9:15 AM and close at 3:30 PM. There were 16 stock market holidays declared by the BSE and the NSE in 2024 Most of the major stock markets around the globe are shut for trading on January 1. In Asia, Japan, China, Taiwan, Hong Kong and South Korea’s stock markets are closed for the New Year holiday. The US stock market will remain closed on New Year’s Day. All European markets will be closed on New Year’s Day and will reopen on January 2. There are 14 stock market holidays in 2025, as per BSE’s holiday calendar. The first stock market holiday of 2025 will be on February 26 on the occasion of Mahashivratri. The January 26 holiday for Republic Day falls on a Sunday. The last holiday for the next year will also be on December 25 for Christmas. The Diwali Muhurat Trading will be conducted on Tuesday, October 21. The NSE and the BSE will notify the trading timings of Muhurat trading later. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/stock-market-holiday-is-indian-stock-market-open-or-closed-on-1-january-for-new-year-2025-11735698046604.html",
    "original_url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxPRWJwRjFBaHZDaDJEb2tka2ZmZ0RYb0RFbnFuRndpWE1LMHNiS3RKVERQd1Job3Fya29kUnVLZXNEa1d3M3BpdzBpUUNyQXFmYVktTi1lY0FDcU1LWlpfcTdxZ05zd3lNU24zS0tpZ19GQjBpMnFnbkppZ3NVemJYSGlUd0R1eHNfOGtKR25kQkk5QWpCVU9PS2gzYTUyTDlqTEtPM2k3RmQ4TlZpcHo2SDFVb2RYekNZMFFMcExjMGZ1WjVEbVYzRnlrSXByRU8tRkFsRnM5WllId1M0WE1KQ3c0cWl6V0ZENW9jMW4xRXnSAfYBQVVfeXFMTzB6aXdIZnhwRXJiYzEyclZtVTRrVW9HR3VQVjZsamtvS2tibjN0NjhZUnhJdmdqZEdEYlZWNXIwYm5hTnJGZlNMalZlQlQ1b255WWVJdjl6eF9FdEdpVS1WenRjU01XemhOSElGeUpQYlU2RlhzYlpxLUpuaFRtenh1a0RJdzBXa1dvMEpCLXZYaThSVHQxRk9haTE3ZUl4Tmg3Z3BiczUyNy1leTVxSG1VY2pPUGc5UUwzU0kyNWlxMjRINGk0VVVUM3dfanNLZ2h1el9fSUlOc2h5a2I3Y21mUlBpYVF4UGZ6eXlBVnd3Yml0cGpR?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1798,
    "word_count": 319,
    "gnews_title": "Stock market holiday: Is Indian stock market open or closed on 1 January for New Year 2025? - Mint",
    "published_date": "01/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  }
]