[
  {
    "title": "Indian stock market: 7 key things that changed for market overnight - Gift Nifty, CPI inflation to HCL Tech Q3 Results",
    "body": "Indian stock market: The domestic equity market indices, Sensex and Nifty 50, are expected to open higher on Tuesday tracking mixed global market cues. Asian markets traded largely higher, while the US stock market ended mixed overnight, with selling seen in tech stocks. On Monday, the Indian stock market crashed amid heavy selloff across sectors led by rising crude oil prices, depreciating rupee and sustained foreign capital outflows. TheSensexcracked 1,048.90 points, or 1.36%, to close at 76,330.01, while the Nifty 50 settled 345.55 points, or 1.47%, lower at 23,085.95. “Wide-spread selling across the sectors fuelled along with massive exits in mid and small-cap stocks further worsened the sentiment. Rising crude oil prices would raise concerns of a spike in domestic inflation, which could further delay any rate cut hopes from the RBI in the near to medium term,” said Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd. Here are key global market cues for Sensex today: Asian markets traded mixed on Tuesday tracking a similar trend overnight on Wall Street. Japan’s Nikkei 225 fell 0.73% and the Topix dropped 0.34%. South Korea’s Kospi rose 0.4%, while the Kosdaq declined 0.62%. Hong Kong’s Hang Seng index futures indicated a higher opening. Gift Nifty was trading around 23,280 level, a premium of nearly 118 points from the Nifty futures’ previous close, indicating a gap-up start for the Indian stock market indices. US stock market ended mixed on Monday, with the benchmark Nasdaq closing lower and S&P 500 bouncing off a two-month low. The Dow Jones Industrial Average rallied 358.67 points, or 0.86%, to 42,297.12, while the S&P 500 rose 9.18 points, or 0.16%, to 5,836.22. The Nasdaq Composite closed 73.53 points, or 0.38%, lower at 19,088.10. Nvidia share price fell 1.97% and Micron Technology stock declined 4.31%. Moderna shares plunged 16.8%, while CVS Health and Humana jumped about 7% each. UnitedHealth Group share price gained 3.93%, while Edison International tumbled more than 11.89%. India’sretail inflationeased to a four-month low in December, driven by moderation in food prices. The Consumer Price Index (CPI)-based retail inflation rose 5.22% in December, down from 5.48% in November and 5.69% a year ago. HCL Technologies reported a net profit of₹4,591 crore in Q3FY25, up by 8.4% QoQ. The IT giant’s revenue inQ3FY25grew 3.6% QoQ to₹29,890 crore, while revenue in USD terms was up 2.6% QoQ at $3,533 million. EBIT increased 8.6% QoQ to₹5,821 crore, while EBIT margin improved by 90 bps to 19.6% from 18.7%, QoQ. HCL Technologiesraised its revenue growth forecast for full year FY25 to 4.5% - 5% in constant currency terms from 3.5% - 5% previously. HCL Tech also declared an interim dividend of₹12 per share and a special dividend of₹6 per share. Strong growth in tax collection from both personal and corporate income helped the Central government to collect₹16.9 trillion indirect tax revenueso far this financial year after adjusting for tax refunds, official data showed. The net direct tax collection growth of 15.9% so far this year exceeds the 12.8% growth rate that finance minister Nirmala Sitharaman had projected in her July budget after the national polls last year. US Treasury 10-year yields touched 14-month highs, while the dollar index hit its highest level in more than two years, Reuters reported. The benchmark 10-year note yield touched a 14-month high of 4.805%. The dollar index, which measures the greenback against a basket of currencies, hit its highest in more than two years at 110.17 earlier in the session. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-7-key-things-that-changed-for-market-overnight-gift-nifty-cpi-inflation-to-hcl-tech-q3-results-11736790154753.html",
    "original_url": "https://news.google.com/rss/articles/CBMikgJBVV95cUxQdnB5MDA1Q3lCcmJQaXc3TDJmaDlNVnFZeTJlOHZQOHFMblFUUjYxVGk0TUVPdkZwOWZXdlRxbkppVkd6SzVXOFlYeVllSldZZVN5UzFOZVp4bHRwRlJjNWxsR1kyOG5XVjVMS0prMU9FR2hrVmZKa0xlaGk4VTZlcllYdEpzNXQ1SFktdmN1LTJjRURpYnpnT01DbTN2a1NFVlgzVVRoUzhmbm1rVzVpYW93d0hESUxzUjRMdEl0TnR1NkQyQVdWQTVqWXZQZjFfV1dnUkZLd3hjUFRkLW95aWJvVlA1YXpUak9OWEJDNnFNT1ZLcmFQZmlDOG1WOG5SMzktM2pIbklfRWlROHI1MERn0gGXAkFVX3lxTE1wZzdKd3FTQWJpeUs0ZHBOVDhTbmY0QU9iLVFYOXRGNFotMGtuaW9XZXgwTzNwNUcwSW5Uc3RnLTBiRG9UVFRuSHZDOFRKbFI1c2g5d1hOV0x4NVRQLXZjNl83MzFtZXVuYjVTYl9ZTFp5WF81OGI4NkVOckRKb3V3T3BOdnloMzFmcEFPRHZGRmUyQzNjbmpyWnM2ZWw0VWVIb2J3V19WdWpXVTFRN3NMQzdiYmpNX1RFRjZNSjZveEJ6MXltMzB3Z28yREk1ZTc0NTRwcnZDYkZOeUtGTjdFQVIzVW53S1ZmVS1aUDlkSDZPUWVLUE43cTZWMG5tNmxhZ3B3MThFZXNlQk44MXJ0MTc4b1AyMA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4054,
    "word_count": 644,
    "gnews_title": "Indian stock market: 7 key things that changed for market overnight - Gift Nifty, CPI inflation to HCL Tech Q3 Results - Mint",
    "published_date": "14/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "",
    "body": "10/01/25 | 4:41 pm Share Indian stock markets decline for third consecutive day; IT sector gains Indian stock markets closed lower for the third consecutive session on Friday, as concerns over President-elect Donald Trump’s potential policies dampened investor sentiment. The Sensex closed at 77,378.91 points, down 241.30 points or 0.31 percent, while the Nifty ended at 23,440.00 points, declining by 86.50 points or 0.37 percent. Both indices recorded a weekly decline of 2 percent. Foreign investor selling and sluggish domestic economic growth added to the downward pressure on markets. Sectoral performance was mostly negative, with Nifty IT being the only sector to post gains, closing 3.44 percent higher. Sectors such as media, PSU banks, and realty were the worst performers. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, remarked that the prevailing uncertainty surrounding potential U.S. policies and continued foreign institutional investor (FII) selling would likely keep the market subdued in the near term. He also noted that the ongoing corporate earnings season would lead to stock-specific movements. The IT sector, buoyed by the performance of Tata Consultancy Services (TCS), stood out amidst the market downturn. TCS reported a 12 percent year-on-year increase in net profit for the October-December quarter, reaching ₹12,444 crore. Revenue from operations rose to ₹63,973 crore, marking a 5.6 percent growth compared to the same period last year. TCS shares rose by 5.6 percent, closing at ₹4,265, contributing to the gains in the Nifty IT index. Vijayakumar added that while banking sector results are expected to be strong, FII outflows may dampen the sector’s performance in the market. According to Shrikant Chouhan, Head of Equity Research at Kotak Securities, Indian markets underperformed compared to most global markets. Chouhan suggested that upcoming inflation data would be a key macroeconomic indicator to watch. The corporate earnings season, which began with TCS’s results, is expected to provide further cues for market participants in the coming weeks.",
    "url": "https://ddnews.gov.in/en/indian-stock-markets-decline-for-third-consecutive-day-it-sector-gains/",
    "original_url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOa01PeF85R0xpd2pmSW84VVJGMDVPRzQ5c1pvc0hfR1F1eVRSaHN4WkthRkhxdHE2M1VSTXl5T0ZIRFhlRjVlVHRIdWNnVkFjdDFrRV9JaEJaOTRXVW80M3V5bko5cmpxazBJR0RFMEFSWE45TTNOSGtRUl9EOC1xY1NoeXR4NDB4MlY2cXFFVVFscnN4YjZHU1NkLTg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2120,
    "word_count": 319,
    "gnews_title": "Indian stock markets decline for third consecutive day; IT sector gains - DD News",
    "published_date": "10/01/2025",
    "publisher": "DD News",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock Market Close Highlights: Sensex sheds 528pts, Nifty at 23,526; IT, financials shares dip",
    "body": "Stock Market LIVE Updates: Technical view Stock Market LIVE Updates: Market expert view Stock Market LIVE Updates: A glance at broader market Stock Market LIVE Updates: Here's a look at Nifty50 gainers and loser at close Stock Market LIVE Updates: Here's a look at Sensex gainers and loser at close Stock Market LIVE Updates: Nifty closes 162.45 pts lower at 23,526.50 Stock Market LIVE Updates: Sensex closes 528.28 pts lower at 77,620.21 Stock Market LIVE Updates: Lenskart prepares for IPO, seeks to raise up to $1 billion from bankers Stock Market LIVE Updates: This SME stock extends rally, up 132% in 6 days; BSE lowers circuit limit Stock Market LIVE Updates: 3 PM market update Stock Market LIVE Updates: Nifty at day's low Stock Market LIVE Updates: Mamata Mach, Sanathan, Unimech at new lows; BSE IPO index down 5% in 1 week Stock Market LIVE Updates: Q3 results preview: Irdai's revised norms to weigh on life insurers' margin Stock Market LIVE Updates: Last Hours! Delta Autocorp IPO closes today; subscription at 128x, GMP 89% Stock Market LIVE Updates: PVR Inox, SAIL, PNB may soon enter F&O ban; SRF, Oil India top movers Stock Market LIVE Updates: SIP inflow at record peak in December Stock Market LIVE Updates: FMCG index gains over 1% in weak market; HUL, Marico, Colgate rally upto 5% Stock Market LIVE Updates: Market check at 1:00 PM Stock Market LIVE Updates: Indobell Insulation IPO allotment today; check status, GMP, listing date Stock Market LIVE Updates: Capital Infra Trust InvIT IPO Day 3; check subscription status, GMP, more Stock Market LIVE Updates: Ashish Kacholia portfolio stock hits record high; zooms 90% in 3 months Stock Market LIVE Updates: Transrail Lighting shares zoom 7% after CRISIL upgrades long term rating Stock Market LIVE Updates: Smallcap stock jumps 13%, hits new high as board considers stock split Stock Market LIVE Updates: Swiggy races 6% as Bernstein initiates with 'Outperform'; sees 29% upside Stock Market LIVE Updates: Nomura downgrades Shree Cement, ACC, Nuvoco, Dalmia Bharat; here's why Stock Market LIVE Updates: Sensex falls to day's low Stock Market LIVE Updates: Has RIL stock survived a major scare? Trade above Rs 1,270 holds the key Stock Market LIVE Updates: Quadrant Future Tek IPO closes today; Subscription rises 49x, GMP zooms 71% Stock Market LIVE Updates: HSBC downgrades Indian Markets to 'Neutral,' slashes Sensex target for 2025 Stock Market LIVE Updates: Quadrant Future Tek IPO closes today; Subscription rises 49x, GMP zooms 71% Stock Market LIVE Updates: Technical view Stock Market LIVE Updates: Market expert view Stock Market LIVE Updates: Broader markets in red Stock Market LIVE Updates: Here's a look at Nifty gainers and loser Stock Market LIVE Updates: Here's a look at Sensex gainers and loser Stock Market LIVE Updates: Nifty opens over 70 pts lower below 23,650 Stock Market LIVE Updates: Sensex opens 200 pts lower below 77,950 Stock Market LIVE Updates: Nifty settles 14 points lower in pre-open Stock Market LIVE Updates: Rupee opens at record low of 85.9/$ Stock Market LIVE Updates: Religare Broking's Ajit Mishra's 2 stocks to buy Stock Market LIVE Updates: Analysts expect TCS Q3 revenue to grow 6% YoY, profit 5% Stock Market LIVE Updates: Markets Today: TCS, IREDA Q3; Fed Dec minutes; Standard Glass IPO allotment Stock Market LIVE Updates: RIL, Bajaj Fin: Ruchit Jain of Motilal Oswal bets on 3 stocks to buy today Stock Market LIVE Updates: Unlisted firms outpace listed peers with faster revenue, earnings growth Stock Market LIVE Updates: AstraZeneca and Merck drugs set to shake up treatment of liver cancer Stock Market LIVE Updates: Gold surges by Rs 10, silver down Rs 100; yellow metal trading at Rs 78,830 Stock Market LIVE Updates: Stocks to Watch, Jan 9, 2025: TCS, TaMo, M&M, Manappuram Finance, LIC, MOIL Stock Market LIVE Updates: India Inc may see modest revenue, earnings growth recovery in Q3FY25 Stock Market LIVE Updates: China's consumer inflation slows further in December Stock Market LIVE Updates: GIFT Nifty signals weak start for India markets Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 09 2025 | 7:50 AMIST Zubeen Garg death case: Festival organiser & manager arrested; what’s going on? RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US",
    "url": "https://www.business-standard.com/markets/news/stock-market-live-updates-jan-9-sensex-today-nifty-today-nse-bse-standard-glass-ipo-allotment-tcs-q3-125010900094_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxPSndkMjBSLUkxS21aVzRWcjhWdDZBa1NYTHpaNnFta1lqdFFFVGZ3cmthaHNwRXR6NG02Sk95cVl5T1dxdjZpNHllU19QZlhteUlRdE1DTnFmTl9vc2d6TU03LTNQdFZLV094cWVxa29ITUtOUlI3b2xNTnZEMGIxVnhQTC10RHROd3FBWkFaR1NNcTlMd2dVbzlJU1pYREZtTXpYXzZsdUdOVk9YYmNvMnRNaHRURDhrTmwxblVuN2JKdWw4MUtKbnJRU2hGcmJqWXpJeVktYVBob09zOWhvd1VIMnpLVlU5RkhZRWtac0dTRHhnV1pxS18zMNIBgAJBVV95cUxNbXNDQ2tKc0RYUGRsa0RVcFdlcUlLSEpfbGlQcER1eDBmbnpfNV9SOVV1UWlEdEs1Zm1pVGR2SHdLNlZZbFhTWFlwQmR5MnlJQVZHU3cxcE0xT3ZWM0VoR1NxdW5SbVl2VXBoVDIzMzNhMDFLYllwVEJuV1R6Y3VUOEFpNVp6bm9LOWh5YUhkX1dIRUZuVzl4Q3JJdTA4Yks3bTBiamJCRmdlbTFINWpXajVmT2FQSEpGUWQ4SlBUR3E2QTY5NkVObUhfSnZrOGFINEU4STAwSnhjcjhmVzhTZXhhalEwcEJXallGMlV1SmxRby1RaENQaVJXbWJqX1Ru?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4571,
    "word_count": 759,
    "gnews_title": "Stock Market Close Highlights: Sensex sheds 528pts, Nifty at 23,526; IT, financials shares dip - Business Standard",
    "published_date": "09/01/2025",
    "publisher": "Business Standard",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market: 8 key things that changed for market over weekend - Gift Nifty, US nonfarm payrolls to oil prices",
    "body": "Indian stock market: The domestic equity market indices, Sensex and Nifty 50 are expected to open lower on Monday following weakness in global markets. Asian markets declined, while the US stock market ended lower last Friday, with Wall Street’s main indexes closing their second consecutive week in the red. The S&P 500 erased its 2025 gains after stronger-than-expected US jobs data reinforced expectations that the US Federal Reserve will likely keep interest rates elevated for longer than traders were betting on. Markets are now pricing in a single Fed rate cut no sooner than June. This week, investors will closely monitor keystock market triggers, including the Q3 results, domestic and global macroeconomic data, trends in US dollar and Treasury yields, flow of foreign funds, crude oil prices and other key global cues. On Friday, the Indian stock market ended lower, extending its losing streak for the third consecutive session. TheSensexdeclined 241.30 points, or 0.31%, to close at 77,378.91, while the Nifty 50 settled 95.00 points, or 0.4%, lower at 23,431.50. “Markets continued its downward trajectory as rupee scaling new lows due to strengthening dollar has further dampened investors’ sentiment. Amid concerns of subdued economic growth and expectations of a slowdown in the quarterly earnings, investors cut their bet on banking and mid & small cap stocks. With expensive valuations of Indian markets at large still a concern, investors would mostly resort to stock specific activities,” said Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd. Here are key global market cues for Sensex today: Asian markets traded lower tracking losses on Wall Street after a strong US jobs report. MSCI’s broadest index of Asia-Pacific shares outside Japan edged down 0.4%. Japanese markets are closed for a holiday. South Korea’s Kospi fell 0.4%, while the Kosdaq dropped 0.3%. Hong Kong’s Hang Seng index futures indicated a lower opening. Gift Nifty was trading around 23,340 level, a discount of nearly 160 points from the Nifty futures’ previous close, indicating a negative start for the Indian stock market today. US stock marketended lower on Friday after an upbeat jobs report stoked fresh inflation fears. The Dow Jones Industrial Average plunged 696.75 points, or 1.63%, to 41,938.45, while the S&P 500 declined 91.21 points, or 1.54%, to 5,827.04. The Nasdaq Composite ended 317.25 points, or 1.63%, lower at 19,161.63. Nvidia shares dropped 3%, while Advanced Micro Devices stock price fell 4.76% and Apple share price declined 2.41%. Constellation Energy stock jumped 25.16%, while Constellation Brands tanked 17.09%. Walgreens Boots Alliance stock price soared 27.55% US job growth unexpectedly accelerated in December. Nonfarm payrolls increased by 256,000 jobs last month, the most since March, the Labor Department’s Bureau of Labor Statistics said. Data for October and November was revised to show 8,000 fewer jobs added than previously reported. Economists polled by Reuters had forecast payrolls advancing by 160,000 jobs, with estimates ranging from 120,000 to 200,000. The US unemployment rate fell to 4.1% in December from 4.2% in November. The jobless rate averaged 4.0% last year compared to 3.6% in 2023. India’s foreign exchange (forex) reserves plunged for the fifth consecutive week to hit a 10-month low of $634.59 billion as of January 3. RBI data showed that theforex kittydeclined by $5.7 billion in the reported week after falling by a cumulative $17.8 billion in the previous three weeks. Forex reserves have fallen by about $70 billion from their all-time high of $704.89 billion in late September 2024. The US dollar index, which measures the greenback against a basket of currencies including the yen and the euro, rose 0.39% to 109.70. It reached as high as 109.97, its highest level since November 2022, Reuters reported. The yield on benchmark US 10-year notes rose 8 basis points to 4.761%. It had reached as high as 4.79%, its highest level since November 2023. Crude oil prices hit the highest in more than four months after fresh US sanctions against Russia’s energy industry. Brent crude oil rallied 2.14% to $81.47 a barrel, after surging almost 4% in the previous session, while the US West Texas Intermediate (WTI) crude futures surged 2.26% to $78.30. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-8-key-things-that-changed-for-market-over-weekend-gift-nifty-us-nonfarm-payrolls-to-oil-prices-11736709086640.html",
    "original_url": "https://news.google.com/rss/articles/CBMikgJBVV95cUxQNU9hZjJ6dGg2ZjdadE9LQmhoMTUtcjVpdV93cFNHd25OZ1VNX3hJV3MybjNZUXhSSlJGc1NUdWFNaVZTTmZnMkx6V1FuZnROTkdhN3h0SGptaURHOHJMUG1MbkdOeDZ0MzllVEgtMkRYSTRNNDhOSVBzUlNNR0VOUnpsVTZ2bWlGc0FZTF9BZndOMGllaEtlRUdIcTZSM1FGaXVmQU94RDV0MXlSSnVMLTlWWkE4NmpURkljSUxyLUk1d2Q4czhUb1ZyVmQ5b2RQNWNLdE9fdE4ycVJvZndRX3JwZF9CNFlDdlFMSjRrR21ONk5EOVR5c28wTFpfSkZkc3lfbTQ0TDdoeTJvQy16NzVB0gGXAkFVX3lxTE5PREFQelBvLVJ6dnNVT0VuMFpXQzFtTmI4TTRFaGpvOWtfbXY4Q3UwN2JBampsWXRBdDRweVdsdnpXSDJfWVZQY2RTNlRIajdVbWo1WTlZbFM3NDVtMXRmWEpvYlJQVDg3MTEtSmoxS2p5YktVWWJoU1V6WUt2RlZ1OVhHc2ZaOXN3ZDVYWFF5NzU5U2cxbVNxZklFQWp6S0RTNW85bGdqR0FYNUVkdk1RbEZHTVE3eDdaWXU3d3lNTEdWYUdsb204eDNDQTlmcDk2VFNUMnQ0bnRlVFg5UlNPLUxSb3RLUU41R2pwVXo5RlN5RWxJRlhhejFxLWE2UkhZRk9uMkxuUzBWTG1iTEh6QnNmNUVLOA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4784,
    "word_count": 753,
    "gnews_title": "Indian stock market: 8 key things that changed for market over weekend - Gift Nifty, US nonfarm payrolls to oil prices - Mint",
    "published_date": "13/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock Market Highlights: Lack of strength limits Nifty’s breakout potential, key support at 23,150. How to trade on Friday",
    "body": "Stock Market Highlights: The negative chart pattern like lower tops and bottoms is still intact in Nifty and further upside bounce with a lack of strength could probably confirm the lower top reversal at the highs. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-16-january-2025/liveblog/117281413.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOOVRXUkUxSWlaUk83c2dQTmxYVUl0OHpkZ0RaZVhIOWtfVEhUZlhwa0UzbGM5c1MyelhSSlo2Z0l6eTBwX1BjWWlMVHV1TWRUcFUzZ1RQNHdRSEthVlc3enNvS3hFMWpzbi1CUXBuX1NySWk0NUVvRFM3Y29qZV96NEd2QWJOdzJKY2l1UzU5eERETmZkX0lMX1ExdXZCODFjck10TTc2VUhHSU8xU0dMSXRVc3VXVW1kWFlveEMwc0tCU1pEbHNnUUdCT3pBUkJxdWQyM282WdIB3AFBVV95cUxOaTBRTHBOVTBsRVR6WlVqTVBvU2lYaDJKaFRLdFN0VEFySzhBWmJIU0V6dlhEUU93ekRLdjZseTBDeWtZSmRzQWdaWHVHZlcwQUllWHJGOG0yU2hQQ1NoUEFyUlhhUHNSRFhkNVBmZl9QbDYzbXBNM3JQdjN5RzAyOEgzR291RHExZDR0OXYzQ3VNLUtkVDR1X1lOZU9Ma2dNUHBUUHhqdlpZcURtc3RHUEY1WkJHVnJjWlYtOHhQci04d25fYkRvbWZMODZhSk5ZOFZlSG1DVk5NZUNS?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 528,
    "word_count": 88,
    "gnews_title": "Stock Market Highlights: Lack of strength limits Nifty’s breakout potential, key support at 23,150. How t... - The Economic Times",
    "published_date": "16/01/2025",
    "publisher": "The Economic Times",
    "topic": "Indian stock market news"
  },
  {
    "title": "",
    "body": "13/01/25 | 4:55 pm | Nifty-Sensex Share Indian Stock Market Plunges Over 1% Amid Mixed Cues The Indian stock market witnessed a sharp downturn on Monday, with both the Sensex and Nifty indexes plummeting over 1% amid a mix of global and domestic pressures. Strong employment data from the United States suggested fewer rate cuts in 2025, adding to concerns about tighter monetary policies. Adding to the challenges, rising crude oil prices, a weakening rupee, and significant foreign capital outflows further dampened investor sentiment. The market sell-off resulted in a staggering loss of approximately ₹12 lakh crore for investors. The Sensex closed at 76,330.01, falling by 1,048.90 points, or 1.36%, while the Nifty ended at 23,085.95, marking a decline of 345.55 points, or 1.47%. Heavy selling pressure was observed across sectors, particularly in real estate, public sector banks, metals, auto, and pharma. Realty stocks took a significant hit, with the sector declining over 6%. Market experts attributed the decline to a ripple effect from global markets, which faced a broad sell-off. The robust US payroll data fueled concerns about prolonged monetary tightening, strengthening the dollar, raising bond yields, and reducing the appeal of emerging markets. Rupak De of LKP Securities noted the growing bearish sentiment, saying, “Bears remained at the helm as the Nifty continued to breach crucial levels. The index slipped below its previous swing low on the daily chart, indicating increasing bearishness. However, it held the 23,000 mark, which remains a key level to watch. If the Nifty sustains above 23,000 over the next few days, it could signal a potential recovery. Conversely, a decisive fall below this level might trigger a deeper correction.” Among the broader indices, the Nifty Bank fell by 692.90 points, or 1.42%, to settle at 48,041.25. The Nifty Midcap 100 plunged 2,195.35 points, or 4.02%, closing at 52,390.4. Meanwhile, the Nifty Smallcap 100 dropped 723.45 points, or 4.10%, to end at 16,922.10. In terms of individual performances, companies like Zomato, Power Grid, Tata Steel, NTPC, Tata Motors, Tech Mahindra, and Sun Pharma were among the major losers in the Sensex pack. However, a few stocks, including Axis Bank, TCS, IndusInd Bank, and Hindustan Unilever Limited, bucked the trend to emerge as the top gainers. Foreign Institutional Investors (FIIs) continued their selling streak for the sixth consecutive trading day, offloading equities worth ₹2,254.68 crore on January 10. In contrast, domestic institutional investors (DIIs) purchased equities worth ₹3,961.92 crore, offering some respite to the market. The mixed cues, coupled with escalating challenges from both global and domestic factors, signal continued volatility in the near term, with market participants closely watching the 23,000 level on the Nifty for further direction. – IANS",
    "url": "https://ddnews.gov.in/en/indian-stock-market-plunges-over-1-amid-mixed-cues/",
    "original_url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNZE1ZX25uZjNUS0JENTU1NEpTUVlUdDE2NmRqZUpYbjNUbzItRzQ0ZkMyTmV2TUt0UUNlQVJXMnBwcmJUeG9ZRE5yQ0NlNlB6cGpuSkg5a3F4VXRPYWVIanlqME95cUs1ZWhtZnVvNUFVLWhpdHVONHlINDNGTXJYZENn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2890,
    "word_count": 446,
    "gnews_title": "Indian Stock Market Plunges Over 1% Amid Mixed Cues - DD News",
    "published_date": "13/01/2025",
    "publisher": "DD News",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market falls in 6 of 9 sessions in January: How should you rejig your portfolio now?",
    "body": "After delivering moderate returns in 2024,Indian marketshave lost 2.3 per cent in January 2025 so far. Today is the fourth straight day of losses for the benchmarks that have fallen in six out of the nine trading sessions so far in January. The losses come amid rising crude oil prices, weakening rupee and massive foreign capital outflows. Sensexfell 1,129 points to the day's low of 76,249.72 whileNiftylost 331 points to hit an intra-day low of 23,100.60. The selloff was sharper in the mid and small-cap segments, a trend that has been observed in 2025 so far. The BSE Midcap and Smallcap indices declined 4 per cent each. \"Market will continue to be under pressure from the many strong headwinds. The blowout jobs data from the US with 2.56 lakh job creations in December against expectations of 1.65 lakhs means the rate cut expectations in 2025 are now down to one. With the unemployment in the US down to 4.1% the economy doesn’t need any stimulus. This good economic news is turning out to be bad news for markets which were discounting many rate cuts this year. For India, the Brent crude rising to $81 is a concern. But the IIP data for November at 5.2 per cent indicates that the economy is recovering from the slowdown in Q2,\" said V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services. “With the US 10-year bond yield above 4.7 per cent, FIIs will continue to sell offering opportunities for long-term investors to buy reasonably priced large-caps. The broader market will continue to be under pressure,” he added. Amid the current bloodbath on Dalal Street, the big question remains: How should investors rejig their portfolios to safeguard against sharp market drawdowns? The consensus among experts is clear: 2025 demands a balanced and diversified portfolio to navigate the challenges ahead. With evolving macroeconomic conditions, experts advise investors to focus on risk management, maintain flexibility in their strategies, and align their investments with growth-oriented and resilient sectors. Apurva Sheth, Head of Market Perspectives & Research, SAMCO Securities observed that while returns appeared decent in absolute terms in 2024, the relative performance—adjusted for volatility—was less attractive for many investor classes. For 2025, Sheth emphasised an investment strategy prioritising capital preservation over aggressive returns. He recommended a balanced portfolio allocation: 50% in large-cap stocks, focusing on private banks, pharmaceuticals, and IT; 25% in debt instruments; and 25% in gold. Trivesh D, COO at Tradejini, also suggested maintaining a diversified portfolio across equities, gold, and fixed-income instruments. This approach minimises risk and enhances return potential, he said. He further noted that high-PE-ratio stocks could be vulnerable to short-term corrections. Trivesh advised booking profits in overvalued segments and holding cash to seize future opportunities in undervalued or growth-oriented sectors. Divam Sharma, Founder and Fund Manager at Green Portfolio PMS, stressed the need for investors to recalibrate their approach in light of uncertainties arising from global economic pressures, government policy shifts, and technological advancements. He highlighted India’s economic resilience, driven by factors such as digital transformation, infrastructure growth, and an expanding middle class. “While large-cap stocks could face global headwinds, mid-cap and small-cap companies in innovative sectors are expected to outperform in 2025,” Sharma said. Making a similar case for investments in mid and small-cap stocks, Anil Rego, Founder and Fund Manager, Right Horizons PMS advised increasing exposure to high-conviction ideas within the small and mid-cap stocks segment, especially in themes with favourable earnings growth outlooks, while being mindful of mounting geopolitical risks and expensive valuations. Rego highlighted that the equity rally over FY20-FY24 was driven by strong corporateearnings, domestic inflows, and a resilient macroeconomic environment. However, entering 2025, corporate earnings growth is expected to moderate due to commodity pressures and diminishing tailwinds. He provided a nuanced market outlook, citing - 1) Fair valuations in large-cap stocks, 2) Stretched valuations in broader markets, and 3) Reasonable valuations in select high-quality small and mid-cap stocks with strong growth potential. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-falls-in-6-of-9-sessions-in-january-how-should-you-rejig-your-portfolio-now-11736761071594.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxQTG1KcnBRUFA3dUN2cEZFU3F4WjhmeU16WWNxaERlSnpLUC0ydnlGUTYyUHYyT3NRU1QzYVpsTDI5NGxwTm5OT1ZMZWUtcXhrNUtmU240S3U2MnBzZm5iUWpfMWNPajh4SVNuZi1kc1Q1NV9pdHNaVWs4WTFEVFNabEwzRm40WVM3NTZZZUhyTDRtTEtTZ1R2dlJvSXN2YlY4NEZ1cjVHdEZEWmMzLWlieXE1OUp0TWdSSWw3elQyLWJDRkw1YVYyVEVNNG9XajJMTDRoeUE2ZXlRSFR6X2FFSkFYLXlOU1VnVW1lSGZ6amFvcDdwUlBYedIB_gFBVV95cUxNSVA0c283anN2U2djUGdDeE15b1Y0STB2S0Nyamx2X2daUTJMWW1tLXdROWFNUC0wbHV3MTRlOW5ic0dIWTV3X1VGV3JCWV9ZNFdPMjRMTzY1VEdRSGMwQ0ZUR2RFMVFmd0NwbHpqeHM4UDBMeDVVVUE3REY1bmJhZER4TFRwWVFGdGJKTlZUdW9MYzdaOWl2V0RObWhaN1NSYzd3WWhIZGdsbkZHQm9VdDFLa0dpa2NfWDc3UnRyTlFUTmo3NlphOXJjLTVMWUJhWjhzNUFPc1YzRkFWYjhZbDVDQU8yYXNtd1FjcWNzN0dWbEk4b1plNU9FYVZZUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4860,
    "word_count": 722,
    "gnews_title": "Indian stock market falls in 6 of 9 sessions in January: How should you rejig your portfolio now? - Mint",
    "published_date": "13/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  }
]