[
  {
    "title": "Stock Market Today: Sensex crashes 844 points, Nifty settles below 17,000-mark on weak global cues",
    "body": "Market Today, Sensex, Nifty Share Prices Updates:The frontline indices on the BSE and National Stock Exchange (NSE) fell for the third consecutive session, ending nearly 1.5 per cent lower on Tuesday triggered by cross-sector selloff tracking weakness in the global market. The S&PBSE Sensexcrashed 843.79 points (1.46 per cent) to end at 57,147.32 while theNifty 50slumped 257.45 points (1.49 per cent) to settle below the 17,000-level mark at 16,983.55. Both the indices had opened around 0.25 per cent lower earlier in the day and traded in a range during the morning session. However, they slumped in the late afternoon deals with the Sensex hitting an intraday low of 57,050.40 and the broader Nifty touching 16,950.30. On the Sensex pack,IndusIndBank,Nestle India,Tata Steel,Tech Mahindra,Infosys, Dr. Reddy’s Laboratories, Titan Company, Reliance Industries (RIL),Maruti SuzukiIndia, Hindustan Unilever (HUL),WiproandHCL Technologieswere the top losers on Tuesday, falling 2.00-3.70 per cent. Only Axis Bank andAsian Paintsmanaged to end around 1 per cent higher. All the sectoral indices on NSE ended lower on Tuesday. Nifty Realty cracked 3.07 per cent, Nifty Metal fell 2.20 per cent, Nifty Media slumped 2.02 per cent and Nifty IT declined 1.99 per cent. In the broader market, the S&P BSE MidCap index fell 406.29 points (1.61 per cent) to close at 24,757.61 while the S&P BSE SmallCap slumped 425.18 points (1.47 per cent) to end at 28,589.23. On NSE, the volatility index or India VIX surged 4.42 per cent to 20.49. “India’s outperformance till date made a case for profit booking for the FIIs today as geopolitical and currency risks came to the forefront. Practically all sectoral indices ended in the red with the Nifty closing below 17,000 on a day when nothing was spared. The broader markets too saw a steep correction in several stocks which have been defying gravity and moving up since the past several weeks,” said S Ranganathan, Head of Research at LKP Securities. Commenting on the market mood, Vinod Nair, Head of Research at Geojit Financial Services said, “Investors are becoming risk-averse due to rising geopolitical turmoil as well as worries about the global economic slump. Investors’ caution ahead of the announcement ofinflationdata prevented a better-than-expected start to IT earnings from improving market mood. However, as compared to global counterparts, domestic selling is not as aggressive since FII selling is primarily absorbed by DIIs.” Asian and European shares were mostly lower Tuesday as losses in the technology sector weighed on global benchmarks. France’s CAC 40 dipped 0.6 per cent to 5,807.12. Germany’s DAX lost 0.7 per cent to 12,183.60. Britain’s FTSE 100 dropped 1.2 per cent to 6,878.65. The future for the Dow industrials was down 0.7 per cent at 29,059.00. The contract for the S&P 500 lost 0.8 per cent to 3,597.00. Taiwan dropped 4.4 per cent after reopening from a holiday in the first trading session since the US imposed new limits on exports of semiconductors and chip-making equipment to China. TMSC, the world’s biggest chipmaker, plunged 8.3 per cent. Japan’s Nikkei 225 declined 2.6 per cent to 26,401.25. South Korea’s Kospi lost 1.8 per cent to 2,192.07. Both markets also were reopening after holidays on Monday. Hong Kong’s Hang Seng dropped 2.2 per cent to 16,830.73. The Shanghai Composite gained 0.2 per cent to 2,979.79, while Australia’s S&P/ASX 200 lost 0.3 per cent to 6,645.00. Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/stock-market-today-october-11-shares-bse-sensex-nse-nifty-q2-results-rupee-global-cues-8201650/",
    "original_url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPaFF1cjBrQkJVWDM4VUxqSUxpUVY1WlY1ZDNNLUc4MnIxWlota1BuV0g2NHpCR2pkcFFOT0RoVVQ2d1AwanhzS001MUxST0ozd0pocFNSVE1GNGl6a2wwWGw1WHJibmlXTC1aMEtaZWM5cGRtUERxcmJGaDRQZjJ5WmZ1ZkZZblVJM0o4VlkxUlNJWmc5MjFOQ0lMV0R0d2w3aVRnWDZTZTJ0a000TUhNbXFqRzZicDg3VFdSMlNqcDZFdmxpRTg4anJMZDBFMDB1YXREYmhsb0ZwMjVFSHfSAeQBQVVfeXFMT3RUUzVfWWotWXZjSEdmOWtJeWhkRWZTbU9Eakg3Ym82NnJlZmNvR3JWVnhKS0dZclo4TjJHX0RDV3ZEVUpCdENIcVRpLVQwY3FUcDNiX0lad1ZLZkRDR1BUTHd1bC1maTQzV2VsMjJoVEhpWUNhQXNRSm9JRkViU01aRFl6MHVORndPZDRTb01jRHJxcmNWTzdKYkhnbHRoNEFyWmczeG44WVhYX2JWcXZfQkxoT29MTEpCVkI4SjRrdnlEaTZHV21QTkVGcHhMZ1dFM1RPRW45ODJuRUhkSnRwQmZJ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3858,
    "word_count": 616,
    "gnews_title": "Stock Market Today: Sensex crashes 844 points, Nifty settles below 17,000-mark on weak global cues - The Indian Express",
    "published_date": "11/10/2022",
    "publisher": "The Indian Express",
    "topic": "Indian stock market news"
  },
  {
    "title": "Is the Indian stock market losing steam?",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Nov 23 2022 | 11:42 AMIST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/podcast/markets/is-the-indian-stock-market-losing-steam-122112300378_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOQ3k3dXJRYUo1X04tLVdpUHgzaGRJY05iOV9EZzByNWFfWUlPMWFLT3BnVzRTMzhOd1g4RG83Y0NZZG1hZXdQTEw0QVRtQldEc3JKQ3p3dFRoNW9oaTlLUENmVVU2Qm96RFpqdUtoeEhqZmZ6Zy1STDFDUlMxLU5RXzNtbW9SRHhJQW5UN0lfdktVeHBJbjNkRTktd0VrZTJNWTF4QXRkb2tfQ3RiWEHSAbMBQVVfeXFMT2hsTWFNLURCVW1VdzJKSHpfZDdDTzN2aWRMbkpVbG9kUGJENDlwR0hhdE1oUDQxOEJBTTUySVlYUFg2d3NVa3Y5bnl3bkdmNmNqYjNtbUlvSHlXeUNxZV94bnZ3dWo5QnVta2ZxLThJNUJIVnNsb1dXX2dBTmoyS0ZicEZqdjZOajhNanp3SlhXb1B6RjltMkJieEpENVlaOWI1N3NGeWdYcFN4ZmVIcVp1QUU?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 490,
    "word_count": 81,
    "gnews_title": "Is the Indian stock market losing steam? - Business Standard",
    "published_date": "23/11/2022",
    "publisher": "Business Standard",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock Market Today: Top 10 things to know before the market opens today",
    "body": "The market is expected to open in the green as trends in the SGX Nifty indicate a positive opening for the broader index in India with a gain of 73 points. The BSE Sensex was down 221 points to 60,286, while the Nifty50 fell 43 points to 17,722 at the close on Tuesday and formed bearish candle on the daily charts with lower-high-lower-low formation, indicating temporary weakness in the market. As per the pivot charts, the key support level for the Nifty is seen at 17,668, followed by 17,630, and 17,570. If the index moves up, the key resistance levels to watch out for are 17,789, followed by 17,826 and 17,887. Stay tuned to Moneycontrol to find out what happens in the currency and equity markets today. We have collated a list of important headlines across news platforms which could impact Indian as well as international markets: US stocks rallied to a convincingly higher close on Tuesday, but trade was choppy as investors digested comments from Federal Reserve Chair Jerome Powell about how long the central bank might need to tame inflation. The Dow Jones Industrial Average rose 265.67 points, or 0.78 percent, to 34,156.69, the S&P 500 gained 52.92 points, or 1.29 percent, to 4,164 and the Nasdaq Composite added 226.34 points, or 1.9 percent, to 12,113.79. Asia-Pacific markets traded mixed on Wednesday, as Federal Reserve Chairman Jerome Powell overnight acknowledged that inflation is declining — a sign the central bank may soon pause its rate hikes. The Nikkei 225 fell 0.34 percent, while the Topix gained 0.12 percent. The Kospi in South Korea rose 0.68 percent. Trends in the SGX Nifty indicate a positive opening for the broader index in India with a gain of 73 points. The Nifty futures were trading around 17,803 levels on the Singaporean exchange. All eyes will be on RBI Governor Shaktikanta Das when he unveils the outcome of the crucial monetary policy review, the last one for this fiscal, and the first one in this calendar year. Most experts feel that the Monetary Policy Committee (MPC) of the Reserve Bank of India (RBI) will hike the key policy rate by 25 basis points, while economists at SBI say that the central bank may hit the pause button, maintaining the current 'withdrawal of accommodation' stance. A host of factors will determine the MPC decision. Oil surges more than 3% as Fed's Powell eases rate hike concerns Oil prices climbed more than 3 percent on Tuesday after the head of the US central bank eased market concerns over interest rate hikes, while recovering demand in China also boosted prices. Brent crude futures were up $2.70, or 3.3 percent, to $83.69 a barrel, while US West Texas Intermediate crude futures rose $3.03, or 4.1 percent, to $77.14 per barrel. Inflation starting to slow but long, 'bumpy' road ahead: Federal Reserve Chair Jerome Powell US inflation is starting to cool but the road ahead will likely be long and bumpy, Federal Reserve Chair Jerome Powell warned Tuesday, adding that stronger-than-expected economic data could bring more rate hikes. The US central bank has in recent months tempered its aggressive campaign to rein in surging inflation, opting for smaller increases to the benchmark lending rate after multiple steep hikes. \"If the data were to continue to come in stronger than we expect, and we were to conclude that we needed to raise rates more... then we would certainly do that,\" Powell said. Moody's says Indian banks' exposures to Adani 'not large enough' The risk to Indian banks due to the rout faced by Adani stocks are \"limited\", Moody's Investor Services said in a report released on February 7. The exposure of country's lenders to the embattled business group is \"not large enough\", it noted. The ratings' agency, however, underlined that risks for banks can increase if Adani \"becomes more reliant on bank loans\". The group's access to funding from international markets can be curtailed \"because of heightened risk perception\", Moody's said, adding that in such a case, domestic banks may become the main source of funding. This, in turn, may result in \"increases in banks' exposures to Adani and greater risks for them\", it noted. Results on February 8 Shree Cement, Adani Power, Adani Wilmar, Cummins India, Escorts Kubota, Dreamfolks Services, Endurance Technologies, Equitas Small Finance Bank, GATI, Gujarat Pipavav Port, Graphite India, HG Infra Engineering, Honeywell Automation India, IRCON International, ITD Cementation India, Minda Corporation, Samvardhana Motherson International, Narayana Hrudayalaya, Oberoi Realty, Piramal Enterprises, Speciality Restaurants, Symphony, Tracxn Technologies, Trent, and Windlas Biotech will be in focus ahead of its quarterly earnings on February 8. Foreign institutional investors (FII) sold shares worth Rs 2,559.96 crore, while domestic institutional investors (DII) purchased shares worth Rs 639.82 crore on February 7, as per provisional data available on the NSE. Stocks under F&O ban on NSE The National Stock Exchange has added Ambuja Cements on its F&O ban list for February 8, but removed Adani Ports from the same list. Securities thus banned under the F&O segment include companies where derivative contracts have crossed 95 percent of the market-wide position limit. With inputs from Reuters and other agencies Discover the latestBusiness News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated! Find the best of Al News in one place, specially curated for you every weekend. Stay on top of the latest tech trends and biggest startup news. You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/stock-market-today-top-10-things-to-know-before-the-market-opens-today-160-10026511.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOcllaV1FOVWQ2bW1ja0UyYkdIWFF5czh4WHloci1VcFZ5Nnd6QmRSSW5VTDdoOTlkTG12c2w3eU1aU3lmSnlpcU9UdGhPMnk3ZUt0cXVxbE5RNXJ1c3pQNF9CVV90Tks1Q285MTVQaGVxY0hSam8wZFZtclRpV0Z4LURaQUpkWERyM2VkNUl0c0FYa085dERKRF91VS04QUpXVW9GcnduQWZydHh5YmkxQ3FPd3NVYVlXUmVqRlhjdTZ6WEN5RTFPRHM4Q3FnYXNVMkJrRmhn0gHbAUFVX3lxTE15cmw0dFRzQ1VCbDdXZ2dfVGsyZUJHNy1qTW40U3VzamQ5NXFldlJTVFdyalhpUlpnTlNGUm5wbnF4QllFMkNvVDFRRGlkdGtySlNCUWtDZ2pWRHRVbUljaUVkM3Z3S2l5T3lwZW5TQkNSajFPYTF0dnctN0dDbUltUlZFdGsxWVZUbG96R3I1dnVtMXVSdllKeVZsQWU5X2JJanRVLTNmU1BLVTVDd0lmR1c2eS1Ca0toc0JmQzlicVpMcmJ0cjNzeThkYU9LelFBVmNPbXVNMmZqcw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5652,
    "word_count": 910,
    "gnews_title": "Stock Market Today: Top 10 things to know before the market opens today - Moneycontrol",
    "published_date": "08/02/2023",
    "publisher": "Moneycontrol",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market closed today for Republic Day",
    "body": "ETMarkets.com The domestic stock markets is closed today on account of Republic Day. There is no action in the equity segment, equity derivative segment and SLB Segment today, according to the list of stock market holidays 2023, available on the official BSE website. Trading in the commodity segment of MCX is also closed. Thereafter in March, there shall be two holidays, one for Holi on March 7 and the other on March 30, 2023 for Ram Navami. Then going ahead in April, stock markets will be closed for three days – April 4 to mark Mahavir Jayanti, April 7 for Good Friday and April 14 for Dr Baba Saheb Ambedkar Jayanti. In May, markets will be closed on May 1 to observe Maharashtra Day. On June 28, there will be a trading holiday for Bakri-Id. Then with no break in July, the markets will observe a holiday on the occasion of Independence Day on August 15. Post that on September 19, markets will be shut for Ganesha Chaturthi. Thereafter in October, there are two holidays– October 2 for Gandhi Jayanti and October 24 for Dussehra. In November, Muhurat Trading will be held on November 12 to celebrate the auspicious Diwali-Laxmi Pujan. Later, on November 14, the markets will be shut for Diwali Balipratipada. Then, on November 27, the markets will be closed to observe Gurunanak Jayanti. The last holiday for the year 2023 will be Christmas on December 25. Also, there are a few holidays that shall fall on Saturday or Sunday for Mahashivratri, Eid-ul-Fitr, Moharram and Diwali. The exchange may alter/change any of the above holidays, for which a separate circular shall be issued in advance, said the BSE website. Nifty during the year so far has declined around 1.2%, while Sensex has also fallen about 1%. Add as a Reliable and Trusted News Source Add Now! ( Originally published on Jan 25, 2023 ) Read More News on share market holiday equity market holiday republic day holiday sensex closed tomorrow sensex closed on republic day share market closed on 26 january bse closed tomorrow nse closed tomorrow mcx (What's moving Sensex and Nifty Track latest market news , stock tips , Budget 2025 , Share Market on Budget 2025 and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today . Top Trending Stocks: SBI Share Price , Axis Bank Share Price , HDFC Bank Share Price , Infosys Share Price , Wipro Share Price , NTPC Share Price ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition How the land of snake charmers is turning into millionaires' hub Retail inflows hold the fort, but can markets do without FIIs? GST 2.0: A Diwali gift that offers big relief, but watch out for the firecrackers A second CAG rap casts shadow over Godrej’s Greater Noida Golf Links project Stock Radar: Breakout from rounding bottom pattern makes Ashok Leyland an attractive buy; check for target & stop loss GST rationalisation: More to it than meets the eye. 14 stocks from different sectors with upside potential of up to 53% 1 2 3 View all Stories",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-indian-stock-market-closed-tomorrow-for-republic-day/articleshow/97304015.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOOWp2U3g1dVlHaEROYm85SnBMYmV0ZUtsem5zRTBnWjF1cHZXMEVibFAzQW1LWTdTMDZMbHZSRXdNUWhmRFRmeTdQeUR3MWduVDhyRjc1TUdwM0xyd0FTU2hmWlVYMnBScW1JSS1jcXRXYXdtQURGLXh2bEs5N1A0Q2hJcWZsNlZTV3poNzN2TWhRajFLLVdhZ09DVWVmMy1ubGlDWGd5TkYyc0Qwc3Z5ZkR5dFNGWENVZG1xMzBwbW50TTBDbjlLRDhuQXXSAdIBQVVfeXFMTTQ3UmpqWlJNZUFHTkRJTUhZaWlQWV8zODN6UklmTEF5ajdRUWtTRklpMTJVTFlqc3VzMUk1TThuejBNaTZpTzdSZnJSd1RoakxJbTZtTDF5R3lSQXJuY2xMVmhtMTRlN0lBaVppYkd5ZWp1d1RvZ25fc2dDRVhic2ZBTXhKQlFZX08tOFFlOGc1dmo0Z3NDTnJ3VjZyNUo4Ym5RZXBoSWp1ZWpEOFJDQTB2ZGNzejdKYkFkSjgxeklSWVFYLUh3d0czdTNSOW14V0x3?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3201,
    "word_count": 553,
    "gnews_title": "Indian stock market closed today for Republic Day - The Economic Times",
    "published_date": "25/01/2023",
    "publisher": "The Economic Times",
    "topic": "Indian stock market news"
  },
  {
    "title": "India Reclaims Spot as World’s Fifth-Largest Stock Market",
    "body": "Markets Facebook X LinkedIn Email Link Gift Facebook X LinkedIn Email Link Gift Gift this article Contact us: Provide news feedback or report an error Confidential tip? Send a tip to our reporters Site feedback: Take our Survey New Window Facebook X LinkedIn Email Link Gift By Chiranjivi Chakraborty May 29, 2023 at 11:08 AM GMT+5:30 Bookmark Save Lock This article is for subscribers only . India has reclaimed its spot as the world’s fifth largest stock market after losing that status to France in January , as foreign investors snap up the Asian nation’s shares. India’s market capitalization stood at $3.3 trillion as of Friday, helped also by a rebound in Adani Group’s stocks after a short seller report earlier in the year sparked a heavy selloff. Meanwhile, France lost more than $100 billion in market value last week as luxury goods makers Bloomberg Terminal such as LVMH Moet Hennessy Louis Vuitton SE and Vivendi SE saw a rout amid fears of a slowdown in China and the US.",
    "url": "https://www.bloomberg.com/news/articles/2023-05-29/record-bound-indian-stocks-reclaim-spot-as-world-s-top-5-market",
    "original_url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxON0pVWjd5VGFUeGhqYUQ5Vkl5TVd6NUs1LVRZMExERFBzbUUyUUk1TVRZN2YtYUVmSVJFeVBoYVpCYlhyRExNVWR2WGNmZ3JvdXlVYS1zOGxCTnJqSkJBaFNBc0xpRGlIeUlmcHI2amNiRGNHQ3Bvd3BKbS01MXhTdWNFVEpQT0xvQnIzdUtNd2I5RW5uWWhlREFYcVN6YVZEVnhoazZ5U0ttemVnMmQxX2tiSV8?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 986,
    "word_count": 170,
    "gnews_title": "Record-Bound Indian Stocks Reclaim Spot in World’s Top 5 Markets - Bloomberg.com",
    "published_date": "28/05/2023",
    "publisher": "Bloomberg.com",
    "topic": "Indian stock market news"
  }
]