[
  {
    "title": "Why is Indian stock market falling? — explained with five reasons",
    "body": "Stock market news:TheIndian stock markethas fallen for five straight sessions. Among the frontline indices, the Nifty 50 index today made an intraday low of 24,210 and lost 590 points in this period. Today, the BSE Sensex made an intraday low of 79,477 and lost 1,866 points in these five sessions. Today, the Bank Nifty index made an intraday low of 50,559 and lost around 2,060 points in these five sessions. According tostock marketexperts, the Indian stock market has been under pressure for the last five sessions as global trends are trading weak. They said that Dalal Street had high expectations from the Union Budget 2024. Still, the Modi 3.0 Government's first budget was just an extension of the interim budget, and there was nothing to cheer the Indian stock market, which was trading at a record high. Apart from this, below-par Q1 results in 2024, FIIs and DIIs selling, and weakglobal marketsentiments are some other reasons that are dragging the Indian stock market these days. 1] Budget 2024:\"There was no surprise in the Budget 2024 as it was a mere extension of the interim budget presented in February. The market was expecting some major announcements that would have boosted the CAPEX expansion plans of the corporate sector. So, the budget is expected to put the companies' earnings under pressure in the entire FY25. This selling in the Indian share market can be attributed to this shortfall in the Indian stock market,\" said Saurabh Jain, Vice President — Research atSMC Global Securities. 2] Q1 results 2024:\"The market is discounting the Union Budget 2024, and the focus is now shifting to the trajectory of corporate earnings growth, which has remained marginally below our expectations so far in 1QFY25,\" said Siddhartha Khemka, Head of Retail Research, Motilal Oswal. 3] Weak global market trends:\"After weak Quarterly numbers from US tech giants Tesla and Alphabet, the US stock market witnessed strong selling pressure, which has trickled down in other global bourses. Asian and European markets are also under pressure due to Gernamy's manufacturing woes. So, weak global cues are also a reason for the fall in the Indian stock market,\" said Avinash Gorakshkar, Head of Research at Profitmart Securities. 4] Trend reversal by anchors:\"To date, DIIs were the anchors of the Indian stock market, but they are also on the selling side these days. So, both FIIs and DIIs are selling their position, which is also a reason for the slide in the Indian stock market,\" said Saurabh Jain of SMC Global Securities. 5] Lowering demand of premium buyers:\"In FY24, we witnessed a rise in premium care and other luxury item sales, but those sales have also decreased in the first quarter of the current fiscal. This means the premium class's purchasing power capacity has decreased after showing some signs of recovery,\" said Saurabh Jain. Disclaimer:The views and recommendations above are those of individual analysts or broking companies, not Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/why-is-indian-stock-market-falling-explained-with-five-reasons-11721887752614.html",
    "original_url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNNWlPaC1XLUdRZzRha2lqa2ZNUXY3Ui1NeEtLanpmelJwQTJPYzFKRU1pUENFTk5uT0NHM29yN3FjT1cwVTdZRVpjc2dvbzhPNF9ZRi1WUUZJel8tRDNYcEYwSHM2SFo4VG5PbDdBbTdpUkNnZldIQzNEazliNUliRW5TUlZ2bWZRX0dvMmdvY1FEdkFzZmtvdHV1OGFkcFcwX2N3aUZyblIyVG5sX29LZlAtdmZkbTJRbHRzVDhnR24tSHI4MjlrMzY1ODTSAdIBQVVfeXFMUE1XeVNKdElmd0JDd2NLT0owemV0aDkwb3hXZEZHMkRwRG01eENKczZpNy1nZW9wOW9wVkhUMXBtek40M0EtUjJ2TnhHbWdHMVhQWGJocGkyTlluRXJjdE1mazFBbjJGcnZoSXFUN2xBdkxaWFI2NUNPcTV1OFFkZUcyUUVHcElZQTQ1S2hveW43UGxWcUQ0b1pjZC1mMllmZ2QzX0cwcGN4R3RfeTFSdzQyQXJDUlFIQlVXZjN1RDJPcXVwd1F0MUt2b3JHWHVpTHpB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3284,
    "word_count": 531,
    "gnews_title": "Why is Indian stock market falling? — explained with five reasons - Mint",
    "published_date": "25/07/2024",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  }
]