[
  {
    "title": "Learning with the Times: How stock markets really work",
    "body": "10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/how-stock-markets-really-work/articleshow/65650654.cms",
    "original_url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNZGxLVWkyZUdkYmtNTGJ3YmMyU0pXYnQzWV9hUENZXzVUR0hvb2p6YWpMYXp2aF9IUkQweUhucXJPZDF5bnprSE9yRjVaM3BpNDVicTQxaEFURUV4SUVKRFZCVzVFcHhrclNTQl9nRUtkS0dGWFJ1WlUwN0ozUUQwd0V0b3VpN2VzZWVVMkZMdEJyRjk5ZFRyOUdzeHZBcUQzTVoxNGFjUHpCRmRPd0g4UWVWTFPSAboBQVVfeXFMT1N4cDhnczhmanFqZDZ4eTB6elhJLTFMOWpPZGZRdTRDVGZjdHI3djVoOHp4bmZHdDJyT3NERWozYkVGVkh2ZlFUekpaLWVKVWVlbjdWcEQxdDZnNF9aU19HUVFjejBieEdsYnFKcHpxR0xHelZLRmNJV0M3bmJWcHhuR1ZPVzlNc3pJb202bUZMcjF2Sm45a1JsRXAzdFBraTh0eFdDdjFZbUh3dUVDYzNGd3hNQlZIVGR3?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2995,
    "word_count": 519,
    "gnews_title": "Learning with the Times: How stock markets really work - The Times of India",
    "published_date": "03/09/2018",
    "publisher": "The Times of India",
    "topic": "Indian stock market news"
  },
  {
    "title": "Insights that shape decisions",
    "body": "India’s high-flying stock market weans off foreign buyers on x (opens in a new window) India’s high-flying stock market weans off foreign buyers on facebook (opens in a new window) India’s high-flying stock market weans off foreign buyers on linkedin (opens in a new window) India’s high-flying stock market weans off foreign buyers on whatsapp (opens in a new window) Save current progress 0% India’s high-flying stock market weans off foreign buyers on x (opens in a new window) India’s high-flying stock market weans off foreign buyers on facebook (opens in a new window) India’s high-flying stock market weans off foreign buyers on linkedin (opens in a new window) India’s high-flying stock market weans off foreign buyers on whatsapp (opens in a new window) Save Simon Mundy in Mumbai and Emma Dunkley in Hong Kong Published Sep 19 2018 5 Print this page Stay informed with free updates Simply sign up to the Currencies myFT Digest -- delivered directly to your inbox. India’s stock market has become accustomed to foreign investors serving as a reliable engine of funds, with a net $59bn of money flowing in over the past six years. But so far this year that trend has reversed, with the market on course for its first year of net foreign outflows since 2011 — contributing to a hefty decline in the value of the rupee as the currency has plumbed to its weakest level versus the US dollar in recent weeks. Yet amid the foreign selling, India’s Nifty 50 stock index has climbed to a succession of record highs this year. Up 7 per cent in the year to date, the market remains near its all-time peak even after a softening in late August. These contrasting movements are the latest sign of the Indian stock market being increasingly driven by domestic investment, while foreign investors have a less powerful role to play, despite their broadly positive view on the country’s economic outlook. For centuries, Indian households have kept their savings overwhelmingly in property and gold. However, growing financial literacy, coupled with reduced fears of inflation, is now driving a surge of domestic money into the stock market. Indian equity mutual funds had net inflows of Rs780bn ($10.7bn) in the first eight months of this year, according to industry trade group AMFI, easily outweighing the net selling of Rs59bn by foreign equity investors. The domestic buying has driven the Indian market’s valuation to unusually high levels, noted Mahesh Nandurkar, Indian equity strategist at CLSA. On a price-to-earnings basis, the Nifty now enjoys a 60 per cent premium to the emerging markets average, he estimated. It is concerned about overheated valuations, rather than India’s economic outlook, that have caused foreign investors to pare their exposure to Indian stocks, said Saurabh Mukherjea, founder of Marcellus Investment Managers. “The role that foreign investors used to play has been taken over by domestic investors,” he said. “And that has pushed valuations to a level where foreign investors don’t feel comfortable.” But foreign selling in India’s debt market has been even larger, with net outflows of Rs443bn in the first eight months of the year amid tightening US monetary policy. That pushed the 10-year government bond yield this week to 8.14 per cent, its highest level since 2014, while sending the rupee to a record low of Rs72.97 to the dollar. The rupee’s slide has prompted foreign equity investors such as Robert Secker, at M&G Investments, to focus more on sectors such as IT services, which benefit because their revenues are mostly earned abroad and their costs are largely domestic. Shares in the largest of these companies, Tata Consultancy Services, have risen 66 per cent alone in the past year, against 11 per cent for the Nifty as a whole. And while the rupee’s slide has depressed foreign investors’ Indian returns in dollar terms, Mr Secker added, the country’s domestically focused economy means it is seen as a relative safe haven at a time when investors are worrying about emerging trade wars. India has its own trade headaches — notably its heavy reliance on imported oil, where rising prices have been a key factor behind the growing current account deficit that has helped sap the rupee’s value. Other metrics look more promising, said Sunny Ng, a fund manager at PineBridge Investments, highlighting the country’s “stellar” economic growth of 8.2 per cent in the second quarter. Some recent policy changes have also boosted sentiment, he added, such as a new bankruptcy code that should help boost credit growth by giving added protections to lenders. Overseas investors turn away from Indian stocks Subtitles unavailable In contrast, Indian regulators recently sparked outrage by announcing rules that barred entities owned by Indian-origin people from acting as foreign portfolio investors. An advisory panel has since advised the regulator to reconsider the move, but no reversal has yet been announced. “Whenever the stock market is roaring, the regulators tend to adopt an attitude that we don’t really need foreigners and their money,” Mr Mukherjea said. But while such heavy-handed interventions may unsettle foreign investors, he added, the soaring valuations driven by domestic inflows were having a more meaningful restraining effect on overseas investment. “Foreign investors face a richly valued market at a time when [other emerging markets] have pulled back 20 per cent,” he said. “So if you’re sitting in London, you’ll be hard pressed to explain to your CEO why you’re pumping money into India.” Reuse this content (opens in new window) Comments Jump to comments section Promoted Content Latest on India Behind the Money podcast 23 min listen The unsustainable boom in India’s Silicon Valley India Business Briefing Pakistan, protests and public opinion: Narendra Modi's terrible year Premium content Artificial intelligence Global AI giants target India’s youth in emerging market push India Business Briefing Nandan Nilekani: AI will transform Indian education and agriculture Premium content News in-depth Indian business & finance India’s polo-playing steel tycoon behind bid for Thyssenkrupp’s steel unit US immigration Trump’s H-1B visa turmoil threatens Indians’ American dream FT News Briefing podcast 11 min listen Oracle’s leadership shake-up India Business Briefing Not quite a death knell: India’s tech sector and Trump’s new H-1B rules Premium content Follow the topics in this article Currencies Add to myFT Asia-Pacific equities Add to myFT Indian business & finance Add to myFT Emerging market investing Add to myFT Equities Add to myFT Comments",
    "url": "https://www.ft.com/content/a51956ae-bb46-11e8-94b2-17176fbf93f5",
    "original_url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1LVDZqbnRXRmVMd2Jyd0wwQm9wN3FCcWV6blA0eGZZWHBkdFJ0RXhfcXpMQV9BWDVfZHpWRkd0bEVnMDVOeEVPNmpNYWJTTUZOT1hKVmVtSlpkMWhvYlVtNWhCdUpTN0FwSUpDTVJ3WlA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6624,
    "word_count": 1064,
    "gnews_title": "India’s high-flying stock market weans off foreign buyers - Financial Times",
    "published_date": "18/09/2018",
    "publisher": "Financial Times",
    "topic": "Indian stock market news"
  }
]