[
  {
    "title": "Indian stock market: 7 key things that changed for market overnight - Gift Nifty, US tech stocks rally to HUL Q3 results",
    "body": "Indian stock market: The domestic equity market indices, Sensex and Nifty 50, are expected to open on a tepid note on Thursday amid cautiousness on mixed global market cues. Asian markets traded mixed, while the US stock market ended higher overnight, with the benchmark S&P 500 hitting an intraday record high. On Wednesday, the Indian stock market ended higher, recovering from the sharp sell-off witnessed in the previous session. TheSensexrallied 566.63 points, or 0.75%, to close at 76,404.99, while the Nifty 50 settled 130.70 points, or 0.57%, higher at 23,155.35. “We expect markets to trade within a broad range in the near term, tracking global cues and quarterly performance of domestic companies,” said Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd. Here are key global market cues for Sensex today: Asian markets traded mixed on Thursday amid a slew of economic data in the region. Japan’s Nikkei 225 gained 0.38%, while the Topix rose 0.25%. South Korea’s Kospi fell 0.21% and the Kosdaq declined 0.13% at the open. Hong Kong’s Hang Seng index futures indicated a higher opening. Gift Nifty was trading around 23,140 level, a discount of nearly 59 points from the Nifty futures’ previous close, indicating a negative start for the Indian stock market indices. US stock market ended higher led by a rally in technology stocks on President Donald Trump’s $500 billion private-sector artificial intelligence infrastructure investment plan. The Dow Jones Industrial Average gained 130.92 points, or 0.30%, to 44,156.73, while the S&P 500 surged 37.13 points, or 0.61%, to 6,086.37. The Nasdaq Composite closed 252.56 points, or 1.28%, higher at 20,009.34. Netflix share price jumped 9.7%, Oracle stock rallied 6.8%, while US traded shares of ARM Holdings spiked 15.9%. Nvidia stock price surged 4.4% and Dell share price gained 3.6%. Procter & Gamble shares advanced 1.9%, while Johnson & Johnson share price fell 1.9%. Ford shares slipped 3.8%. Hindustan Unilever Ltd(HUL) reported a net profit growth of 19% YoY at₹3,001 crore in the third quarter of FY25, largely on account of one-time gain of₹509 crore from the divestment of Pureit business.HUL revenue in Q3FY25rose 1% YoY to₹15,408 crore. EBITDA climbed 0.9% YoY to₹3,570 crore, while EBITDA margin weakened 10 bps to 23.2%. The FMCG major t posted flat underlying volume growth. HUL board approved the demerger of ice cream business Kwality Wall’s into a separate listed entity. The demerged entity will be listed on the BSE and NSE. Japan’s exports rose 2.8% in December from a year earlier, more than a median market forecast for a 2.3% increase and following a 3.8% rise in the previous month. Imports rose 1.8% in December on-year, compared with market forecasts for a 2.6% increase and a decline of 3.8% in November, Reuters reported. As a result, Japan ran a trade surplus of 130.9 billion yen ($836.80 million) in December, compared with the forecast of a deficit of 53 billion yen. For the whole of 2024, Japan logged a trade deficit of 5.3 trillion yen, shrinking from the previous year’s 9.52 trillion yen. The dollar was little changed after earlier dipping to a new two-week low. The dollar index, which measures the greenback against a basket of currencies, rose 0.01% to 108.14, after it dipped early to 107.75, its lowest since January 6. Crude oil prices fell after an industry report pointed to a rise in US crude stockpiles. Brent crude oil fell 0.18% to $78.86 a barrel, while the US West Texas Intermediate (WTI) crude futures dropped 0.16% to $75.32. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-7-key-things-that-changed-for-market-overnight-gift-nifty-us-tech-stocks-rally-to-hul-q3-results-11737571836593.html",
    "original_url": "https://news.google.com/rss/articles/CBMilAJBVV95cUxPbXphdnJtLXhQdHpoVVVPQzBKSW5BVmRKXzFkY2E2OUUtalVfeUNidUVFdnE4dDVMZXpkTDBkRVYyRVJiVDNXN0VEaVF0TGRPV3FoSUhvVk5iRlAySmFpajZQMHR2bXM0ZW9PSk1uQVVUdDFzWFdoQXhtc3NVcDlMbzhZUnc5b3FKUVVPNUoxdFVaTU10bVQ5WGNSakgteG04QkJMUGlucE5fcnNnSGtCMkFFNjcyUS1iQ21yQ05YNzVMcjFlSTdNLTJOVFQ2bEg0dEczbTBtbzRaaVBPZHN5MnRlbHlzQWNwSDM4UTVyTTMwUmtJVXVadkRNYUV3YnF6NWl3d0lFOGtxZGtWSmdSeUJXLXLSAZoCQVVfeXFMTWp6Qm5wVzhvcTh4SzdRNWR3MVJUdUtOWXBZNGtTMEFIYUU3S2hZUEduSGNncEI0ZHdTWFNONUQtZnl4UHYtRXJXQXlDYjlCbG1ibEVFbFBDcmNvQTJ0R2QxNlpabVNkZl9IVGZyOXFIZ09zaVNCc2VqRldqYTl0TWxsNUU2OUZ5TTZRRzJFejBRWUxpbUQwTk1TRG1Ba0FrTl8xcUNsZHh3a0NUcWROa19LQ3daOUZtRHppb1ZqSG1zanpXVmEycGtHTGxFb3hLd0U2UkRpaG9SVWNTNTFycEdOQU1ubzhGWmNsOFFMbnpEYVlEZHdxT2ZyQ3VnU3JMemdBZFFvZk1sSDJyQnRqeGdNRHprVHBrak93?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4051,
    "word_count": 654,
    "gnews_title": "Indian stock market: 7 key things that changed for market overnight - Gift Nifty, US tech stocks rally to HUL Q3 results - Mint",
    "published_date": "23/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Sensex Today Tanks 1,235 Points | Nifty Ends Below 23,100 | 5 Reasons Why Indian Share Market is FallingTue, 21 Jan ClosingPrevious ClosePre-Open10:30 am",
    "body": "Premium Subscribers: Complete your KYC to AvoidService Suspension.Login Here. **Important: We hate spam as much as you do. Check out ourPrivacy PolicyandTerms Of Use.**By submitting your email address, you also sign up for Profit Hunter, a daily newsletter from Equitymaster covering exciting investing ideas and opportunities in India. After starting the day on a negative note, the benchmarks dragged further as the session progressed and ended the day on weak note. Indian equities closed in the negative zone on Tuesday. 42 out of 50 constituent stocks of Nifty50 ended in the negative territory with the losses led by Trent, Adani Ports, NTPC, ICICI Bank, M&M, SBI, Adani Enterprises, and Bharat Electronics. At the closing bell, theBSE Sensexstood lower by 1,235 points (down 1.6%). Meanwhile, theNSE Niftyclosed lower by 299 points (down 1.3%). Apollo Hospital, BPCL and JSW Steel was thetop gainer today. Trent, NTPC and SBI on the other hand, were among thetop losers today. For a comprehensive overview of key players in the financial sector, check outlist of Fin Nifty Companies. TheGIFT Niftyended at 23,120 down by 234 points. For impact of the Bank Nifty companies and comprehensive overview of the index, check out Equitymaster'sBank Nifty Companies list. The BSE Mid Cap and the BSE Small Cap index ended 2% lower. Sectoral indices are trading on negative note with stocks in realty sector, telecom sector and banking sector witnessing selling pressure. Now track the biggest movers of the stock market usingstocks to watch todaysection. This should help you keep updated with the latest developments... The rupee is trading at 86.56 against the US$. Gold prices for the latest contract on MCX are trading 0.5% higher at Rs 78,940 per 10 grams. Meanwhile, silver prices are trading 0.2% higher at Rs 91,650 per 1 kg. Here are five reasons why Indian Markets are falling today. On the very first day in office, Trump made several announcements, including tariffs on Canada and Mexico. Trump has threatened higher tariffs on several countries, including India. His immigration policies could also impact the Indian tech sector. Investors are now focused on this mega-policy event. Finance Minister Nirmala Sitharaman is set to present the Budget on Saturday, 1 February. Expectations are high that the government will announce measures to boost consumption, strengthen the rural sector, and support manufacturing and infrastructure, all while maintaining fiscal prudence. A relentless selloff by foreign portfolio investors (FPIs) amid the strengthening US dollar and rising bond yields is a key factor behind the Indian stock market's downtrend in recent months. Except for 2 January, FPIs have been selling Indian equities every day in January, offloading nearly Rs 510 bn as of 2 January. After weak Q1 and Q2 earnings, the December quarter earnings so far have also been unimpressive, exhibiting mixed trends across sectors. The Indian economy is showing signs of weakness, which has contributed to the cautious sentiment in the market. Speaking of stock markets, research analyst, Tanushree Banerjee highlights that public sector banks are not alien to the concepts of loan write-offs and government bailouts. Time and again the entities have resorted to these. Rather, whenever the credit cycle tightens and non-performing loans (NPAs) spike, the government gets generous about bailing out the big banks. So, the vicious cycle makes a comeback every few years. Will it be different this time? In news from the defence sector,shares of Hindustan Aeronauticsare sharply lower by more than 2% in trade on 21 January, after an unconfirmed report by a defence news website cited a rock block to HAL's deal with General Electric for the F-414 engine, meant for India's Light Combat Aircraft Tejas. Defence Minister Rajnath Singh visited the US in August last year to strengthen and widen defence cooperation, amid issues around timely delivery of GE's F-404 engines. The delays had reportedly been attributed to supply chain disruptions at GE Aerospace back then. Even in the past, there have been unconfirmed reports over delays in the supply of GE engines, threatening to have a cascading effect on the induction of HAL's Light Combat Aircraft Tejas Mk-1A into the Indian Air Force. The timeline of LCA's induction has been revised more than once since the original schedule was announced. Moving on to news from the realty sector,shares of Sunteck Realtyskyrocketed over 10% on 21 January, buoyed by the company's solid earnings performance in the December quarter. The real estate major jumped back into the black with a net profit of Rs 425 million (m), a massive turnaround from a loss of Rs 97 m in the year-ago period. The surge in net profit was also coupled with an over 2.5x jump in revenue to Rs 1,618 m, up from Rs 424 m in the same quarter last fiscal. The operational performance also remained strong, with an EBITDA margin of 29.9%. The company's presales of Rs 635 crore in Q3, up 40% on the year. The growth was driven by the 66% contribution from Uber luxury and the 19% contribution from the premium luxury segments. Sunteck Realty also added the Nepean Sea project-2 with a total gross development value of Rs 24 bn. Shares of the real estate developer have been on a downtrend for the past three months, losing nearly 12% of its value as investors jumped on a profit-booking spree. Moving on, gold prices rose for a second session on Tuesday as the dollar weakened, with markets evaluating the possible consequences of US President Donald Trump's policies in his second term after his inauguration. Spot gold gained 0.6% to US$ 2,724.74 per ounce by 0240 GMT. US gold futures were 0.2% lower at US$ 2,742.50. The dollar was down about 1% after reports suggested any new taxes would be imposed in a \"measured\" way. A weaker dollar makes gold more attractive to foreign buyers. After weeks of global speculation over which duties Trump would impose tariffs on his first day in office, news that Trump would take more time on tariffs drove a relief rally in global stocks and pressured the US dollar. Trump had proposed tariffs of up to 10% on global imports, 60% on Chinese goods, and a 25% import surcharge on Canadian and Mexican products. To know what's moving the Indian stock markets today, check out the most recentshare market updates here. For information on how to pick stocks that have the potential to deliver big returns,download our special report now! View all commentaries|Archives Read the latest Market Commentary Equitymaster requests your view! Post a comment on \"Sensex Today Tanks 1,235 Points | Nifty Ends Below 23,100 | 5 Reasons Why Indian Share Market is Falling\".Click here! Since 1996, Equitymaster has beenthesource for honest and credible opinions on investing in India. With solid research and in-depth analysis Equitymaster is dedicated towards making its readers- smarter, more confident and richer every day. Here's why hundreds of thousands of readers spread across more than 70 countriesTrust Equitymaster. . Any act of copying, reproducing or distributing this newsletter whether wholly or in part, for any purpose without the permission of Equitymaster is strictly prohibited and shall be deemed to be copyright infringement.Equitymaster Research Private Limited (formerly Equitymaster Agora Research Private Limited) (Research Analyst) bearing Registration No. INH000000537 (hereinafter referred as 'Equitymaster') is an independent securities research Company. Equitymaster is not an Investment Adviser. Information herein should be regarded as a resource only and should be used at one's own risk. This is not an offer to sell or solicitation to buy any securities and Equitymaster will not be liable for any losses incurred or investment(s) made or decisions taken/or not taken based on the information provided herein. Information contained herein does not constitute investment advice or a personal recommendation or take into account the particular investment objectives, financial situations, or needs of individual subscribers. Before acting on any recommendation, subscribers should consider whether it is suitable for their particular circumstances and, if necessary, seek an independent professional advice. This is not directed for access or use by anyone in a country, especially, USA, Canada or the European Union countries, where such use or access is unlawful or which may subject Equitymaster or its affiliates to any registration or licensing requirement. All content and information is provided on an 'As Is' basis by Equitymaster. Information herein is believed to be reliable but Equitymaster does not warrant its completeness or accuracy and expressly disclaims all warranties and conditions of any kind, whether express or implied. Equitymaster may hold shares in the company/ies discussed herein. As a condition to accessing Equitymaster content and website, you agree to ourTerms and Conditions of Use, available here. The performance data quoted represents past performance and does not guarantee future results.",
    "url": "https://www.equitymaster.com/indian-share-markets/01/21/2025/Sensex-Today-Tanks-1235-Points--Nifty-Ends-Below-23100--5-Reasons-Why-Indian-Share-Market-is-Falling",
    "original_url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxPaGg0R3dFR1RVLU9rQlNXM1NOXzEtblQ1Z1AtbEw2N2ZwMEFacjRXNU1yMFk0LUZaT2ppWmhqenNoWV9DZ0s1UTJhMTZoM0NEc3BMTV9mbkFIU0JMQ0tBbDhYSTF0d2xUUUppMVdvVmV6dzFHMkdGdWtsbV81dmVUYXRCTWh5eVgtaDRLOERuZjJieUtuTXBiVy1lblNlanRsbTNPMjM1Zi1fblNGZVZfTFNOUVN1WnJHWlhMTFF6RzhkLUVFX2Eta3lVWFY0R0o4RmIzVXRFN1pueFIxSTFjekFrblpPNlBVVTJJLWwwYjRMQVE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 9110,
    "word_count": 1445,
    "gnews_title": "Indian Stock Market News, Equity Market and Sensex Today in India - Equitymaster",
    "published_date": "21/01/2025",
    "publisher": "Equitymaster",
    "topic": "Indian stock market news"
  },
  {
    "title": "Explained: How Union Budget Influences Stock Market",
    "body": "This Article is From Jan 20, 2025 Explained: How Union Budget Influences Stock Market The stock market usually reacts positively when the Budget includes measures aimed at boosting the economy. Read Time: 3 mins Share Twitter WhatsApp Facebook Reddit Email With Union Budget presentation on February 1, the stock markets are set to remain open on Saturday. The Union Budget is one of the most anticipated events in the economic calendar, often leading to significant fluctuations in the stock market. Investors, businesses, and analysts closely scrutinise the Budget proposals to gauge how government policies will affect different sectors of the economy. This year, with Nirmala Sitharaman presenting her eighth consecutive Budget on February 1, the stock markets are set to remain open on Saturday, which is a rare occurrence as markets are typically closed on weekends. As Budget Day approaches, let's explore how it influences the stock market. One of the key expectations from the Budget is that it promotes economic growth. The stock market usually reacts positively when the Budget includes measures aimed at boosting the economy. This could include new initiatives like tax cuts, investments in infrastructure, or incentives for businesses. When the government introduces such reforms, it boosts investor confidence, leading to a rise in stock prices. Putting More Money In People's Hands The stock market also reacts well to measures that increase the amount of money people have to spend. These include tax reductions, direct income transfers, and efforts to control inflation. When people have more disposable income, they spend more, helping businesses grow. Sectors like retail, automobiles, and consumer goods often benefit from such changes, and as a result, their stock prices rise. Changes In Taxation The Budget often introduces changes in taxes, which can have a big effect on the stock market. On one hand, tax cuts for both individuals and businesses increase disposable income and corporate profits. This can encourage more investments and boost stock prices. On the other hand, if taxes are increased, it could lower spending and affect the market negatively. The Budget also affects taxes on profits made from selling stocks or dividends received from companies. Lower taxes on these profits can encourage people to invest more in the stock market, leading to higher stock prices. However, higher taxes on capital gains and dividends could discourage investment, which would negatively affect the stock market. Mutual Funds And Bonds The Budget impacts the market for mutual funds and bonds as well. The government may announce measures that make investing in mutual funds more attractive or change the taxation on bonds. For example, including Indian government bonds in global investment indexes can attract more foreign money, which helps the stock market grow. Fiscal Deficit The fiscal deficit refers to the gap between the government's income and expenditure. A high fiscal deficit usually means the government needs to borrow more money, which can increase inflation and interest rates, affecting businesses negatively. Conversely, a lower fiscal deficit is seen as a sign of sound financial management, which can positively impact the stock market. Previous Budgets Add NDTV As A Trusted Source In the past, certain Budgets have had a big impact on the stock market. For example, in 1991, India's economy was liberalised under the leadership of then-Finance Minister Manmohan Singh, and this Budget set the stage for huge market growth in the following years. Similarly, the 1997 Budget by P Chidambaram, which reduced taxes, was also well-received by the stock market. Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Budget 2025 , Union Budget 2025 , Stock Market",
    "url": "https://www.ndtv.com/india-news/explained-how-union-budget-influences-stock-market-7517036",
    "original_url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPMHhJaU9TZ1AtTTFjRGVMUWZCeVNhNEpVY3pmUXRUcjU5MUtvRTc5ejJCRUNkYURqUnlsT0ZGdEJtRGZOV3Blb2pjOWctMTFjZEYxVEV3YzlqTFBaYTR1TG96RjRRYWVPbHlEdEVFUFhFcU43ZV9rUks2a3VwUHctMkdSY3dqTzQ2UVYtOUs1MmlIaklN0gGcAUFVX3lxTE01TE9tQUlCU21zNExzb3B3NWJ5SWR2aEpmdmZyX2hBWjZYSFNxOTJzcnVkWlV0TjVNR0ZRN2pZZVdEOGR5Z1FYUF9YX2pJVElPSk9pRjRDaVlmVnFjS09VbW1TZkNCLU00SElaVFVfdlE4Umo2Tkoyc3VRUHN2V3hHTkEwR1pqLVg0MlAyQ0wzVS14elFVU29jbUdXRA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3865,
    "word_count": 608,
    "gnews_title": "Explained: How Union Budget Influences Stock Market - NDTV",
    "published_date": "24/01/2025",
    "publisher": "NDTV",
    "topic": "Indian stock market news"
  },
  {
    "title": "What does Donald Trump's second term mean for Indian stock market? EXPLAINED with five crucial points",
    "body": "Trump 2.0:After the stock market crash ahead ofDonald Trump's swearing-in date, Dalal Street and other bourses of the global markets would be anxiously waiting for the economic outlook that the new administration unveils post-inauguration of the 47th US President. Investors would be keen to know the tariff policy of Donald Trump's administration and the road map to contain geopolitical tension, especially in the Russia-Ukraine war and the Middle East region. However,Donald Trump's policyonUS inflationand the uncertainties around the US economy will also be a significant attraction after his re-entry to the White House. According to stock market experts, the market believes the Donald Trump administration will prioritize American interests with tariffs and trade agreements. This may challenge countries like China, Japan, South Korea, and Vietnam. India, Indonesia, Malaysia, and Thailand might benefit if Donald Trump prioritizes these US interests. However, this protectionist policy of the Trump 2.0 administration may dent Asian countries' green initiatives. They said that Trump 2.0 is expected to boost defence tech companies, but export-oriented companies may face challenges caused by the expected tariff war. Here we list out the top five crucial points that investors of the Indian stock market may like to know ahead of Donald Trump's swearing-in date: 1] Dent to green stocks:\"Due to the expected escalation in the tariff war, if Donald Trump sticks with his protectionist policy, Asia's energy transition to renewables could be complicated by Trump's fossil fuel-friendly stance, which may temporarily benefit US-based oil companies like Exxon Mobil but hinder broader green energy efforts,\" said Ross Maxwell, Global Strategy Operations Lead at VT Markets. So, India's solar and other green energy stocks are expected to come under pressure next week. 2] Advantage for defence stocks:\"Asia's economies may face volatility due to Trump's trade wars and tariffs, but some sectors—like tech and defence could thrive. So, Trump 2.0 is expected to fuel buying in defence and tech-enabled defence stocks in the near term,\" said Ross Maxwell of VT Markets. Speaking on the advantages for Indian defence companies, Anshul Jain, Head of Research at Lakshmishree Investment and Securities, said, \"Rather than looking at traditional defence stocks, one should look at buying tech-enabled defence stocks like drone and aerospace stocks.\" 3] Pressure for export-oriented companies:Expecting pressure for export-oriented segments, Anshul Jain said, \"Donald Trump's protectionist tariff policy is expected to pose a challenge for export-oriented segments like textile, IT, etc. However, one should avoid taking any fresh position in large-cap IT and other export-oriented companies.\" 4] Advantage for fintech stocks:\"Donald Trump's stricter immigration policy may lead to more tech talent staying in Asia, boosting regional innovation hubs in countries like India, Singapore, and South Korea. This shift may also benefit fintech companies,\" said Ross Maxwell of VT Markets. So, one is advised to remain vigilant about the fintech stocks when the market re-opens on Monday next week. 5] Advantages for infra rail stocks:\"In the wake of Donald Trump's decoupling with China, companies will likely shift from China to India, Vietnam and Indonesia. India could see accelerated growth as a growing manufacturing hub if trade barriers with China persist. So, this will likely create demand for infrastructure, transportation, and logistics, especially rail logistics. So, infra and railway stocks are expected to remain under the bulls' radar in the near term,\" said Anhsul Jain of Lakshmishree Investment and Securities. Disclaimer:The views and recommendations above are those of individual analysts, experts, and brokerage firms, not Mint. We advise investors to consult certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/what-does-donald-trumps-second-term-mean-for-indian-stock-market-explained-with-five-crucial-points-11737170696857.html",
    "original_url": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxNQ2dXdmc2QUI3dWZYLUp4a1lSNDZKRTJVY2ZVVDZONHQxeGJJcVc5ZEYzTXBHRXB2NzBYNXdZMGhkc0h0Skk3QlZnVVdTMG9hZnktR0hrVFNYVzRSWERpdzBoT04yNm1NWTBIdHdRRzQ3OHhRdFlIdHdFY2paX3dyS29YQml0bVRUTkswLWpmVkdhSkFQRjJlZ295YTdJOTg1aV85a3FpSFAzNkN6eDZvSUJNTDFwSXJQNng2YWt1eGhTLXhIZXlpUWd3dXBpWWk3VDJleE9aRUJ1bTNXemJsTUtJUDZJNFRwZ0xXQjNaMW1oTm5lejF4c2w0OUhyQdIBgwJBVV95cUxNMThpT2dhUGtpeGhJX0prSzI1eHJteEx0QW1jY2F6MXJ6al9SRkkzMkxnbWh1S0Y3Zzl0Zkd3ZTlfXzgweDNOc0xSaEtZdHAxVTRIUlBMeGtmOE9jTVMyTVkxbzNnM2dCbzNjRmMzU0NmLW5EdzhxWFo1dWRmRHd3ZS02dlJUdXFIV0xfQ1lEaHV6aE5PRzJjaTRoTFNzOXFhRjdvX0puN0oyaDMzLW9oU0pXaU1YSmtvZDR4UlBzUGkxLWx3SjFvQXExdi1mM2dzckxPQlZTRGxDd2JtOVJMSUVINmJtT0MzTnJBTi1EVFVJNE8xSXpSQkMxWmVxQjZHNE9j?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4155,
    "word_count": 615,
    "gnews_title": "What does Donald Trump's second term mean for Indian stock market? EXPLAINED with five crucial points - Mint",
    "published_date": "18/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Union Budget 2025: Will Stock Markets Open On February 1?",
    "body": "This Article is From Jan 20, 2025 Union Budget 2025: Will Stock Markets Open On February 1? Typically closed on weekends, stock markets occasionally operate on Saturdays for special events, such as the Union Budget. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email Live trading during Budgethas been consistent since itwas shifted from 5 pm to 11 am in 2001. New Delhi: The stock markets will remain open for trading on Saturday , February 1, when Finance Minister Nirmala Sitharaman presents the Union Budget. Trading hours will follow the standard schedule from 9.15 am to 3.30 pm, according to separate circulars issued by NSE and BSE. Typically closed on weekends, stock markets occasionally operate on Saturdays for special events, such as the Union Budget. On February 1, 2020, and February 28, 2015, the Budgets were presented on Saturdays, and the market remained open. This year, Nirmala Sitharaman will present her eighth consecutive Budget. Live trading during Budget has been consistent since it was shifted from 5 pm to 11 am in 2001. This allows market participants to incorporate policy changes and fiscal measures into their strategies immediately. Investor anticipation remains high as the government prepares to reveal economic policies and sectoral allocations in the Budget. With sectors like infrastructure, manufacturing and technology often witnessing significant impacts from Budget announcements, market movements on February 1 are expected to reflect investor sentiment. Impact Of Budget On Stock Markets The Budget serves as a blueprint for the government's economic strategy. For the stock markets, these announcements can be a double-edged sword. Positive reforms and incentives for certain industries can uplift market sentiment, while measures like higher taxes or unexpected fiscal tightening can dampen investor confidence. Add NDTV As A Trusted Source Some Significant Budgets And Their Impact On Markets 1957-58: TT Krishnamachari introduced wealth tax, reshaping taxation norms. 1991-92: Manmohan Singh's liberalisation reforms unlocked India's economic potential. 1997-98: P Chidambaram's \"Dream Budget\" slashed taxes, exciting markets. 2017-18: Arun Jaitley merged the Railway and General Budgets. Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Budget 2025 , Union Budget 2025 , Stock Market",
    "url": "https://www.ndtv.com/business-news/union-budget-2025-share-markets-to-remain-open-on-saturday-7515427",
    "original_url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPNEZxSXQzb0Y1aGowd2E0WjJWVjgtWVlBR3ZCVkJudUkxb05uRURWWmpxeFBkS1otRGFoMFk1S3dzWkU4bzBVVTdFZVJYR05sS1drSjRiYkVBTzlGSkhJbE9nSzJ4aXd1SnYzZ0tHekxYMFd5QVZWN3ZvMnZDUVNubURoT0RQek83YkVYRjBwVWwtSXhVaWE4dXlEbzNZTjhFSGUw0gGrAUFVX3lxTFA2QzJ0RzZZRXNfdWJSanNpcHhBWE15YVpoWXVUWDcwOFAtMkxrOEJWNUowNGtkWGNqeW9hWnc5R2hCN1FHVzRlVENJelprWkVMSHM4aEdFc2ZGUEU0U1Q1NXpDbGN4cmhjTldoeEtwYUkyeTRhR3lUWUM4MXkxVmlNbGZqLWtORGYyRXFRNWRJZ2hKU3hCeXU4bG8xNkJqUUp6V2tmREs1b3lFaw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2413,
    "word_count": 364,
    "gnews_title": "Union Budget 2025: Will Stock Markets Open On February 1? - NDTV",
    "published_date": "22/01/2025",
    "publisher": "NDTV",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock market today: Nifty 50, Sensex extend gains to 2nd day, led by IT and cement stocks; broader market rebounds",
    "body": "Indian Stock Market: Dalal Street witnessed another day of gains on Thursday, January 23, as strong support from IT and cement stocks helped frontline indices remain in positive territory for the second consecutive session. Notably, the broader market staged a sharp recovery after facing selling pressure in recent sessions. The Nifty 50 ended 53.50 points higher, or with a 0.22% gain, at 23,205, while the BSE Sensex finished the trade at 76,512, up 0.14%, or 107 points, than Wednesday's close. The Nifty Midcap 100 index jumped 1.86% to 54,098, and the Nifty Smallcap 100 index ended the session with a gain of 1.12% at the 17,364 level. IT stocks continued their strong performance for the second day, with mid- and small-cap stocks outperforming. Stocks such as Coforge, Persistent Systems, and Zensar Technologies recorded gains of up to 11%, driven by impressive Q3FY25 results. Similarly,better-than-expected results from Ultratech Cementlifted sentiment across the cement sector, leading to strong gains in major counters. Shares of Ultratech Cement soared nearly 7%, while those of Kesoram Industries, JK Lakshmi Cement, JK Cement and Grasim Industries all ended the session with gains of up to 5%. Meanwhile, EMS stocks like Amber Enterprises, Dixon Technologies, and Kaynes Technology rebounded in trade after recent valuation concerns had kept them under pressure. New-age tech stocks, including PB Fintech, FSN E-Commerce Ventures, and CarTrade Tech, saw healthy buying interest during the session, although they remain up to 30% below their recent peaks. The recent entrant on the exchanges, Go Digit General Insurance saw its shares jump 15% to₹327 apiece after the company reported a nearly three-fold rise in its net profit to₹119 crore in Q3FY25. Commenting on today's market performance, Prashanth Tapse, Senior VP (Research), Mehta Equities, said, \"Markets were range-bound with a mixed bias intra-day and ended slightly higher as investors resorted to select buying in the beaten-down IT, telecom, and realty shares.\" \"Thesharp fall in rupee against the dollar, which has been fueling foreign fund outflows over the past few months, is making investors jittery. With the ongoing corporate earnings outcome not so encouraging so far and Budget round the corner, investors will play safe bets with a selective buying approach and mostly at global markets for cues,\" he added. Vinod Nair, Head of Research, Geojit Financial Services, said “Uncertainty lingers whether the trade tariff measures will affect global trade, instigate higher inflation, and currencies volatility. The trend holds a declining momentum YTD with a pause today contemplating the upcoming 2025 budget, which has a muted expectation. Meanwhile in-line Q3 results showcasing QoQ growth to the indices suggesting that Q4 will be much better.” Rupak De, Senior Technical Analyst at LKP Securities, said, \"Following a positive start, the trading session on Thursday remained muted, with the index showing limited movement. It failed to break above the 50 EMA on the hourly chart, indicating selling pressure at higher levels. The bearish trend is likely to persist as long as the index stays below 23,400. On the downside, support levels are observed at 23,150 and 23,000.\" Disclaimer:The views and recommendations given in this article are those of individual analysts. These do not represent the views of Mint. We advise investors to check with certified experts before taking any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-sensex-extend-gains-to-2nd-day-led-by-it-and-cement-stocks-broader-market-rebounds-11737624727847.html",
    "original_url": "https://news.google.com/rss/articles/CBMijAJBVV95cUxPWU50NGZjNVVfbm1yeTE0ZHlNS0dfaGpHRFNnV29SSFlkVlNON29kVjZ3NXJfQV9WbFprZU9zUDhwaDFUR3dGejFNOW0zTWwyZzJKeFF6QTg2aGVOZERYcDJld3JKZ0FtbXpBNVNLVlFPbnhsNVRaY1V3ajlxc3hMVy1yZXczVzRmNGlqdTB6cWhsWjhXR24tTW5hc09xM1BtNzduY1REbjY0WmVGanFrNGtMb1hiSkZEMU0wRzl3T0ExN2FVR3hCM25DQmhvUjZQUnkydExwdUFiYjdReE5WajZ4QmUxdFdnYmVBY0tOWEs2TlR4QVM0TUFfdE5GemIzbUhEeUVZajQtLTFf0gGSAkFVX3lxTE5ZMFk0elVlMU1KU21sOXNSVmFEMjJNdWU0MHNYbm9DQTVEVGphbFo0WHpVbFlLS291blhLUkFPUXZjNU0zdmg2bWYxS3NEV0FJODdVQW9Zb3dudXYwbC1TZldTN2ExSGdvOE96VjZUV3hQNW95UHU3bVltaWVmUS1lRVUtcjVYLTlTUlpNd3JQUHp3WE5xdFZqbVUxa3NDOEJtMFhRaEozV0w2WmxZUFJ0V09xT0IwTnRUQ0wzcFB6eFZ6aTVsbUNLSDhqczRaMG03NDNQSlNCQUExNnRhc2VIaUF3NGdKd0NsVmZQNEpDMnBPRUI5TG9OMDJ2dGI4Tk9jZEM4cTZjRlYxUGJ1ODNIeXc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3714,
    "word_count": 573,
    "gnews_title": "Stock market today: Nifty 50, Sensex extend gains to 2nd day, led by IT and cement stocks; broader market rebounds - Mint",
    "published_date": "23/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market: 7 key things that changed for market overnight - Gift Nifty, Trump Tariffs to Netflix shares rally",
    "body": "Indian stock market: The domestic equity market indices, Sensex and Nifty 50, are expected to open higher on Wednesday, following gains in global markets. Asian markets traded higher, while the US stock market rallied overnight as investors assessed US President Donald Trump’s tariff stance. On Tuesday, the Indian stock market crashed as sell-off intensified amid cautiousness after US President Donald Trump unveiled plans for trade tariffs on neighbouring countries shortly after taking office. TheSensexcracked 1,235.08 points, or 1.60%, to close at 75,838.36, while the Nifty 50 settled 320.10 points, or 1.37%, lower at 23,024.65. “Markets were on a cautious mode in the past few sessions, but witnessed frenzied selling on Tuesday as investors now fear that Trump’s inaugural speech to safeguard America's interest could hurt economic prospects of many countries, including India, going ahead. While foreign investors continue to offload domestic shares at will, any further rise in US bond yields could trigger massive selling,” said Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd. Here are key global market cues for Sensex today: Asian markets traded higher on Wednesday following overnight rally on Wall Street. Japan’s Nikkei 225 rose 1,38%, while the Topix gained 0.78%. South Korea’s Kospi rose 0.42%, while the Kosdaq advanced 0.8%. Hong Kong’s Hang Seng index futures indicated a lower opening. Gift Nifty was trading around 23,153 level, a premium of nearly 50 points from the Nifty futures’ previous close, indicating a positive start for the Indian stock market indices. US stock market ended higher on Tuesday, with the S&P 500 and the Dow closing at their highest levels in more than a month, after Donald Trump was sworn-in as US president. The Dow Jones Industrial Average rallied 537.98 points, or 1.24%, to 44,025.81, while the S&P 500 surged 52.58 points, or 0.88%, to 6,049.24. The Nasdaq Composite closed 126.58 points, or 0.64%, higher at 19,756.78. Netflix share price jumps 14.29% in extended trade. Nvidia stock price gained 2.27%, while Apple shares declined 3.2%. 3M shares rose 4.2%, while Ford stock added 2.5%, and General Motors shares advanced 5.7%. US President Donald Trump vowed to hit the European Union with tariffs and said his administration was discussing a 10% punitive duty on Chinese imports because fentanyl is being sent from China to the US via Mexico and Canada. Trump had previously threatened a 10% duty on Chinese imports because of the trade, but realigned that with the February 1 deadline. Netflix shares jumped over 14% in extended trade on price hikes and record subscriber gains, lifting its stock market value by almost $50 billion. The company added 18.9 million subscribers in its fourth quarter to bring its total global subscriber base to nearly 302 million customers. The company reported per-share earnings of $4.27, beating Wall Street's forecast of $4.20 per share. Revenue rose 16% over the same time a year ago, to $10.2 billion, compared with Wall Street's estimates of $10.1 billion for the quarter, according to LSEG, Reuters reported. TheUS dollarstrengthened against most major peers after US President Donald Trump reiterated he was weighing a 10% tariff on China. The dollar index, which measures the currency against six peers, was flat at 108.01. Crude oil prices extended losses. Brent crude oil fell 0.04% to $79.26 a barrel, while the US West Texas Intermediate (WTI) crude futures declined 2,26% to $75.89. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-7-key-things-that-changed-for-market-overnight-gift-nifty-trump-tariffs-to-netflix-shares-rally-11737480486189.html",
    "original_url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxOZ05yU0YyclRwLXdQcEhCTm9yY19wcWtEVTlSZ09tVUxDWlU5T2dKNGtYUGFxVUNFZUttUDVZNnF4TGhDdGc2NFhTcEYwczFqLTVWNkNVbGEwZWlyekRxUlVtOGUwNTdzbjNYQkg3SmRqdXNpT1AwM2ZNa2ZrZ3dxMldkSERmMjVHR0RSUjMyN1ViWjNhazBNLWQzLVhrWG44MVdYMmhxb1VnQXVzaWlXR203cHBuZmVQYXRCZmVWblA4eDM1MWRlNGs4U0hfc3VOU0M2V3k3SURLMFVkdFIzX0NFTFI3QVJIMnkzbWlMamdZTWFfeGk2VnRWeHdXNDVoTFJwWjBnNGtLVDlUamY5eVNHONIBmAJBVV95cUxQd3NaVC1hdm1FUWxTQ3R1LU1EdmMyQzdITlpjLTZZcTBFOE05WWNOcEJwOVdWd0dtdXdmOW1yN3BqdjhtWS03ei1zRTZQTl9zUGhKcEQwcVA1Yy0xX3ZieDFienY3bmVQLU8zbHJ1X05uaDZmR1JSdWpyYWxhRmktUU9IOEpsRFlmZXh2QkQ5V2lIdnc1cFdMVnlET3k1LTFVQ3lmRklQbUV4UFhSSU9UVGttSXo2Rlg1VWxqNXBvTHRFTjZ4WkFVZUgzbGRySUU5X2sybGhwcDNTb2l1UjBPWVZJZ2Ezd3JXVkRYMXYtSFNaYUpzRTBua2V3ZkJoV2psSmtBdmZ6a29BdVlrNW9VOXE0Vkdibmlu?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3970,
    "word_count": 624,
    "gnews_title": "Indian stock market: 7 key things that changed for market overnight - Gift Nifty, Trump Tariffs to Netflix shares rally - Mint",
    "published_date": "22/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  }
]