[
  {
    "title": "Indian stock market: 10 key things that changed for market over weekend - Gift Nifty, US dollar, to crude oil prices",
    "body": "Indian stock market: The domestic equity market indices, Sensex and Nifty 50, are expected to open lower on Monday tracking mixed cues from global markets. Asian markets traded flat today, while the US stock market ended lower on Friday, amid selling in technology stocks. This week, investors will monitor keystock market triggers, including the next set of Q3 results, Union Budget 2025, January’s derivatives contracts expiry, US Federal Reserve interest rate decision, auto sales data, domestic and global macroeconomic data, flow of foreign funds, trends in crude oil prices and other key global market cues. On Friday, the Indian stock market ended lower amid profit booking after a two-day recovery rally. TheSensexdeclined 329.92 points, or 0.43%, to close at 76,190.46, while the Nifty 50 settled 113.15 points, or 0.49%, lower at 23,092.20. “Domestic equities are expected to trade within a broad range with some volatility amidst the Q3 result season, unfolding of US President Trump’s economic policies and the Union Budget. PSU and capex themed stocks such as railway, defence, capital goods will be in focus ahead of the Budget,” said Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd. Here are key global market cues for Sensex today: Asian markets traded flat ahead of key economic data from China. Japan’s Nikkei 225 rose 0.03, while the Topix gained 0.62%. Hong Kong’s Hang Seng index futures indicated a higher opening. Taiwan and South Korean markets were closed for holidays. Gift Nifty was trading around 22,970 level, a discount of nearly 143 points from the Nifty futures’ previous close, indicating a gap-down start for the Indian stock market indices. US stock market ended lower on Friday dragged by technology stocks amid mixed economic data and earnings reports. The Dow Jones Industrial Average declined 140.82 points, or 0.32%, to 44,424.25, while the S&P 500 dropped 17.47 points, or 0.29%, to 6,101.24. The Nasdaq Composite closed 99.38 points, or 0.50%, lower at 19,954.30. Nvidia share price fell 3.1%, Microsoft stock price lost 0.6% and Tesla stock declined 1.4%. American Express shares fell 1.4%, while Boeing share price dropped 1.4%. NextEra Energy Inc stock rallied 5.2%, while Texas Instruments shares tanked 7.2%. US existing home sales increased to a 10-month high in December. Home sales rose 2.2% last month to a seasonally adjusted annual rate of 4.24 million units, the highest level since February. Economists polled by Reuters had forecast home resales would rise to a rate of 4.19 million units. US consumer sentiment weakened in January for the first time in six months. The University of Michigan said that its Consumer Sentiment Index fell to 71.1 this month from a preliminary reading of 73.2 and 74.0 in December. Economists polled by Reuters had expected an unchanged reading. Crude oil prices fell after US sanctions and tariffs highlighted risks to the global economy and trade. Brent crude oil declined 1.03% to $77.69 a barrel, while the US West Texas Intermediate (WTI) crude futures dropped 1.13% to $73.82. The US dollar slid on Friday, posting its biggest weekly loss in over a year. The US dollar dropped as much as 0.8% against a basket of currencies on Friday, before narrowing losses at the end of the day to be down 0.65%. The dollar fell 1.8% last week, its worst week since November 2023. Gold prices rose over 1% on Friday, closing in on its all-time-high hit in October, amid a weak dollar. Spot gold was up 0.7% at $2,772.79 per ounce, while US gold futures settled 0.5% up at $2,778.90 per ounce. India’s foreign exchange reserves extended their slump for about four months now, hitting an 11-month low. In the week ending January 17, India’s forex reserves declined by $1.88 billion to $623.983 billion. The reserves are now over 10% lower than the peak. ICICI Bank reported astandalone net profitof₹11,792 crore in Q3FY25, recording a growth of 14.8% YoY, while its net interest income (NII) increased 9.1% YoY to₹20,371 crore. The private lender’s net interest margin (NIM) declined to 4.25% from 4.43%, YoY. Asset quality was stable sequentially. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-10-key-things-that-changed-for-market-over-weekend-gift-nifty-us-dollar-to-crude-oil-prices-11737940705871.html",
    "original_url": "https://news.google.com/rss/articles/CBMijgJBVV95cUxNb1BWaVU4OWNNajZmZDRSbEJIZ1ZMRlJWRjUwMHNpUVB4TG04RGpjTkZwUEVJTkRlUXVJUDQwdVE0eHdMUURLVHpaQld3T3dWV1F5SlJ3V0NZREI4dkduTWt3eXYwVlpOaE5TU2RyVVhwSEd5Snd6UWREa2k1UHRnMW51UExnUEpMV0VCaVV2NHBZYUE3a2F3aUNxZ21nZ0tCTnduVjAxTHNwdWRLQklRNjRfUjNocGI4SHZYc1ZIRVlSbGdfNVdNREJud2Z6enNRcHJUdzlGR0hSVkhEenNqWWNZcTBmeW1PNE0wbkV6QmtoQXlZRFo1bUIxOW9XSTlWdVAwcHNWWEF1dGo4VWfSAZMCQVVfeXFMTzVRV2JZalBTUTVGb3FfREhITS1hNGhWbUNXaVByYmN6VWRxc0thT1QxaDlrR2d5WmRuQnJCRVNyeFg3N1l0VFI4bXJKYVBGV0xTaDBRUkdiSzAycm9OZzFSVE9wYlFObHBrbHlWZVFoY2JyMFZVci1aQVRIS2lrcTBjX1l2ejdid2xMVUlTSW9wM2NYYTZPSURTSnFRTkV2S1VnMjFvZkxzM0NpcDYyNXQxTE1OeWRqQjBPb2FSNEotM2dKdlN2eUNvZTZIWXhFY3QtbUVPall4bFVURkZYdS1TNGV4SmhNM0RLdS1OUEN6My1SV2tGb2QxNnhZeDNBVmloanFpWDNGcnJLalZxQ1VJaDA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4634,
    "word_count": 745,
    "gnews_title": "Indian stock market: 10 key things that changed for market over weekend - Gift Nifty, US dollar, to crude oil prices - Mint",
    "published_date": "27/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Monday blues for stock markets! Reasons why Sensex, Nifty are falling today",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 27 2025 | 11:57 AMIST Zubeen Garg death case: Festival organiser & manager arrested; what’s going on? RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US",
    "url": "https://www.business-standard.com/markets/news/monday-blues-for-stock-markets-reasons-why-sensex-nifty-are-falling-today-125012700328_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQdUhjZjBvdjktV0NOY0labndvLXdacmJheDlfYXlsWU82QmJhcmdHN2JoTkJYeGdfSG1HNmdCV0t1OWZMSkhaZXlWMUN4dUdmMGVaNl9iNHVTNEJQbDdVYkxuU3M0dFRlLXlEQ2NJT1dodFhtenBaS3JqS1cxNG9BSG9xa2pzOHY5d3lERVpMeHRiNjJobmo4djA2NW42TWNNQnAzbDhLYVliVE5OQldyUS1jNVliYWEtMlNjMjlCaktNLTF4eU1zdXB1NThmN080RmRHeFZfc9IB3AFBVV95cUxPQ1ZkcVp6STV4NnpLcDBxYnlSeEZ0a0U4YUNMdVQ5YWFNWFR4elhxWE9hcFlWLWhnWWNJS2dVdTRTa0o1NzVJUEtHV3hPZ1dCTGtLSDV5ZjdVbGpSdkp2M1lKU1BFZHJfT2F1Yy02Q1Q4aTRuWWRkLXpxSE1mQUtWS3ZvVUhCVmQzSUZDZTB2TVRkWnRIeF83M3RjSUVXaEZvUlY5YXlYUms4QV9EV1FVS0RxRGJUS1hMXzAwTkZxem5CT3ptLVlUelo5NENKWmxqSUZGemRRVWZUZTE3?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 494,
    "word_count": 93,
    "gnews_title": "Monday blues for stock markets! Reasons why Sensex, Nifty are falling today - Business Standard",
    "published_date": "27/01/2025",
    "publisher": "Business Standard",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market: 7 key things that changed for market overnight - Gift Nifty, DeepSeek concerns to Nvidia shares",
    "body": "Indian stock market: The domestic equity market indices, Sensex and Nifty 50, are expected to open on a cautious note on Tuesday following weakness in global markets. Asian markets traded lower, while the US stock market ended mixed, with the Nasdaq posting its biggest one-day percentage drop since December 18, and the S&P 500 registering its biggest one-day percentage fall since January 10. The emergence of a low-cost Chinese artificial intelligence model DeepSeek prompted a steep sell-off in US chipmakers and technology stocks globally. On Monday, the Indian stock market suffered significant losses, with both the benchmark indices plunging over a percent each. TheSensexcrashed 824.29 points, or 1.08%, to close at 75,366.17, while the Nifty 50 settled 263.05 points, or 1.14%, lower at 22,829.15. “With global market weakness and anxiousness around Trump’s trade policy, Indian equities are expected to remain under pressure in the near term. Investors will closely monitor the upcoming Q3 results, Federal Reserve’s stance and India’s Budget announcements during this 6-day trading week for further cues,” said Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd. Here are key global market cues for Sensex today: Asian markets traded lower on Tuesday following overnight losses on Wall Street amid sell-off in technology stocks on concerns over China’s DeepSeek. Japan’s Nikkei 225 declined 0.67% while the Topix dropped 0.36%. Hong Kong’s Hang Seng index futures indicated a higher opening. Several Asian markets, including Taiwan, South Korean and Chinese markets, are closed for the Lunar New Year holiday. Gift Nifty was trading around 22,923 level, a premium of nearly 76 points from the Nifty futures’ previous close, indicating a positive start for the Indian stock market indices. US stock market ended mixed on Monday, with the Nasdaq posting its biggest one-day percentage drop since December 18, after a low-cost Chinese artificial intelligence model DeepSeek’s AI Assistant prompted a steep selloff in US chipmakers. TheDow Jones Industrial Averagegained 289.33 points, or 0.65%, to 44,713.58, while the S&P 500 lost 88.96 points, or 1.46%, to 6,012.28. The Nasdaq Composite closed 612.47 points, or 3.07%, lower at 19,341.83. Nvidia share price sank 17%, Microsoft shares declined 2.1% and Alphabet stock price plunged 4.2%, while Dell Technologies share price dropped 8.7%. Apple shares rallied 3.18%, while Vistra stock dropped 28.3%. Nvidia shares sank nearly 17% after the emergence of a low-cost Chinese generative AI model.Nvidia share pricecrashed 16.86% to end at $118.58 apiece on Monday, erasing about $593 billion in stock market value, the deepest ever one-day loss for a company on Wall Street, according to LSEG data. Nvidia’s market-cap loss on Monday was more than double the previous one-day record, set by Nvidia last September. The Reserve Bank is set to infuse the much-needed liquidity of₹1.5 lakh crore into the system over a period of time through a combination of forex and money market measures, setting the stage for a potential rate cut next week. RBI said it will purchase government securities worth₹60,000 crore throughopen market operations(OMOs) in three tranches of₹20,000 crore each. RBI will also conduct a 56-day variable rate repo auction worth₹50,000 crore on 7 February and dollar/rupee sell swap auction of $5 billion for a tenor of six months on 31 January. Crude oil prices steadied after sinking by 2% on Monday. Brent crude oil fell 1.81% to $77.08 a barrel, while the US West Texas Intermediate (WTI) crude futures eased 0.08% to $73.11. Gold prices firmed after falling more than 1% in the previous session. Spot gold held its ground at $2,742.49 per ounce, while US gold futures gained 0.3% to $2,746.70. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-7-key-things-that-changed-for-market-overnight-gift-nifty-deepseek-concerns-to-nvidia-shares-11738029058505.html",
    "original_url": "https://news.google.com/rss/articles/CBMijwJBVV95cUxQOE94cGIxTkI4M293RkJYdFVjWGZUSjgtVDdoV0hpcHp4aks2dnY2RXhfVWM4RndEd2RWcDdDRjlCUExpRGFtOEFhckFuVVVGUkZKX080X05CbzZuc1puRkZIZ0JzVkJUdnBYVnBHSEdsTEdCdmd1eFhkZmNNYmg2bnNLR3NUYUhRNmxfY2ItSXdLZGhoRzFKclpvc09xelBpY1k2cFFQemlRek1qaE9IOF9NZ0NObFdTdEwwbHVHT2NqQ3U2MWo3QkVvVVFtSzE5Q2tZSktzYXJZYkZEX0tOVlB5R3JBeVEyN3hLOEJjenJOS3pyb1Q5MGc2TEdZWXZMZ0ZfalJvaVk2YU1BQzMw0gGUAkFVX3lxTE9HbFV1cGpvQlp5TUpibXFHWTVtS3RWMWVyVnB0Y0h1ZXEyY1RFQURCQUZ0MVB4ZEtMeHRuOUhFUlpnejEtSmtEc094bTMzUnZhU0VpLVFOTVdqU3gwSWpuSDZhQWNXcGdFbzQ4X213TzVCZExkWHZ4NDZkc0czWnhfcXl4d0Y3U3lJWEdoV2JaRTJpZVZtcUdIZk9jS1hFQUk1YTh0TmxINWRqcl9zZ01UTjdnLVNNWjJIVDJ5aF9BM00tRTdVeFBXdHlrZmRzeS0tODRPQkM5X3Y5N281aXVINXZVT2xWUEVCQWFvZjJJZHdwLUJGZUFqc1EwQWZKWHpsVzczNTFoZTFfQU5rVl9OQ01UMA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4282,
    "word_count": 665,
    "gnews_title": "Indian stock market: 7 key things that changed for market overnight - Gift Nifty, DeepSeek concerns to Nvidia shares - Mint",
    "published_date": "28/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock Market Highlights: Nifty breaks bearish pattern, eyes 23,800 upside level. How to trade on Budget Day",
    "body": "Stock Market Highlights: A long bull candle was formed on the daily chart that has surpassed the hurdle of 23,400 levels and closed higher. Technically, this market action indicates a significant change in trend and signals the emergence of strong upside momentum. - Ajay Goel, CFO, Vedanta - Deveya Gaglani, Senior Research Analyst-Commodities, Axis Securities Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-31-january-2025/liveblog/117764365.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNNjkwN1VuZGwwQ0gyU1k5aFU4WXg1N1YtdERfSjFHS1cyV3FVOEFyUVZEdHRzclMxOGJ5bkhERzNsV3dDb0ZKdUhIMnNvN1hUMkNENWJKaWg3QWJJeVc4N3I1cmswSnRnWnFYUkxwZ3ZJYl9hOEN1dkxKMXl4TGUtTmlHdnFQU2VBWTZVbUVlU1VvRUYtVnZORUp4WnZiMjZHSWY5RmdfZTFtN2xwa0lETlhsQzhZaGY3U2xYU290ZUhGT2RHOENXUHNoamZESWdBTm1rZXFhTdIB3AFBVV95cUxQSUpTaWJSS1VvdktJalk4TUE3QmlJUUdIbDJsTnl1UXlmZTF1Q0hVS1ZOSjZOQkFjZ0tpaVdYM2UxaEZRRnR3YXdQV1h6VlpqalJjN2xmRU1UYVplR3dndTlJdVdaU25UUTcwYmNCUXRoazRpNjBpbDBNZTJmQ01tNXhHbExybTFlVERNdE1rSUhCbDBZeTJyZ1NTOERmUUJ0QmtaYkRlY1R6MU44S3VWXzJrTkZLUHJRU2xFZ3BhSVVQQUtDSGlWb2I4ZzRDQlU3WmVLOFFoMlkxWUYy?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 675,
    "word_count": 107,
    "gnews_title": "Stock Market Highlights: Nifty breaks bearish pattern, eyes 23,800 upside level. How to trade on Budget Day - The Economic Times",
    "published_date": "31/01/2025",
    "publisher": "The Economic Times",
    "topic": "Indian stock market news"
  },
  {
    "title": "Indian stock market: 6 key things that changed for market overnight- Gift Nifty, Wall Street rally to Nvidia share price",
    "body": "Indian stock market: The domestic equity market benchmark indices, Sensex and Nifty 50, are expected to open higher on Wednesday following a rally in global equities. Asian markets gained, while the US stock market ended higher overnight amid a rebound rally led by technology stocks. The US Federal Reserve will announce its first monetary policy for 2025 on Wednesday. The meeting of theFederal Open Market Committee(FOMC) commenced Tuesday. The US Fed is widely expected to keep the interest rates unchanged in its first interest-rate decision of the year. On Tuesday, the domestic equity market witnessed a recovery rally after a two-day losing run, with the benchmark indices closing with decent gains. TheSensexrallied 535.24 points, or 0.71%, to close at 75,901.41, while the Nifty 50 settled 128.10 points, or 0.56%, higher at 22,957.25. “Markets witnessed a relief rally after the recent weakness, but undertone remained bearish as most of the sectors ended in red which pulled down benchmark indices from the day's high levels. Investors remain cautious due to growing global uncertainty and disappointing domestic economic indicators. However, optimism in banking, auto and realty aided sentiment even as worries over Trump’s trade policies and fading chances of any rate cut in next month’s credit policy weighed,” said Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd. Here are key global market cues for Sensex today: Asian markets traded higher Wednesday tracking overnight rebound on Wall Street, while several markets in the region were closed for the Lunar New Year holiday. Japan’s Nikkei 225 gained 0.62%, while the Topix rose 0.39%. Gift Nifty was trading around 23,028 level, a premium of nearly 50 points from the Nifty futures’ previous close, indicating a positive start for the Indian stock market indices. US stock market ended higher on Tuesday led by a recovery in technology shares from sharp losses in the previous session. TheDow Jones Industrial Averagegained 136.77 points, or 0.31%, to 44,850.35, while the S&P 500 rallied 55.42 points, or 0.92%, to 6,067.70. The Nasdaq Composite closed 391.75 points, or 2.03%, higher at 19,733.59. Nvidia share price jumped 8.9%, Apple shares gained 3.7%, while Microsoft stock price rose 2.9%. Royal Caribbean shares rallied 12%, Boeing stock advanced 1.5%, and General Motors share price dropped 8.9%. US consumer confidence weakened for a second straight month in January amid renewed concerns about the labor market and inflation. The Conference Board said its consumer confidence index fell to 104.1 this month from an upwardly revised 109.5 in December. Economists polled by Reuters had forecast the index rising to 105.6 from the previously reported 104.7. New orders for key US-manufactured capital goods increased more than expected in December. Non-defense capital goods orders excluding aircraft, a closely watched proxy for business spending plans, rose 0.5% after an upwardly revised 0.9% gain in November, the Commerce Department’s Census Bureau said. Economists polled by Reuters had forecast these so-called core capital goods orders climbing 0.3% after a previously reported 0.4% rise in November. The US dollar advanced against the yen amid fresh tariff threats from the Trump administration. The dollar rose 0.6% to 155.52 against the Japanese yen, on course to snap three straight sessions of losses. The euro fell 0.55% at $1.0433, while Sterling weakened 0.45% to $1.24. (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-6-key-things-that-changed-for-market-overnight-gift-nifty-wall-street-rally-to-nvidia-share-price-11738090610093.html",
    "original_url": "https://news.google.com/rss/articles/CBMilgJBVV95cUxNWjNRVVJGUTNYNjZtMllsM1pTM2l0SnZiRUwzRjl1UGpIZGpEZ3lmR2Vzem53OXg2cXZPNTBEdUp3OElqX1EyWVBCdTlXN3gzYl9MYVJyN3JlVTdQN2ZEUjBYdnoyNTVFMVdsekNkZmsxVTdsT2ZjZ2c4b0dNYnU5QnduVUN6S3lVYzlyXzZ5RWFxX2kzNVpDYW0zMEJ0WU4tdzR3azN2Wk5QX2RfLUFvSk1JeGsxTHIwTXE4b3RoUDA5TkxkTzllakhaQXk3RVRKb3pyZTNaTzRtTjdlVUFxRkhKeGtzWEkzMC1EaWVKQVI0X1hIUlQzMVZmVjhqelA5bjlJdmkxMEtfTUlmZEVUVTloSHY3Z9IBmwJBVV95cUxQdXc3VHRMY3c3YXZCeXZnRmhMbDJudWdHYWoxRllVcFEwSUxQd0hadFBDazgxNFRyLXN5cF80dzNqWTBSbjJPQ1Q2WFRNNV9WdVJkVlRvYmY1U0pqWElBTUhkQUgweXJ0UWxFM0Joa1c3aEcycDROSTJhMFFYYTBMWUlKMThtSDdGeWF2dVlCV3pOZmpSeHVTRnQ2dEVyVTB6dkppUWpkdVNzV0JQRlJRaGprUTl3R3diZGJ2czBHQWs1aG5hMWpqWS1iOHpTOThnRmZwdzJsXzgyQmh3ZnI0NXk5OXJFNHI1X2ozRng2YUU4RlNVNVl1Y2dvelVvUU9oaGtsWnEtamlyaGppTVhmaWNNRTEzN3VKcFhV?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3937,
    "word_count": 607,
    "gnews_title": "Indian stock market: 6 key things that changed for market overnight- Gift Nifty, Wall Street rally to Nvidia share price - Mint",
    "published_date": "29/01/2025",
    "publisher": "Mint",
    "topic": "Indian stock market news"
  }
]