[
  {
    "title": "Stock market closing: Sensex, Nifty end 4-day losing streak; Paytm ends 10% higher",
    "body": "Nifty sub-indices finished higher On the NSE Nifty, all sub-indices finished in green with Metal, PSU Bank and Realty gaining as much as 3.3 per cent. Top winners on sensex Power Grid, NTPC, Tata Steel, Bharti Airtel, Sun Pharma and Bajaj Finserv were the top gainers in the sensex pack rising as much as 3.91 per cent. Paytm shares close 10% higher on the BSE at Rs 1,495 Markets snap 4-day losing streak Sensex ends 198.44 points higher at 58,664.33; Nifty advances 86.80 points to 17,503.35 Unicommerce to invest $5 million towards international expansion E-commerce focussed IT firm Unicommerce plans to invest $5 million towards strengthening its international operations in various countries of Southeast Asia and the Middle East with a target to garner 400 per cent growth in business, the company said on Tuesday. Adani Solar partners KSL Cleantech to expand market share Adani Group firm Adani Solar on Tuesday announced its collaboration with KSL Cleantech to expand its market share in the eastern and northeastern renewable energy markets of the country. NPCI Bharat BillPay on-boards Tata Power for electricity bill payments NPCI Bharat BillPay has on-boarded Tata Power on its platform through which customers will be able to pay their electricity bills in a hasslefree and seamless manner. Latent View shares make stellar market debut, zoom 169% Shares of Latent View Analytics on Tuesday made a stellar market debut, listing with a premium of 169 per cent gainst the issue price of Rs 197. The stock listed at Rs 530, reflecting a huge gain of 169 per cent from the issue price on BSE. It further jumped 178.55 per cent to Rs 548.75. On NSE, it made its debut at Rs 512.20, a jump of 160 per cent. Payments firm MobiKwik to delay planned IPO Payments firm MobiKwik has delayed its plans to proceed with an initial public offering (IPO) of shares this month, its CEO said on Tuesday, in an anticipated move following the dismal market debut of larger rival Paytm earlier this month. Vodafone Idea hikes tariff rate for mobile services After Bharti Airtel, telecom major Vodafone Idea has also hiked rates of its mobile services, the company said in an official statement on Tuesday. The new tariff plans will be applicable for all prepaid users and will come into effect from November 25. Digital payments start-up Paytm rose as much as 6.97% after two sessions of sharp falls. Latent View Analytics opened at a 160% premium to its offer price, giving the data analytics firm a market valuation of $1.36 billion. Indian shares fell for a fifth session on Tuesday and hit their lowest in nearly two months, weighed down by tech and finance stocks. By 10:42 AM, the blue-chip NSE Nifty 50 index slipped 0.2% to 17,382.25 and the benchmark S&P BSE Sensex fell 0.36% to 58,256.93, after shedding about 2% on Monday. China stocks rise on hopes of more economic support; Hong Kong down China stocks rose on Tuesday after state media quoted the country's premier as saying Beijing should step up efforts to stabilise key economic areas, while real estate shares rebounded after some banks were told to issue more loans for property projects. The CSI300 index rose 0.2% to 4,922.02 by the end of the morning session, while the Shanghai Composite Index gained 0.4% to 3,597.53. The Hang Seng index dropped 1.0% to 24,698.49. The Hong Kong China Enterprises Index lost 0.9% to 8,848.98. Rupee slips 16 paise to 74.55 against US dollar in early trade The Indian rupee depreciated by 16 paise to 74.55 against the US dollar in opening trade on Tuesday, as a muted trend in the domestic equity market and firm American dollar weighed on investor sentiment. At the interbank foreign exchange, the rupee opened on a weak note at 74.48, then lost further ground and touched 74.55 against the American dollar, registering a decline of 16 paise from the last close. On Monday, the rupee had closed at 74.39 against the US dollar. Infosys, the top loser in the Sensex pack, shed around 2 per cent, followed by ICICI Bank, HUL, Bajaj Auto, Reliance Industries and TCS. On the other hand, Tata Steel, PowerGrid, Bajaj Finance and ITC were among the gainers. Sensex tanks over 700 points in early trade Equity benchmark Sensex plunged over 700 points in early trade on Tuesday, tracking losses in index majors Infosys, ICICI Bank and Reliance Industries amid persistent foreign fund outflows.After touching a low of 57,718.34 in the opening session, the 30-share index pared some losses to trade 264.20 points or 0.45% lower at 58,201.69.Similarly, the Nifty was trading 89.05 points or 0.51% down at 17,327.50. It touched a low of 17,216.10 in initial deals. Paytm rose about 5.6% after two sessions of sharp falls. The digital payments start-up made one of the worst major stock market debuts in India last week.Vedanta Ltd rose about 6.7% in early trade. Indian shares decline as tech, financials weigh Indian shares dropped on Tuesday after falling nearly 2% a day earlier, as technology, financial, and energy stocks slipped, and surging Covid-19 cases in Europe raised concerns of a hit to global economic growth. The blue-chip NSE Nifty 50 index fell 0.96% to 17,255.40 by 0356 GMT, while the benchmark S&P BSE Sensex declined 1.08% to 57,814.18. The Nifty IT Index fell 1.5%, dragged by Infosys Ltd and Coforge Ltd — down about 2.2% each. Sensex tumbles 431.93 points to 58,033.96 in opening session; Nifty slumps 134.20 points to 17,282.35 Spot gold may rise towards $1,831; medium-term outlook bearish Spot gold may break a resistance at $1,817 per ounce and rise to $1,831, as it has found a strong support at $1,803. The support is identified as the 61.8% retracement of the uptrend from $1,757.63 to $1,876.90. Both the former supports at $1,831 and $1,817 failed to hold, creating a golden chance of a decent bounce around $1,803. Is it really because of Covid -19 return in Europe? Or is it because of planet Guru Transit from Makaram into Kumbam?",
    "url": "https://timesofindia.indiatimes.com/business/markets/stock-market-sensex-nifty-live/liveblog/87839263.cms",
    "original_url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOLUNjTXBwWm5EX2lZWjRoM2swN241bWNvajROQkNiZER2UzB3VzRSbjFzMTB5SlVaTEdmM3RuVE9BVllURFhkZ3BsWTg0cUt5X0ZWamFSWi1fVjg1VzNzVFp5N2VCN29GNGFpRUhxS1RMZEl2dF93TGVMdkNVSW9WM1dEanZFZjVKSE9YQWlYOVN4OHg0LUlZWHlia1pQWjdMUGlHOW5hVF_SAa4BQVVfeXFMUFRJMFo1VXBXMTA5VEF6NUV6d0VldFBGV1JSaENRS2lobWVWR3h5ejN2WWNkenA2N05PeHFVTG1QM3hvWF9LaU9wMTdxQlMtUVhFeDQtYzVaR0dBUWY2VzUxaFRrcU0xZDlsaHgzX0FvSGloSzFnRFVmT1hieGxRQTVMODlDNlR5MVJ2aGpUQWVfSGxEWU5DY3VCbDFSRHcyaU9jLXl6cnVvbEt3WDJn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5955,
    "word_count": 1007,
    "gnews_title": "Stock market closing: Sensex, Nifty end 4-day losing streak; Paytm ends 10% higher - The Times of India",
    "published_date": "23/11/2021",
    "publisher": "The Times of India",
    "topic": "Indian stock market news"
  },
  {
    "title": "With $3.16674 trillion MCap, Indian stock market beats its British peer",
    "body": "India has outgrown the United Kingdom in terms of market capitalisation for the first time to become the sixth biggest stock market amid a sustained slump in global equities triggered by the Russian onslaught on Ukraine. India’s market cap stood at $3.16674 trillion on Thursday as against $3.1102 trillion for the UK, according to Bloomberg data. India lost nearly $357.05 billion in market cap (MCap) since the geopolitical tensions flared up last month, while the British markets suffered an erosion of $410 billion since February 1. The US is the world's biggest market with an MCap of $46.01 trillion followed by China at $11.31 trillion, Japan at $5.78 trillion, Hong Kong at 5.50 trillion, and Saudi Arabia at $3.25 trillion. In Saudi Arabia, the world's second-largest exporter of crude oil, stock markets saw a jump in MCap after crude oil surged to historic levels. It added around $442 billion in MCap in the last one month. World markets swung back in the black in the last two sessions after Ukraine President Volodymyr Zelensky said he was no longer pressing for the NATO membership. On Thursday, Indian markets opened in the green with a close watch on the outcome of poll results in five states. Crude oil, too, took a breather from the rally on hopes of positive talks in a meeting of foreign ministers of Ukraine and Russia scheduled on Thursday in Turkey. \"The recent rebound (in Indian markets) is in line with the global counterparts and it would be too early to call it a reversal. Besides, the geopolitical updates, domestic factors like state election results will also be in focus. We expect volatility to remain high, so participants should prefer hedged trades,\" said Ajit Mishra, VP - Research at Religare Broking. The Indian equity markets gained for the third session after a four-day losing streak. This was also the second best session since Russia's invasion on Ukraine on February 24. Both the benchmark Sensex and Nifty have lost nearly 6 percent, while both fell 6.2 percent so far this year. Year to date, foreign investors sold around $14.20 billion in the local equity markets. With more central bank meetings coming up in the next week, analysts expect headline indices to move primarily based on macro news. Discover the latestBusiness News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated! Find the best of Al News in one place, specially curated for you every weekend. Stay on top of the latest tech trends and biggest startup news. You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/with-3-16674-trillion-mcap-indian-stock-market-beats-its-british-peer-8214751.html",
    "original_url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPYWktN0J4ejB4M1JFXzQ0NmI5LVBVVHpQUXNwVUlfM05meGdXc3RBb3hVWmVvZUVLTjMzaHZOdzVsRldGSUNOcDRaYlRZNGtHQWpxS0tSNWU4bmlXZnJLYTV5aFk2TENJQVpRYXRmNUhwRGtISC1UWlFMSndCeFl4RlNPNWQyb2FRekV4N0FfTEgzX0l2QWxWdGFBQ0JPcXJDalhtOW1nTFkzeWpMeXNzY3FCNkV1MFREZExOLVdpOHQ5STFjQXc3SFA0eF9UUdIB0wFBVV95cUxQdjluLUFvSUpHNk00dnVkV2xyUXROMEVXUzg5akZRRnJYMzE5WEt0Vmh1bzFPYnRpelJRazB5TFNxaER0Wk9uTm9BWFQzcnk3ZnZQRjVlQWk2S0FIQ3UzcVlHUUNmbVZJR0ZZNGlLUEFfQzdFM2MzSk9ibHRMQzlBTVVFUHlGNk1TUVNuSDBibVRJOFN5WUJUOXlpdldzb1c1UTJ0RVhpSTlpMzlxQ0NGU0lMMGFnSW9OZm45WTM3bXZaMlZSak1uTUZ6bG93LVRQbWsw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2618,
    "word_count": 430,
    "gnews_title": "With $3.16674 trillion MCap, Indian stock market beats its British peer - Moneycontrol",
    "published_date": "10/03/2022",
    "publisher": "Moneycontrol",
    "topic": "Indian stock market news"
  },
  {
    "title": "Are Indian stock markets turning domestic?",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Aug 08 2022 | 7:00 AM IST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/podcast/markets/are-indian-stock-markets-turning-domestic-122080800072_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNSTJwdlNKaWMycldxWml5Ri1uRVpfUjFlX29OQnVvZmFRdTRacHJIZTlrVVRlUFNHWVljVTNZYkF2azNlQi1GSU1PRW9SOFloNGhvMXZJbzA4VkY4MkpnamxHcGVaYzVwYWRyVm15LVB1OGc1d2ZyZ2ljQ2k4TWJZYXhTT1JUR0Ywc2xxWTdoR3gtVVRTSzNPSW9reWdlbURScWE3Q3ZFU2VzYlhUekpaWNIBtgFBVV95cUxPSW8tR2NETXlIQnRvZFFVNlp5Z3psSElTVmNKajdsaTFPMm91dm00UUxBWEhDYmh3ZlhCbklnMmpSa0VSZGt3bWpqRS05NnNqSlc2NkhTYjFwX216b2d6R1BFcGhKUGZHanFZSXR5TFJBWU9uX0JWMVpDeWdNS000OXU2QjZOM0Z0c1VKbmQtZjJ3RE52eWh1Qm9GYTlBcWJ1YmdtSW9makhTN19HcVpEYjlMU1ZlQQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 491,
    "word_count": 83,
    "gnews_title": "Are Indian stock markets turning domestic? - Business Standard",
    "published_date": "08/08/2022",
    "publisher": "Business Standard",
    "topic": "Indian stock market news"
  },
  {
    "title": "Stock market updates: Sensex rises over 383 points; Nifty ends above 18,250",
    "body": "IndusInd Bank, ICICI Bank, PowerGrid, HUL, Dr Reddy's and TCS were among the laggards. Tata Steel was the top gainer in the sensex pack, spurting around 4 per cent, followed by Titan, Bajaj Finance, Nestle India and Tech Mahindra. The 30-share index ended 383.21 points or 0.63 per cent higher at 61,350.26. Similarly, the NSE Nifty surged 143 points or 0.79 per cent to 18,268.40. Analysts warn of market correction Analysts cautioned that a near 30% gain in India's benchmark indexes has heated up equity valuations and warned that markets could see a steep correction in certain pockets. Bank shares drag markets The Nifty bank index was the top drag, falling 0.6% after gaining more than 2% on Monday. Tyre maker CEAT Ltd and paint maker Kansai Nerolac fell 7.9% and 3.7%, respectively, after they reported a drop in net profit on higher input costs. Metal, IT stocks counter losses in private banks The Nifty IT index gained 0.6%, with Tech Mahindra leading the rally with a 5% surge on strong quarterly earnings. The metals index rose 1.5%. Rupee inches 5 paise higher to 75.03 against US dollar in early trade Sensex jumps 202.27 pts to 61,169.32 in opening session; Nifty rises 55.60 pts to 18,181 Elon Musk’s fortune soars $36 billion in a day NEW YORK: Elon Musk’s personal fortune jumped by $36.2 billion Monday after Hertz Global Holdings Inc. placed an order for 100,000 Teslas and filings showed a fresh tranche of options in his moonshot pay package vested. Alibaba has lost $344 billion in world's biggest wipeout Few people could have predicted the downward spiral for Alibaba Group Holding, when founder Jack Ma delivered a blunt criticism of China’s financial system last October. Yet one year on, the technology titan has lost a whopping $344 billion in market capitalization -- the biggest wipe-out of shareholder value globally, according to data compiled by Bloomberg. Shortly after the now infamous speech, Beijing suspended the listing of its fintech arm Ant Group and has since followed up with a widespread crackdown on the country’s most vibrant sectors -- causing Chinese stocks to tank. US stocks hit record high as Tesla tops $1 trillion US stock markets struck fresh records on Monday as investors awaited earnings results from tech firms and cheered the latest Tesla surge while European traders looked ahead to an ECB rate decision and the UK budget later in the week. Both the Dow and S&P 500 finished at all-time highs, extending a bullish run on good earnings while Tesla shot above $1 trillion in market value. Tesla zooms past $1 trillion market cap Tesla is the first carmaker to join the elite club of trillion-dollar companies that includes Apple Inc, Amazon.com Inc, Microsoft Corp and Alphabet Inc. Tesla now faces the daunting day-to-day challenge of becoming a high-volume automaker growing at a rate not seen since the early 1900s. Facebook profits rise amid revelations from leaked documents Facebook released results showing its profit in the recently-ended quarter grew to $9.2 billion -- a 17 percent increase -- and its ranks of users increased to 2.91 billion. Asia stocks catch Wall St cheer but China caps gains Asian stocks inched higher on Tuesday, as upbeat Wall Street earnings lifted the broader economic outlook though fresh worries about China's property sector hit Hong Kong and mainland markets. The market breadth was negative, with 22 out of the 30 Sensex constituents closing in the red. Sectorally, BSE bankex and finance rallied up to 2.30 per cent, while realty, auto, consumer durables and utilities indices notched up losses. Reliance Industries shares decline 1% Shares of Reliance Industries on Monday wiped out early gains to close nearly 1 per cent lower on profit-taking. In early trade, the stock gained nearly 3 per cent after the company reported a 43 per cent jump in September quarter net profit. The market heavyweight stock jumped 2.73 per cent to Rs 2,699 during the early trade on BSE. Later, it wiped out early gains to close at Rs 2,601.65, lower by 0.97 per cent. Major losers on sensex pack Bajaj Finserv, Bajaj Auto, Maruti, HCL Tech and Asian Paints were the biggest losers in the sensex index falling up to 3.19 per cent. Axis Bank, SBI, Tech Mahindra and Dr Reddy's were the other gainers.",
    "url": "https://timesofindia.indiatimes.com/business/markets/stock-market-sensex-nifty-live/liveblog/87247101.cms",
    "original_url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOVmM2WnBSYXJDZ05Kcm1lanpEdlYwTmlUU051d0NHTThZSW5pSWYyMkd4UTd6cVZxWkJ4R2RVT2FiVVRxS3VBR1dkZ19vMWhFWkJYTnpSRW1HNUl2ZkRQSWFzNThUaHdBTmFwb3NHNnhDVmdON0drUDBJRFlHa2dsSGltVy1kSVp2SklvTDM1TDJNZUpMQXFuMDZkOHc3WUpEZHhKX0I3cWjSAa4BQVVfeXFMTS16UWVkTXh2b0NXclJpeFlaRVFLVmhiOGRrcmtOZUp3T0NLdkZaeTRCcmhPSW9DNjZkOXlpUjJTSkNqQ0diRmRFZ19STEYtZkdpaXBIY1JXeXExWjRoNHRHQUJTVWtSYXFKZ2JRelNfMkYwYXhuakx6bENkMzZub1VZTjBzVXl2V2tTZi11TDFoYkFJRUN2TDBIU0lMWXNpT1M2VVM5c2VwWFhWU2xR?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4283,
    "word_count": 719,
    "gnews_title": "Stock market updates: Sensex rises over 383 points; Nifty ends above 18,250 - The Times of India",
    "published_date": "26/10/2021",
    "publisher": "The Times of India",
    "topic": "Indian stock market news"
  },
  {
    "title": "Market Highlights: Sensex crashes 555 points, Nifty ends below 17,650; Metals, pharma, realty crack",
    "body": "Bombay stock exchange in Dalal street. (File express photo by Nirmal Harindran) Share/Stock Highlights: The benchmark equity indices on the BSE and National Stock Exchange (NSE) reversed their morning gains and ended nearly 1 per cent lower on Wednesday amid a last-hour cross-sector selloff. The S&P BSE Sensex crashed 555.15 points (0.93 per cent) to end at 59,189.73 while the Nifty 50 slipped 176.30 points (0.99 per cent) to settle at 17,646.00. Both the indices had opened higher earlier in the day and traded in the positive territory throughout the morning session before erasing their gains and slipping into the red towards the afternoon. Story continues below this ad On the BSE benchmark, IndusInd Bank was the top loser of the day followed by Tata Steel , Bajaj Auto , HCL Technologies , Sun Pharmaceutical Industries, Reliance Industries (RIL), Titan Company, Tech Mahindra , State Bank of India (SBI) and ITC. On the other hand only HDFC Bank was a credible gainer with over a 1 per cent rise. Among the sectoral indices on NSE, the Nifty Metal index crashed 2.98 per cent dragged by National Aluminium Company, Vedanta and Hindalco Industries. Apart from this, Nifty Pharma index fell 1.87 per cent weighed by Abbott India and Gland Pharma . The Nifty Realty too slipped 1.62 per cent due to a fall in Indiabulls Real Estate and Prestige Estates Projects. In the broader market, the S&P BSE MidCap ended at 25,374.16, down 314.51 points (1.22 per cent) while the S&P BSE SmallCap settled at 28,693.00, down 158.62 points (0.55 per cent). The volatility index or India VIX rose 5.70 per cent to 17.3325. (with inputs from agencies) Live Blog Stocks, BSE Sensex, NSE Nifty, Crude oil prices, gold, silver prices, commodity market and money markets LIVE updates: 16:04 (IST) 06 Oct 2021 MARKET QUOTE | Vinod Nair, Head of Research, Geojit Financial Services on Wednesday's market performance \"Weak global markets which resulted in profit booking in metals and IT stocks led domestic indices to trade in red, trimming its early gains. Spike in crude prices is spooking the Indian market while inflation is affecting US bond yields. RBI commenced its three-day MPC meeting in which the central bank is expected to keep rates unchanged, however, it is likely to announce measures to gradually pump out liquidity from the economy.\" 15:58 (IST) 06 Oct 2021 Rupee plummets 54 paise to close at 74.98 against US dollar The rupee tumbled 54 paise to close at 74.98 (provisional) against the US dollar on Wednesday as a stronger greenback against key rivals and rising crude oil prices weighed on investor sentiment. At the interbank foreign exchange market, the local currency opened at 74.63 and witnessed an intra-day high of 74.54 and a low of 74.99 against the US dollar in day trade. The local unit finally settled at 74.98 a dollar, down 54 paise over its previous close. On Tuesday, the rupee had settled at 74.44 against the US dollar. (PTI) 15:35 (IST) 06 Oct 2021 Equity markets at close The S&P BSE Sensex ended at 59,189.73, down 555.15 points or 0.93 per cent, while the Nifty 50 settled at 17,646.00, down 176.30 points or 0.99 per cent. 14:50 (IST) 06 Oct 2021 Crude oil futures rise on spot demand Crude oil prices rose by Rs 32 to Rs 5,927 per barrel in futures trade on Wednesday, as participants widened their positions on a firm spot demand. On the Multi Commodity Exchange, crude oil for the October delivery traded higher by Rs 32, or 0.54 per cent, at Rs 5,927 per barrel in 10,185 lots. Analysts said raising of bets by participants kept crude oil prices higher in the futures trade. Globally, West Texas Intermediate crude oil was up 0.43 per cent to USD 79.27 per barrel, while Brent crude traded 0.45 per cent higher at USD 82.93 per barrel in New York. (PTI) 14:49 (IST) 06 Oct 2021 Silver futures ease on low demand Amid profit-booking by speculators and weak global cues, silver prices dropped by Rs 258 to Rs 60,728 per kg in futures trade on Wednesday. Silver for delivery in December was trading lower by Rs 258 or 0.42 per cent to Rs 60,728 per kg in a business turnover of 11,539 lots at the Multi Commodity Exchange (MCX). In the international market, silver prices traded 0.72 per cent down at USD 22.45 an ounce in New York. Market analysts said the fall in silver prices at futures trade was mostly attributed to profit-booking by speculators at prevailing levels and weak global cues. (PTI) 14:48 (IST) 06 Oct 2021 Gold futures slip Rs 126 to Rs 46,631/10 gm Gold prices on Wednesday fell by Rs 126 to Rs 46,631 per 10 gram in futures trade as participants cut down their bets amid a weak trend in global markets. On the Multi Commodity Exchange, gold prices for delivery in December fell by Rs 126, or 0.27 per cent, to Rs 46,631 per 10 gram in a business turnover of 13,309 lots. Analysts attributed the fall in prices to trimming of positions by investors tracking a weak trend in global markets. Globally, gold was trading 0.54 per cent lower at USD 1,751.4 an ounce in New York. (PTI) 13:50 (IST) 06 Oct 2021 RBI to hold rates, guidance on liquidity crucial: Poll India’s monetary policy committee is widely expected to keep the repo rate unchanged to support recovering growth on Friday, but some analysts have cited a slim chance of the Reserve Bank of India delivering a token increase in the reverse repo rate. All 60 forecasters in a Reuters poll said they see no change in the repo rate on Oct. 8. and though price pressures have soared due to rising fuel prices the RBI is only expected to raise the repo rate in April-June 2022.",
    "url": "https://indianexpress.com/article/business/market/equity-commodity-money-markets-live-updates-stocks-shares-bse-sensex-nse-nifty-rupee-crude-oil-gold-silver-metals-prices-october-6-7554845/",
    "original_url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxQQVlLaFZPX1NRUWZhZTI1RlBSd1NYdy1PLUg2U2lybldLUXQ2elNSN3kwa2lmZ2ttZnF2UGhQemE2a0I4bEhUTGJQUDIzLUJCSTNIakRmSUx6dW1lYnFCRWQ1d1ZZcDVfcm51OHY2a0owOGUwNUY3b2lwcEhScUpNaWZ4bllWeVBSMGp5aGRpa0NGR0JDMTZCNGd2TWF6VU5MaVQ4R25HTE5KZ09hTm9NLXBhMldEY2VjeEVLTmZfUTU0dVNVVGRrWlo4Wll5ak9td2FmdmtiU0pNZDlKVjltVmo4QzZ5MTNSR0dfMXpxRDczZUVFYXg0SGs3dDV2MS0wblFxa3NRODVpS1JyNTJWcWExbEVFeUx10gGfAkFVX3lxTE02YjBEX0xfdmxEOGhUa0Y1empsTklsaGs2LWFqa25Fejg3QzdYTlJ5OHNIN0lfNVFrbVBvbVhKSU9ZUnhzaWpfVFh6bElCa2R4Q1o2bHRSR25xdENaWUp1MWY3TGZZaWNzUTBvajhhaW1wS2VBWmhxX0pxWFhzUGFZSDRVQ2pzODY0amJwTXBuWHhTdlczUmRCaUtfZkpSZGdFVGpQQjJDNUdDX1BiMkl4NG5NRFJWUGxFejlRcDhOdF93TC1jUVZCS00xZnJOczZka01ZWEhINFloenJWS2tmcTRPY1NKX3NBZUlKT3hzZVkwejItUklYcHp5UjdSenFMbGt2elZucmVWY19CUl9vT205NjhITnZmZGoxZldn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5586,
    "word_count": 974,
    "gnews_title": "Market Highlights: Sensex crashes 555 points, Nifty ends below 17,650; Metals, pharma, realty crack - The Indian Express",
    "published_date": "06/10/2021",
    "publisher": "The Indian Express",
    "topic": "Indian stock market news"
  }
]