[
  {
    "title": "Stock market today: Trade setup for Nifty 50, India US trade deal to Trump tariffs; 8 stocks to buy or sell",
    "body": "Stock market news:The domestic benchmark indices, Nifty 50 and Sensex, reached a three-week low on Friday, experiencing their largest weekly decline in almost seven months, primarily due to US restrictions on H-1B visas and tariffs on branded medications affecting market sentiment. The Nifty 50 declined by 0.95% for the day, settling at 24,654.7, while the BSE Sensex fell by 0.9% to 80,426.46. Both indices recorded a loss of 2.7% over the week. The IT index dropped close to 8% for the week, marking its largest decline in roughly seven months, following President Donald Trump's implementation of a $100,000 charge on new H1-B visas. The pharma index fell by 2.1% on Friday and decreased by 5.2% over the week after Trump declared a 100% tax on branded and patented medications, set to take effect on October 1. As perAmruta Shinde, Technical & Derivative Analyst at Choice Broking, the Nifty 50 index experienced significant bearish momentum this week, dropping 672 points and negating the previous two weeks' gains. On the daily chart, the index encountered strong resistance around the 25,500 level before declining, resulting in seven consecutive red candles, indicating persistent selling pressure and a negative sentiment. The index fell below the important 24,750 threshold, ultimately closing at 24,654. The Nifty 50 is now trading beneath its 20-day and 50-day EMAs, and it is nearing the 200-day EMA, signaling a deteriorating technical setup. A breakdown below 24,500 could lead to a further decline toward the 24,400 level (200-day EMA) and potentially down to 24,180. On the upside, immediate resistance levels are found at 24,750, then at 24,880, and finally at 25,000. If the index does not reclaim these levels, the short-term outlook is expected to remain negative. Vinod Nair, the Head of Research at Geojit Investments, noted that Indian equity markets ended the week with a lackluster performance, featuring declines across various sectors. The IT sector faced early setbacks due to concerns regarding increasing H-1B visa expenses, further exacerbated by Accenture's cautious forecast. The negative sentiment intensified as new US tariffs on pharmaceutical goods triggered a significant downturn in pharmaceutical stocks. Smaller and mid-cap stocks experienced more substantial declines than large-cap stocks, indicating strains from their elevated valuations. Looking forward, investors will focus on upcoming US economic reports, particularly those relating to inflation and employment figures. Domestically, the Reserve Bank of India’s monetary policy decision and industrial production statistics will be crucial in shaping market sentiment. The fundamental outlook for sectors like banking, FMCG, and automobiles remains positive, buoyed by supportive domestic policies and macroeconomic stability. Regarding stocks to buy today, market experts—Sumeet Bagadia, Executive Director at Choice Broking; Ganesh Dongre, Senior Manager of Technical Research at Anand Rathi and Shiju Koothupalakkal, Senior Manager of Technical Research at Prabhudas Lilladher, recommended these Eight intraday stocks for today:Chennai Petroleum CorporationLtd,Jupiter WagonsLtd,Rallis IndiaLtd,Ashok LeylandLtd,Canara Bank,Sammaan CapitalLtd,Eicher MotorsLtd, andBanco Products(India) Ltd. Chennai Petroleum Corporation Ltd:Bagadia recommends buying Chennai Petroleum share price at₹760.5 keeping a stoploss at₹735 with a Chennai Petroleum share price target of₹810. Chennai Petroleum share price was trading at 760.5 and remains in a strong uptrend after a steady recovery from recent lows, reflecting sustained buying interest. Chennai Petroleum share price is forming a bullish ascending channel pattern, indicating rising demand and continued upward momentum. It is trading well above all key EMAs, which are positively aligned and providing strong dynamic support, reinforcing the strength of the prevailing trend. In conclusion, Chennai Petroleum share price exhibits a favourable technical setup and presents a compelling buying opportunity, particularly for traders targeting 810, as long as disciplined risk controls are maintained. Jupiter Wagons Ltd:Bagadia recommends buying Jupiter Wagons share price at₹336.4 keeping a stoploss at₹325 with a Jupiter Wagons share price target of₹360. Jupiter Wagons share price was trading around₹336.40 and is showing signs of a mild recovery after a prolonged corrective phase. The stock is attempting to form a base and is gradually building a potential double bottom pattern, indicating a possible reversal if follow-through buying sustains. Price is trading close to the shorter term EMAs, with the medium and long term EMAs still positioned above, suggesting that while short term strength is emerging, the overall trend remains to be confirmed by a decisive breakout. In conclusion, based on current technical conditions, Jupiter Wagons share price offers a strong buying opportunity for short-term traders targeting 360, provided sound risk management measures are maintained. Rallis India Ltd:Ganesh Dongre recommends buying Rallis India share price at₹308 with a stoploss at₹300 with Rallis India share price target of₹330. Rallis India share price has been exhibiting a strong and consistent bullish pattern, indicating sustained investor interest and positive price momentum. The stock is currently trading at₹308 and has established a solid support base at₹300. This level has historically acted as a cushion, and the recent price action suggests a reversal from this support, reinforcing bullish sentiment. The technical setup points to the potential for a price retracement toward the₹330 level in the near term. Given the renewed strength and the favorable risk-reward ratio, entering at the current market price with a stop-loss placed at₹110 offers a strategic opportunity to capture the expected upside move. The outlook remains positive as long as the stock holds above its key support zone Ashok Leyland Ltd:Ganesh Dongre recommends buying Ashok Leyland share price at₹142 with a stoploss at₹136 with Ashok Leyland share price target of₹150. Ashok Leyland share price has exhibited a strong notable continue bullish pattern, offering another promising opportunity for short-term traders. The stock is currently priced at₹142 and maintaining a strong support at₹136. The technical setup indicates the potential for a price retracement towards the₹150 level. With the stock reversing from a support base and showing signs of renewed strength, entering at the current market price with a stop-loss at₹136 offers a prudent approach to capturing the anticipated upside. Canara Bank:Ganesh Dongre recommends buying Canara Bank share price at₹118 with a stoploss at₹114 with Canara Bank share price target of₹128. Canara Bank share price has exhibited a strong notable continue bullish pattern, offering another promising opportunity for short-term traders. The stock is currently priced at₹118 and maintaining a strong support at₹114. The technical setup indicates the potential for a price retracement towards the₹128 level. With the stock reversing from a support base and showing signs of renewed strength, entering at the current market price with a stop-loss at₹118 offers a prudent approach to capturing the anticipated upside. Sammaan Capital Ltd:Shiju Koothupalakkal recommends buying Sammaan Capital share price at₹137.80 with a Sammaan Capital share price target of₹146 with a stop loss of₹135. Sammaan Capital share price after having the strong run up has witnessing a gradual slide with currently once again improving the bias with a positive candle formation on the daily chart and can anticipate for further rise in the coming sessions. The RSI is currently well placed and has shown signs of a reversal to expect for further gains with the volume participation also on the rise and upside potential visible. “With the chart technically looking good, we suggest buying the stock for an upside target of 146 keeping the stop loss at the 135 level,\" said Koothupalakkal. Eicher Motors Ltd:Shiju Koothupalakkal recommends buying Eicher Motors share price at₹7,045 with a Eicher Motors share price target of₹7,450 with a stop loss of₹6,920. Eicher Motors share price has witnessed a strong uptrend in the last 2 months and after a decent consolidation has once again shown signs of improvement with rising volume participation and price action visible to close on an optimistic note to anticipate for further fresh upward move in the coming sessions. The RSI has been maintaining strength and can carry on with the positive move further ahead. “With the chart technically looking strong, we suggest buying the stock for an upside target of₹7,450 keeping the stop loss at the₹6,920 level,” said Shiju. Banco Products (India) Ltd:Shiju Koothupalakkal recommends buying Banco Products share price at₹829 with a Banco Products share price target of₹872 with a stop loss of₹810. Banco Products share price has recently witnessed a series of strong spurt and thereafter, has consolidated with bias maintained positive having significant volume participation visible to form a flag pattern on the daily chart anticipating for another fresh round of momentum in the coming sessions. The RSI has been maintained strong with potential to carry on with the positive move further ahead. “With the chart technically looking good, we suggest buying the stock for an upside target of₹872 keeping the stop loss at the₹810 level,” said Koothupalakkal. Disclaimer:The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-india-us-trade-deal-to-trump-tariffs-8-stocks-to-buy-or-sell-11759073065461.html",
    "original_url": "https://news.google.com/rss/articles/CBMihAJBVV95cUxNMGtHd2JwcEJRUWhWUkNDNUJkX1FEV09xMUJHcFhULUdXN2I4aXRNdzRZYTdzRF8xOEg3d2wyMHRONzBfQTdidkdOaWtSY05RSm1MQTdudGFYOTZqRXFuMHlYNmtLWWdkTEZJcW9DZGIwQ2N1RlE3RGtxSTdGa1pWU2JsM1pVSzVSTElIVWdGWG9kOHZNeEc4d1pLdG5xSHVvLW9mMUZ3bS01alVmdTRBVFA1OHBYekZreTFPbUFIR2w5Y1ZfLXhCNml6YXlIQUw5ZTRRYkdZY0wxaGRIYWRobXgtNVVuSzhISzJMclMzXzZXV3I4NVZkZm05U2lHRGlDN2hiZ9IBigJBVV95cUxPWHl4OHl3YmNwdjBwNGZTYU1kYkhCSkFaRVdvbXNUTXRreUxPU2tESUhYTFJhcVdQbnAwX3MyNGhub3ZaaGVoR2RXdHJEWENpNV9XX2xPV3J3dk42UHR6OHF0V3lXUWVBa1BFU0M1X0F5UGhPTURDdDZQelB5X1NTYi03Vi1PSDRScWdSUDVGV1F0TVhPUk5fWVBFTEhVbEFhZVNDaHEtWHh6S21fQUFvdHBfSUE1aXlVZWVXOGhDRExoNjdHNjFYcGhIbmd3NllIcC10MlRSTGVuYTViaUU1c0pCNl9tVnFKZmJaYjJXdW9OVXRYNnFGQ0FwSDZHUjk3cmZrODVLbkxZdw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 9951,
    "word_count": 1482,
    "gnews_title": "Stock market today: Trade setup for Nifty 50, India US trade deal to Trump tariffs; 8 stocks to buy or sell - Mint",
    "published_date": "29/09/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 India"
  },
  {
    "title": "Stock market today: Nifty50 ends in red; BSE Sensex closes below 80,400",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Rare beauties: 7 creatures with rare and remarkable body patterns 8 psychology tips to influence others and get what you want Best tips to follow if you want good hair growth Kajol’s Durga Puja looks: Timeless festive style over the years Jasmin Bhasin’s Top 10 Glamorous Looks Affordable CNG SUVs under Rs 12 lakh: Maruti Victoris, Tata Nexon and more Anupama Parameswaran glows bright Navratri Day 8: Shraddha Kapoor, Rashmika Mandanna, and other divas inspired peacock green ethnic looks Nivedhithaa Sathish serves striking looks in THESE pics Samantha Ruth Prabhu dazzles in every shade Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-september-29-2025-dalal-street-indian-equities-global-markets-donald-trump-tariffs-h-1b-visa-india-us-trade-deal/articleshow/124203860.cms",
    "original_url": "https://news.google.com/rss/articles/CBMi1wJBVV95cUxPaUhTOW03czVkblZ4LW1hVTZ1UkVWVlVQTjVHU1haYzNfNGNVV19Md2o3eTZxQzAwb1ZWM0JKMTJocURHdUNObDMtZzY0Rmt6aFJLWHZpeUZUb0JfdDFuQnZIUEpxXzkwRFdvMnkwek9pLUd0OWJ6Ui1USTZNbzFtWS0xeTliaDhhSGlxc21FQzBYRUdlSFBiVjIzMEhFMWhCeTlNSlA2WndSaG91NlFTaTVNRGl4bGxhSldaYm9BNkpDTkhNaHBBaHFxSlJJMEhsOXlVb3Q3SjZkYi1rLTFXLTVHem42Q2duUGgyM21nNTI4WVRwWXU0RFhVYjFzM0xEN1F1d0l5bHhPQlc1WThpV3VsM3YtX3dBZFNlRS1fZWRnU3RxSUtKOGNDdWg5YWpvSUszQ0RLQnY0UHVlTUZVY21Zb0tiejl3RDlualNkRUUxUjVNTUg00gHcAkFVX3lxTE9nTV9fS2c1N2dQWkVMZVRaNXJlMGFMcEl3dFI3SVQ4cHVBdmVhaFJaUFVORjk0UmtlUmZfY3VTbFVyM3FjNWRXUVNST1NIRHRwQ19UY2F5MXNYRWVTT0hiQW1iMXdEMVBmVjFoODRQdnotWUdLeXFqcElOMXJxYmdlYUhKR1FRU2xtUDRUdmxfODFic0ZDMHJwWEdjNnVEQ0p5NUplMDJxelctMTdaRENYR2hKT0NkQnlya0p0N1RLcS1UcVg2SHBOdmY1RGI2c1Zzd3dxR3I5RXlYVWNYSzhVeXJkMDFiRHd2V1JIODg1SXZvWHpKS0RnMGhySHN4WGtVYWxFYTA0OVBSRG0tUko4eVZIUUEyV3huWVlVT3ZBOGJLUlJRVFNGV3NrRTBNb3U3b0JETUVMbEc4MXBpTHQxM05KY1lSMG1KZDluTFBETF9zejNSN1M3UlZ3eQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1619,
    "word_count": 256,
    "gnews_title": "Stock market today: Nifty50 ends in red; BSE Sensex closes below 80,400 - Indiatimes",
    "published_date": "29/09/2025",
    "publisher": "Indiatimes",
    "topic": "Nifty 50 India"
  },
  {
    "title": "Stock Market Highlights: D-Street extends slide to 8th day on selloff in IT, FMCG; Sensex falls 97 pts; Nifty flat",
    "body": "Sensex Today | Nifty 50 | Stock Market Highlights: India's heartbeat indices Nifty and the BSE Sensex ended negative on Tuesday, recording their eighth successive loss led by selling pressure in consumer, realty and IT stocks, though auto, banks and metals capped the declines. Trade remained lackluster, with the Nifty moving in a narrow 140-point range and the Sensex confined to 470 points. - Vinod Nair, Head of Research at Geojit Investments - V K Vijayakumar, Chief Investment Strategist at Geojit Investments Ltd Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-30-september-2025/liveblog/124223533.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPVFpSSU13SUF3aFJfTENUY210eXVmNkRpZGVEWGloazFJTXMzZDdTNE1sNkZGZXJoUTFad19CX0RIa0xMYWxhNEdWYnA0cVVGM0ZKa3FSU1E4R19FTmtLajJkXzJKU0RxTElnZjFXMF9DZUIweHFHazlFNTVqdEJvc0FTUlV0amphMXhuWk41dFBnb0pIV0EwMVVsTHoxdlNfa3ZYbnItN1JzODNmbDBjbDUwM3p1dU1LN1dsS0NOdnVzTFJScjdFREo5NVgyRXg2a21oUTlxNUIwUdIB3wFBVV95cUxOb2VieDZJaUNFUXdTX2ZFeC10LWU2dVQtOEpRbERnUTB5TWY5NldwTmpUR1ZQV0Q4U0dXWWRKUDFieWhldS1nRi16WThmRERnbVBFTFlfRDhEVm5ZaHJDOWwtSm1BUzNGQnFEU0lyb0gwUmNhR2V4VkRBTndvX2JUcEZOdy1UV0x4YW1rRHRraEl6S0htTl9zLTZERklpZE1SQXRnajhhYk1BVWMxWGl6RXY5ZlpNQnNTZFhFRmVtMjAzNVZRYjFHM25la2hObExNTWtXZ0pFUWJHRmJRSkU0?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 833,
    "word_count": 135,
    "gnews_title": "Stock Market Highlights: D-Street extends slide to 8th day on selloff in IT, FMCG; Sensex falls 97 pts; N... - The Economic Times",
    "published_date": "30/09/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 India"
  },
  {
    "title": "The Rs 1.5 lakh stock that’s ‘bigger’ than the entire Nifty 50 universe",
    "body": "We have all encountered the familiar sight of a traditional weighing scale at a roadside vegetable vendor or fruit shop. At one end of the scale, weights are gradually added until the beam balances, indicating that the fruits, vegetables, or any other object being weighed matches the exact weight on the other side. This everyday scene got me thinking. What if we could apply the same principle to the stock market? What if we could weigh the price of the highest-priced stock in India, along with the stocks that make up the Nifty 50? MRF – The highest-priced stock in India Which is the highest-priced (costliest) actively traded stock in India? No prizes for guessing, it’s MRF Ltd. MRF brand has become synonymous with tyres. The company is engaged in manufacturing rubber products such as tyres, tubes, flaps, and tread rubber. MRF is a name that resonates beyond the stock market. Iconic cricketers like Sachin Tendulkar, Virat Kohli, Shubman Gill, Brian Lara, and AB de Villiers endorsing MRF bats. ALSO READ China’s export ban is fuelling India’s new gold rush: 3 stocks to watch MRF share price hits 52-week high, here’s why On September 23, MRF’s share price hit a fresh 52-week high of Rs 1,56,400 per share on NSE. Two key factors contributed to this surge: the significant increase in auto sales following the GST cuts, and a recent development at the company’s Tiruvottiyur manufacturing plant in Chennai. The latter saw some employees go on strike regarding issues like the advance payment of annual insurance premiums and the hiring of trainees under various government schemes. MRF termed the strike an “illegal” action and noted in an exchange filing that the plant’s operations were partly continuing with the help of workers not involved in the protest. The company said it is actively working to restore normalcy at the plant as soon as possible. One share of MRF can buy you the entire Nifty 50 stock universe As of 2:15 PM on September 25, 2025, a single share of MRF is trading at Rs 1,50,660 on the NSE. To put this into perspective, when you compare it with the combined price of 1 share of all the constituents of the Nifty 50 , MRF still stands higher. ALSO READ This little-known realty stock is secretly building a Rs 10,000 crore data centre empire The total price of 1 share each of all Nifty 50 stocks is Rs 1,21,004, which includes blue-chip giants like Reliance Industries, HDFC Bank, ICICI Bank, Maruti Suzuki India, and many others. MRF’s market cap vs Nifty 50 stocks’ market cap However, despite its high stock price, MRF’s market capitalisation stands at just over Rs 64,000 crore, which is significantly lower than all the Nifty 50 stocks, barring one. Among the Nifty 50 constituents, only IndusInd Bank, with a market cap of Rs 57,807 crore, has a lower market cap than MRF. Other stocks in the Nifty 50 have market caps exceeding Rs 1 lakh crore. To clarify, market capitalisation refers to the total value of a company’s shares in the stock market, calculated by multiplying the company’s share price by the number of shares in circulation. In simple terms, it’s a quick way to gauge the size or value of a company. Why MRF has become the most expensive stock in India: No stock split, no bonus shares Now, let’s understand how MRF, despite having a relatively low market cap, has become the highest-priced traded stock in the Indian markets. One of the key reasons for MRF’s status as the most expensive traded stock is its approach to corporate actions. Unlike many companies, which split their stock or issue bonus shares to bring the stock price down to a more psychologically appealing level, MRF has chosen not to take such actions. This has led to a lower number of shares in circulation, currently standing at a paltry 30.53 lakh. Shares in float refer to the number of a company’s outstanding shares available for trading in the open market, excluding those held by insiders or restricted. MRF share price performance Over the past decade, MRF’s stock has delivered multibagger returns, with absolute gains of 267.81 per cent, outperforming the Sensex (214.72 per cent) and the BSE Auto index (246.47 per cent). In the past six months alone, MRF has surged by 32.27 per cent, and on a year-to-date basis, it is up by 16.90 per cent. In essence, owning a single MRF share could give you access to the entire Nifty 50 universe, including some of India’s most prominent companies—from Adani and Ambani to Tata and beyond. Disclaimer : The article is for informational purposes only and not investment advice. Dalal Street Investment Journal (DSIJ) is India’s most trusted financial media company, providing expert stock recommendations, market insights, and wealth-building strategies for nearly four decades. To know more about DSIJ, visit here . The website managers, its employee(s), and contributors/writers/authors of articles have or may have an outstanding buy or sell position or holding in the securities, options on securities or other related investments of issuers and/or companies discussed therein. The content of the articles and the interpretation of data are solely the personal views of the contributors/ writers/authors. Investors must make their own investment decisions based on their specific objectives, resources and only after consulting such independent advisors as may be necessary. Read Next ‘What an embarrassment’: Harsh Goenka shares Mumbai airport Garba video, netizens call it ‘idiotic behavior’ 2 Ashish Kacholia multibagger stocks to watch out for in 2025 Govt extended ITR AY 2025-26 deadline, but only 4.56 crore returns filed so far",
    "url": "https://www.financialexpress.com/market/stock-insights/the-rs-1-5-lakh-stock-thats-bigger-than-the-entire-nifty-50-universe/3991734/",
    "original_url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNSHpfQTIzVkVCbndieDFjMmgxV19tZGJxY1BkYkM4UnhDSXg3TXdMdkphR2JrZG0zQ1pTX2NPa0hLYjZrM1hMZzM0VHF6NUVscWpyb240X29jdmtfby14MGxJZWRtazhQcVBzQlk3U2N0d0h5LVhUb3UweWVBakxiZl96OVV4M0Q4OThidmZBaWo5MFZWYzBYWTVWN3NLQXZZTkg3WGdoV3QzRjQtNXlUTWFrbXh2dU5hcndtTXNhLUY4R0NCOHlwb21laks?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5622,
    "word_count": 937,
    "gnews_title": "The Rs 1.5 lakh stock that’s ‘bigger’ than the entire Nifty 50 universe - financialexpress.com",
    "published_date": "27/09/2025",
    "publisher": "financialexpress.com",
    "topic": "Nifty 50 India"
  }
]