[
  {
    "title": "Indian shares post worst day in 4 years as polls show unexpectedly narrow Modi win",
    "body": "Item 1 of 3 People watch results for India's general elections on a screen outside the Bombay Stock Exchange (BSE) in Mumbai, India, June 4, 2024. REUTERS/Francis Mascarenhas/File Photo [1/3] People watch results for India's general elections on a screen outside the Bombay Stock Exchange (BSE) in Mumbai, India, June 4, 2024. REUTERS/Francis Mascarenhas/File Photo Purchase Licensing Rights , opens new tab BENGALURU, June 4 (Reuters) - Indian shares plunged across the board on Tuesday, posting their worst session in more than four years, as voting trends showed Prime Minister Narendra Modi's alliance would fall short of a predicted landslide victory. The NSE Nifty 50 (.NSEI) , opens new tab sank 5.9% and the S&P BSE Sensex (.BSESN) , opens new tab tumbled 5.7%, posting their steepest decline on an election outcome day since 2004. Make sense of global markets with the Trading Day newsletter. Sign up here. The rout comes after the blue-chip indexes surged to record highs on Monday as exit polls had projected a much bigger margin of victory . Reuters Graphics While the Modi-led National Democratic Alliance (NDA) will still likely form the government, analysts said the Bharatiya Janata Party (BJP) winning fewer seats could prevent the government from pursuing an aggressive reform agenda. The Nifty and the Sensex plunged as much as 8.5% earlier, before recouping some losses to end at 21,884.5 points and 72,079.05 points, respectively. The rout was widespread: 12 of the 13 major indexes ended the day lower, while the more domestically focussed small-cap (.NIFSMCP100) , opens new tab and mid-cap (.NIFMDCP100) , opens new tab indexes sank 8%. Advertisement · Scroll to continue \"Markets were at an all-time high, a lot of hope was built up (on BJP's majority) and this will unwind over the next few sessions, said Mayuresh Joshi, Head-Equity Research India, William O'Neil and Company. \"The focus will turn to policy announcements as the reforms will anyway continue with BJP getting an absolute mandate.\" Meanwhile, volatility (.NIFVIX) , opens new tab surged to a 16-month high. TV channels showed the ruling NDA was ahead in nearly 295 seats, while the Congress-led opposition coalition, called INDIA, was ahead in more than 230 seats. 272 seats is the minimum needed for a simple majority in the 543-member lower house of parliament. Advertisement · Scroll to continue Traders said selling by high-frequency traders accelerated the declines and triggered margin calls. The market is witnessing a significant correction due to margin calls as retail investors were carrying heavily leveraged positions, said Rupak De, Senior Technical Analyst, LKP Securities. The build-up in fresh short positions has also added to volatility, said Aniket Nerkar, founder of AlPhaStrat, a firm specialising in trading and investment strategies of derivatives. Advertisement · Scroll to continue Only the defensive fast moving consumer goods stocks (.NIFTYFMCG) , opens new tab gained on the day, rising 1.3%. Half of the eight stocks that advanced on the 50-member Nifty 50 were FMCG stocks. On the flip side, state-run companies (.NIFTYPSE) , opens new tab plunged 16.4% and energy stocks (.NIFTYENR) , opens new tab sank 12.5% to record their worst day ever. Finance stocks (.NIFTYFIN) , opens new tab retreated 7.9%, infrastructure (.NIFTYINFR) , opens new tab sank 10.2% and realty (.NIFTYREAL) , opens new tab plunged 9%, with the trio recording their worst sessions since March 2020. Adani Enterprises (ADEL.NS) , opens new tab and Adani Ports (APSE.NS) , opens new tab sank 19.3% and 21.2%, respectively, the most on the Nifty 50. Other Adani group stocks were down between 10%-19%. Another reason for the fall was the high valuations, with a plethora of stocks near record highs. \"One of the arguments behind India's rich valuations could have been the political stability, policy certainty that a strong government gave. Some of those assumptions could come under question (with this election outcome),\" UBS analysts said in a note. Reporting by Sethuraman NR in Bengaluru; additional reporting by Jayshree P. Upadhyay; Editing by Varun H K and Savio D'Souza Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Read Next 1 hour ago Asian Markets category Sriwijaya Capital raises over $200 million for debut fund, eyes $300 million cap, sources say 2 hours ago Asian Markets category Kumpulan Wang Persaraan targets 30% private market allocation in 5 years 5 hours ago Wealth category Asia draws $100 billion in capital as investors diversify beyond US, Goldman executive says 5 hours ago India category India's September manufacturing growth cools as price rises soar to 12-year high, PMI shows 1 hour ago Business category Oil pauses as markets assess OPEC+ plans, demand concerns 5 hours ago VIEW India central bank keeps repo rate steady as widely expected",
    "url": "https://www.reuters.com/markets/asia/indian-shares-fall-2-vote-count-begins-2024-06-04/",
    "original_url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPOENfVEEyaVNMYTNjcUJWeld2Yk5Rd0xZVTM1cDJSdjVrcUhsTm1VLVVCRFFlQkRyM1dGWXp6LUtzVWdfWEhXNUVvcUY0M2FmNTZSYTIweUI5M2ZBVkJid0VLZFVncW5ZR0JvVWRLeWJKYURWVUpidmg5dDZRUXlpVUNKMHZLTS1yR1dwLVN4UnI?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4954,
    "word_count": 793,
    "gnews_title": "Indian shares post worst day in 4 years as polls show unexpectedly narrow Modi win - Reuters",
    "published_date": "04/06/2024",
    "publisher": "Reuters",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "India stocks see biggest fall for over four years",
    "body": "India stocks see biggest fall for over four years 4 June 2024 Share Save Share Save Getty Images Prime Minister Narendra Modi may have to rely more on allies in forming a government Indian stocks have fallen sharply after vote counting in the country's general election indicated Prime Minister Narendra Modi's party might not be able to form a majority government. The benchmark NSE Nifty 50 share index closed down nearly 6%, its steepest fall since India's first Covid lockdowns in March 2020. Early results suggest Mr Modi's political party may need to rely on allies and form a coalition government. That could lead to uncertainty over economic policies, some analysts said. The NSE Nifty 50, which comprises stocks in various big companies, had plunged 8.5% at one point but ended the day down 5.9% at 21,884.5 points. The S&P BSE Sensex also fell sharply, closing 5.7% lower at 72,079.05. The rupee slid 0.5% against the US dollar, its biggest fall in 16 months. More than half the votes have been counted in India's general election, and Mr Modi's Bharatiya Janata Party (BJP) looks unlikely to secure a majority in the 543-member lower house of parliament. It may have to rely on allies in the National Democratic Alliance (NDA) to form the next government. Analysts suggest that could lead to some uncertainty over economic policies, such as a push for investment, which has been one of the mainstays of the Modi government's rule. \"The key question is whether BJP can retain single-party majority,\" Ken Peng, head of investment strategy, Asia, at Citi Global Wealth, told Reuters. \"If not, then would its coalition be able to deliver economic development, particularly infrastructure?\" Puneet Sharma, chief executive and fund manager at Whitespace Alpha, told Reuters that if the new government is dependent on coalition partners it \"may shift its focus\" to put more emphasis on welfare \"rather than concentrating on reforms during the July budget\". The Hindu nationalist BJP won majorities in 2014 and 2019. Markets had soared on Monday after exit polls over the weekend had suggested Mr Modi and the BJP would gain a significant victory. But it now looks as though the BJP will fall short of achieving a majority by itself. Market analyst Fiona Cincotta told the BBC key Indian stock indexes had been \"really battered\". She added that there had been some \"very big fallers\" in individual stocks, including oil and gas firm Reliance Industries, and Bank of India. Stock markets",
    "url": "https://www.bbc.com/news/articles/cgrrnl93k7lo",
    "original_url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1JUEItdlJWWGFCbVVBYVFHenpkeDk3ck5EdGEwZEpkcldZc1dmbHRhYWpyclU2bld3M2xQSnlXeTJKZDJ0WGE0ZC10SEYtM0JqZTIydm1MZmJOZ9IBX0FVX3lxTE9ZaHVnUmpTdzlpcWNSMFpoTWpFNFRTT3hSMjhnX1VGdG9Pa2VCdUdVRFRZd2QxT1owZXZPbU1IX0w5TUtuUVhZclRaZDJLS1FEQXZSSFVSdWRVMU9BY0RF?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2489,
    "word_count": 413,
    "gnews_title": "India stocks fall on election uncertainty - BBC",
    "published_date": "04/06/2024",
    "publisher": "BBC",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Today Highlights: BSE Sensex, Nifty50 close 3% as bulls stroll back on Dalal Street; all eyes on Modi-led NDA's next steps",
    "body": "Stock Market Live Updates: Top BSE 500 Losers Stock Market Live Updates: Top Sensex 30 Gainers Stock Market Live Updates: All BSE Sensex 30 stocks end in green Stock Market Today Live Updates: BSE Sensex, Nifty50 close 3% up Stock market today: BSE Sensex and Nifty50 staged a smart comeback in trade as bulls returned to the Dalal Street a day after the market mayhem. BSE Sensex ended the day at 74,382.24, up 2,303 points or 3.20%. Nifty50 closed the day at 22,620.35, up 736 points or 3.36%. Stock Market Live Updates: All BSE Sensex 30 stocks in green Stock Market Today Live Updates: When will BSE Sensex, Nifty50 resume their long-standing upward trend? What’s the road ahead for BSE Sensex, Nifty50? Post Lok Sabha election results, investors are concerned about the ability of the Modi government to implement challenging reforms due to its reliance on NDA coalition partners. This fear has overshadowed greed on Dalal Street, with PSUs, smallcaps, and other high-performing Modi stocks bearing the brunt of the market crash.Read full story here: What’s the road ahead for BSE Sensex, Nifty50? Post Lok Sabha election results, investors are concerned about the ability of the Modi government to implement challenging reforms due to its reliance on NDA coalition partners. This fear has overshadowed greed on Dalal Street, with PSUs, smallcaps, and other high-performing Modi stocks bearing the brunt of the market crash. Stock Market Today Live Updates: BSE Sensex, Nifty50 surge in trade Stock market today: At 2:32 PM, BSE Sensex was trading at 74,161.94, up 2,083 points or 2.89%. Nifty50 was at 22,542.40, up 658 points or 3.01%. Stock Market Live Updates: BSE sensex at 2:15pm Are India bonds still a 'buy'? What foreign investors say India's government bonds are expected to remain attractive to foreign investors, despite concerns over potential policy shifts following Prime Minister Narendra Modi's narrower-than-expected victory margin in the recent elections. Although the unexpected election outcome caused a dip in stocks, bonds, and the rupee due to fears of increased populist spending and a slowdown in reforms, fund managers remain optimistic about the bond market.Kenneth Akintewe, head of Asian sovereign debt at abrdn, views the initial response of higher yields and currency weakness as \"an attractive opportunity to add risk.\" He believes that the positive outlook for bonds remains largely unaffected by the election results, particularly given the stronger-than-expected fiscal starting point.Adarsh Sinha, co-head of Asia FX & rates strategy at Bank of America, questions the likelihood of a surge in populist spending immediately after the elections. \"For the government, what would be the incentive to splurge after the election in the near term?\" Sinha suggests that expectations of such spending may be misplaced. (Reuters) The medium-term growth story in India does not change, as strong cycles that have begun are likely to support themselves. The extent and duration of the cycle will become clearer once the new government is sworn in as we look at the 100-day agenda. We retain our modest market returns view for this year with the year-end (Dec 24) target set at 23,500 (remains unchanged). While we see some room for a near-term rebound after Tuesday's sharp correction, the material upside is limited as the fundraising calendar will likely commence after the elections Stock Market Today Live Updates: ‘Indian markets will double in next 5-6 years’ Stock market outlook post Lok Sabha election results: Raamdeo Agarwal, the Chairman of Motilal Oswal, believes in the importance of focusing on the fundamentals rather than getting swayed by short-term market fluctuations in equity investing. He says that long-term investors should maintain their belief in India's solid economic fundamentals and expect the market benchmarks to double in the next 5-6 years.Read full story here: Stock market outlook post Lok Sabha election results: Raamdeo Agarwal, the Chairman of Motilal Oswal, believes in the importance of focusing on the fundamentals rather than getting swayed by short-term market fluctuations in equity investing. He says that long-term investors should maintain their belief in India's solid economic fundamentals and expect the market benchmarks to double in the next 5-6 years. The narrative around ‘Make in India’ is not expected to change but the dynamics may be different as the new reality of the NDA coalition government plays out. However, the pace of execution in policies may slow down a bit so the expectations from infrastructure and manufacturing stocks may be toned down. Stock Market Today Live Updates: BSE Sensex Stocks At 1:03 PM Stock Market Today Live Updates: Short-term volatility likely Prashanth Tapse, Senior VP (Research), Mehta Equities, anticipates that the markets will continue to experience short-term volatility, despite the historic third consecutive victory of the NDA-led BJP government. Given the current circumstances, it is recommended that investors and traders exercise caution and allow the markets to find stability following the unexpected election results. Defensive sectors such as FMCG, Telecom, and Pharma, which are less influenced by government policies, may be a prudent focus for market participants, says Tapse.The upcoming budget presentation and the release of quarterly earnings reports are expected to be significant events that could impact market trends. There is concern regarding the potential repositioning of FIIs and the resilience of DII investments in the near term. From a technical perspective, the market's upside potential appears limited in the short term, while the downside may unfold gradually. The crucial level to monitor is the 21,000 mark; a close below this psychological threshold could trigger further selling pressure, potentially pushing the market down to test the 20,200 level, he was quoted as saying by ET. Stock Market Today Live Updates: Railway stocks take a hit! Railway stocks today: Railway shares have plummeted by up to 33% over the past two days, as the narrow victory of Prime Minister Narendra Modi's alliance has sparked concerns about policy continuity.Read full story here: Railway stocks today: Railway shares have plummeted by up to 33% over the past two days, as the narrow victory of Prime Minister Narendra Modi's alliance has sparked concerns about policy continuity. Stock Market Today Live Updates: How New Government Will Face Key Policy Issues Geopolitical uncertainties and the global economic situation may require acceleration of reforms. But with a coalition govt at the Centre, it may not be easy as some issues, such as privatisation and a relook at GST, need consensus. TOI lists top areas of focus:GST revamp: Five-slab GST rate structure may not be reviewed immediately as it may require merging the 12% and 18% slabs, necessitating an increase in levies on goods and services that move into the higher bracket. That's an issue on which political consensus may not be easy.Public Finances: Privatisation is likely to be put on a back-burner for some time. While RBI's mega dividend of Rs 2.1L crore and robust GST revenues will keep Centre's finances in good shape, the Centre may have to go slow on cleaning up the subsidy regime further, although greater use of technology to plug leakages is something that won't change.Investment push: After hitting a high of $85 billion in 2021-22, the annual inflow of foreign direct investments has fallen for two consecutive years, touching $71 billion in 2023-24. Govt is expected to make the investment regime more attractive in several sectors, including electric vehicles and artificial intelligence.Food prices: Although overall inflation has moderated (see chart below), food prices remain both volatile and high. Govt may take steps to weatherproof prices and shield it from climate-induced shocks such as heatwaves and floods.Agriculture: The latest GDP data indicates a relative stagnation in the farm sector. Reforms focusing on irrigation and use of Al to raise productivity are expected. Election results point to the challenging but imminent need to raise farmers' income.Exports & PLI: The production-linked incentive (PLI) scheme has helped push exports of smartphones and other products but there have been demands to extend it to more sectors, such as toys and footwear. Expect fine-tuning of PLI to focus more sharply on companies and sectors willing to shift out of China for export production.Regulatory clarity: Before the poll dates were announced, several new economic legislations were in the works. A better regulation of cryptocurrencies, Al, data protection is under consideration.Maintaining growth: Most economists do not expect 2024-25 GDP growth to be a repeat of 8.2% growth in 2023-24. But ensuring a growth rate of even 7% in the current global economic environment won't be easy. Among the steps expected are a road map for energy transition and a push for infra investments. Economic ministries have made action plans with specific targets for 2030 and 2047. A ministry-wise action plan could be unveiled, if there is a consensus in the new govt. Stock Market Today Live Updates: Top Nifty50 Losers Stock Market Today Live Updates: Top Nifty 50 gainers Stock Market Today Live Updates: BSE Sensex surges over 2% Stock market today: At 11:37 AM, BSE Sensex was trading at 73,698.41, up over 1,600 points or 2.25%. Nifty50 was at 22,397.00, up 512 points or 2.34%. Stock Market Today Live Updates: BSE Sensex zooms over 1,200 points Stock market today: At 11:09 AM, BSE Sensex was trading at 73,332.15, up 1,253 points or 1.74%. Nifty50 was at 22,287.75, up 403 points or 1.84%. Stock Market Today Live Updates: PSUs had become market favourites Shares of many public sector companies had recently become market favorites. In the past year, BHEL, Cochin Shipyard, Mazagon Dock Shipbuilders, Hindustan Aeronautics, REC, and Power Finance Corporation have delivered returns ranging from 150% to 550%. This surge has also led to higher valuations for these stocks. Stock Market Today Live Updates: How Indian markets compare globally India's one-year forward earnings multiple of 21.27 is the second highest, trailing only Japan.Read full story here: India's one-year forward earnings multiple of 21.27 is the second highest, trailing only Japan. Stock Market Today Live Updates: Markets in wait and watch mode Stock market today: At 10:41 AM, BSE Sensex was trading at 72,541.78, up 463 points or 0.64%. Nifty50 was at 22,040.15, up 156 points or 0.71%. Stock Market Today Live Updates: How PSU stocks reacted on June 4 Stock market crash: The stock market experienced a significant downturn on Tuesday, with public sector enterprises (PSUs) bearing the brunt of the losses. Investors expressed concerns about the future prospects of these companies following the Bharatiya Janata Party's failure to secure a decisive majority in the general elections. The market had anticipated that a strong BJP-led government would be crucial for further gains in PSU stocks. However, the election outcome has raised doubts about the government's ability to effectively revive state-owned companies during its third term.The BSE's PSU index suffered its worst single-day losses, plummeting by 15.7%. Several PSU stocks were hit particularly hard, with Power financier REC leading the pack with a 24% slump. Other notable losers included Power Finance Corporation, Container Corporation of India, Bharat Electronics, BHEL, and SAIL, all of which saw their stock prices drop between 18-22%. The majority of PSU stocks experienced declines exceeding 10% during the trading session. The market capitalisation of PSUs collectively lost ₹10.62 lakh crore in a single day.Vinit Sambre, Head Equities at DSP Mutual Fund, commented on the market reaction, saying, \"Over the last 18 months, the valuation gap between the PSU and their private counterparts had been narrowing as a result of massive rerating fuelled by optimism surrounding the BJP's development agenda. However, the unexpected election result has affected this narrative, leading to a swift unwinding of the positive sentiment that had been built up.\" Stock Market Today Live Updates: Pace of reforms to not slow down? Morgan Stanley's Riddham Desai has shared his insights on the recent election verdict and its potential impact on the Indian equity markets. According to Desai, the firm's medium to long-term views remain unchanged despite the outcome of the elections.He expects both realized and implied volatility to decrease in the coming days, suggesting a more stable market environment. However, Desai points out that the equity markets have not yet priced in the possibility of \"unresolvable disagreements within the NDA coalition,\" which could potentially lead to some uncertainty.Despite this, Desai believes that the pace of reforms is unlikely to slow down following the election results. He also expresses confidence that the government will continue to prioritize macro stability as the foundation of its economic policy, rather than sacrificing it for short-term gains. Stock Market Today Live Updates: ‘Markets will take time to recover’ According to Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services, the unexpected election outcomes will require some time for the market to digest. Although stability is expected to be restored in the near future, fluctuations will persist until there is transparency regarding the cabinet and crucial portfolios. In the short term, a significant market recovery is improbable, but sector-specific preferences may shift. Industries such as FMCG, healthcare, and IT will gain increasing favor, while momentum plays will decelerate, he said.The sharp market correction has one advantage: it has slightly reduced the excessive valuations, which will encourage institutional buying once the cabinet's formation and composition are clarified.Investors can begin accumulating high-quality largecaps in sectors such as IT, financials, autos, and capital goods, he says. Stock Market Today Live Updates: Sensex, Nifty pare initial gains Stock market today: After rising over 650 points, Indian markets pared initial gains on Wednesday. At 9:49 AM, BSE Sensex was trading at 72,142.00, up 63 points or 0.087%. Nifty50 was at 21,906.35, down 22 points or 0.100%. Sectors (PSUs and nonPSUs) that previously enjoyed inflated valuations due to expectations of strong reform-driven growth may experience some downward pressure on valuations Stock Market Today Live Updates: What’s the road ahead for investors? Mahesh Nandurkar from Jefferies shares his insights on the potential outcome of the elections and its impact on various sectors. He maintains that the most likely scenario is a coalition government with Narendra Modi at the helm.Despite the uncertainty surrounding the elections, Nandurkar remains optimistic about the housing-led capital expenditure cycle. He believes that any extreme market reactions to the election results could present a lucrative buying opportunity for investors, according to an ET report.According to Nandurkar, large-cap stocks that have underperformed in the recent past offer the most attractive risk-reward ratio. He particularly favors private banks, consumer staples, and automotive original equipment manufacturers (OEMs). However, he has reduced his overweight stance on real estate, industrials, and public sector undertakings (PSUs). Stock Market Today Live Updates: Top Losers on BSE Sensex 30 Stock Market Today Live Updates: Top Gainers on BSE Sensex 30 PSU stocks were cheaper in the 2019-2020 period and but now valuation have run up significantly in the entire PSU pack, barring few Stock Market Today Live Updates: BSE Sensex stocks at 9:22 AM Stock Market Today Live Updates: Markets open in green Stock market live: Indian equity benchmark indices saw a positive start to trading on Wednesday after the market mayhem on Tuesday when Lok Sabha results showed Modi-led NDA securing lesser than predicted seats. At 9:17 AM, BSE Sensex was trading at 72,723.13, up 644 points or 0.89%. Nifty50 was at 22,070.90, up 186 points or 0.85%. Stock Market Today Live Updates: BSE Sensex, Nifty50 rise in pre-open Stock Market Today Live: BSE Sensex has rise almost 950 points to 73,027.88, up 1.32% in pre-open. Nifty50 has risen 1.11% to 22,128.35. Stock Market Today Live Updates: Check out the stocks in news today Stock market crash: The domestic markets experienced a significant intraday decline yesterday, the largest in over four years, as the election results indicated the NDA's return to power but with a reduced majority. Today's trading session will focus on various companies, including Tata Motors, Wipro, RIL, SJVN, NTPC, and Canara Bank, due to recent developments.SJVNanticipates its 900 MW Arun-3 hydro-electric project in Nepal, currently under construction, to commence power generation from the following year, as approximately 75% of the work has been completed.PSU stockswill remain in the spotlight today following a significant sell-off on Monday, which was triggered by the NDA securing a lower-than-expected majority in the Lok Sabha elections.Tata Motors' board has given the green light to establish a wholly-owned subsidiary, proposed to be named TML Commercial Vehicles Ltd (TMLCVL), to manage its commercial vehicles business.RIL, a major constituent of the Nifty50 index, will be closely watched today after the company's investors lost around Rs 1.27 lakh crore on Tuesday.Wiprohas partnered with Zscaler to introduce \"Wipro Cyber X-Ray,\" an AI-assisted decision support platform.Infosyshas announced a collaboration with Nihon Chouzai (TSE) to expand healthcare access in Japan by enhancing online medication guidance services.NTPCis reportedly planning to venture into the nuclear power sector by establishing a 10 GW capacity with an investment of Rs 1.5 lakh crore over a 10-year period.Canara Bankhas reportedly initiated the process of seeking regulatory approval to convert its software services subsidiary into a non-banking finance company. We are of the view that the current market texture is extremely volatile and uncertain; hence, it is advisable that traders should remain cautious for next few trading sessions Stock Market Today Live Updates: What should investors do? Stock Market Today Live Updates: What’s happening in global markets? On Tuesday, U.S. stocks experienced a modest increase following the publication of weaker-than-expected labor market data. This information strengthened the notion that the Federal Reserve may soon lower interest rates. The data released on Tuesday showed that U.S. job openings in April fell to the lowest level in more than three years, suggesting a softening of labor market conditions. This development is consistent with the anticipated Fed rate cut in the near term. As a result, U.S. Treasury yields declined after the report's release.In early Asian trading on Wednesday, oil prices continued to slide slightly from the previous session after an industry report indicated increases in U.S. crude and fuel stockpiles. This news further exacerbated concerns regarding demand growth. Brent crude futures fell 14 cents, or 0.2%, to $77.38 a barrel by 0005 GMT. U.S. West Texas Intermediate crude futures fell 18 cents, or 0.3%, to $73.07 a barrel. Stock Market Today Live Updates: What GIFT Nifty signals Gift Nifty (formerly SGX Nifty) indicates a positive openingNifty futures on the Gift Nifty rose by 103 points, or 0.47%, to trade at 22,050 The markets are pricing the risk associated with this scenario, and the potential impact of a shift toward socialist policies by the government, thus leading to a sell-off, We would like to see the incoming govt continue to create a favourable environment for four growth factors: increased foreign direct investments into the country, private capex, continuation of govt capex and better infrastructure, both social and physical Stock Market Today Live Updates: Budget to be keenly watched Investment professionals hold the view that capital expenditure, undertaken by both the government and private enterprises, plays a crucial role in driving economic growth. They emphasize the importance of private sector investment, which has been significantly lacking in recent years, and stress that it should either supplement or complement the government's capital expenditure efforts.Given India's favorable macroeconomic fundamentals, fund managers believe that any positive developments on the global stage could provide additional support to the domestic economy. These potential tailwinds include improving macroeconomic conditions in China and interest rate reductions in the United States.The upcoming Budget for the fiscal year 2024-2025 is expected to be a key determinant of the future trajectory of the Indian economy and financial markets. Market participants will closely monitor the budget announcements and their potential impact on various sectors and overall economic growth prospects. Stock Market Today Live Updates: Development agenda to continue? Stock market crash: According to Vinit Sambre, head (equities), DSP Mutual Fund, “There is a bit of uncertainty as investors are concerned about the slowdown of reforms that had been initiated under the (outgoing) BJP-led govt. This has triggered a correction in the markets as investors reassess the outlook under the new political landscape. We would like to believe that the development agenda that spurred the performance of equity is likely to persist, irrespective of the party in power.” The election result is likely to lead to a more balanced market. Risk-reward in large-caps and underperforming sectors like banking and consumer appear more favourable. There is likely to be greater scrutiny and valuation discipline in the performing sectors like capital goods, power, defence and manufacturing Stock Market Today Live Updates: Raging bull market to be reined in? Stock market live updates: Fund managers in India are hopeful that the new government will maintain the current momentum of economic reforms and policies that support the industry. They anticipate that the BJP-led alliance, despite having a reduced mandate, will persist with the initiatives and projects initiated by the previous government. This sentiment prevails even amidst the apprehension that gripped investors following the announcement of the Lok Sabha election results on Tuesday.Furthermore, financial experts believe that the election outcome, which is seen as a setback for the ruling alliance but a significant boost for the opposition, has the potential to temper the surging bull market in India and bring valuations to a more reasonable level. Most believe that even though the BJP-led alliance now has a depleted mandate, it would continue the works and projects launched under the outgoing govt. Stock Market Today Live Updates: Adani stocks take a severe beating Stock market crash: The stock prices of all 11 Adani Group companies plummeted on Tuesday, resulting in a staggering loss of Rs 3.6 lakh crore for investors. The crash was attributed to the reduced mandate for the BJP-led NDA coalition. Since Prime Minister Modi took office in May 2014, opposition parties have claimed that the Adani Group has gained the most. Investors speculate that a weakened NDA mandate could cause the group to lose its competitive edge. Additionally, the group would face increased scrutiny from a more powerful opposition.According to dealers, these factors contributed to the decline of Adani Group stocks in Tuesday's crashing market. BSE data revealed that the group's combined market capitalization dropped from Rs 19.4 lakh crore on Monday to Rs 15.8 lakh crore as stock prices of Adani Group companies plunged during the day.The group's flagship company, Adani Enterprises, led the decline with a 19% crash, eroding its market cap by Rs 80,416 crore. Adani Ports, which will soon join the sensex, lost nearly Rs 72,800 crore, or a fifth of its market value, bringing its current level to Rs 2.7 lakh crore. Other group companies also suffered significant losses, with Adani Green Energy losing nearly Rs 62,000 crore and Adani Power losing about Rs 58,300 crore in market value. Stock Market Today Live Updates: What happens to IPO launches? India has secured the second position in the global IPO market, raising $4 billion in the current year. With the NDA expected to form the next government, the IPO boom is likely to continue throughout 2024 due to anticipated policy stability. Although the amount raised by India is 45% lower than the total collected in 2023, according to LSEG data, it surpasses China ($3 billion) and Saudi Arabia ($2.1 billion). India's IPO proceeds also exceed the combined amount raised in Turkey, Hong Kong, and South Korea. The US remains the top IPO market, having raised $14 billion so far in 2024, as per LSEG. India has climbed from the 11th position in 2019 to the third place globally in terms of IPO proceeds, following the US and China in 2023.Between January and the present, India has witnessed 113 IPOs. Mahavir Lunawat, MD at investment bank Pantomath Capital Advisors, said, \"Amidst general elections, the primary market remained vibrant with the solid response to certain IPOs like Awfis Space Solutions. Confidence can be gauged by these offerings that have been launched amidst elections... Looking ahead, the market is set to witness a flurry of IPOs, from new-age business as well as from conventional business segments.\"Several prominent companies, including Hyundai Motor India, Tata Capital, Ola Electric Mobility, Swiggy, and NSDL, are planning to launch their IPOs in the near future. Stock Market Today Live Updates: ‘Investors to focus on government formation’ According to UBS, “After a weak political outcome, we believe investors will focus on govt formation and the choice of prime ministerial candidate considering the BJP does not have a simple majority of its own.” The other focus areas would be “policy choices to support growth vis-a-vis ensuring macro stability, and the reform narrative”.UBS analysts said they would watch out for upcoming union budget announcements, implementation of labour laws and the next set of reforms in land and capital.“This was not an election outcome the market valuations were set up for. Indian valuations have been expensive for pretty ordinary corporate earnings growth/outlook. One of the arguments behind India’s rich valuations has been the political stability/policy certainty afforded by a strong govt. Some of those assumptions could now come under question,” the report by UBS said. Stock Market Today Live Updates: What will be the market reaction - immediate and long-term? Stock market live updates: According to Pradeep Gupta, Co-founder & Vice-chairman, Anand Rathi Group, the Indian stock markets experienced significant volatility in response to the 2024 Lok Sabha election results with broader indices, Nifty 50 closing the day at -5.93%, with the lowest of the day touching -8.19%. Here are the key reactions and insights based on recent market movements and expert analyses by Anand Rathi.•Immediate Market Reaction:The markets saw heightened volatility due to the uncertainty surrounding the election outcomes mainly due to the gap between the exit polls and the actual results declared today. The pre-election rally witnessed yesterday, driven by expectations of a BJP victory, had already been factored into market prices. Till the question of the continuity of the current government was at an unsure position, the markets continued with heightened volatility in the short term period.•Long-Term Outlook:Historical data suggests that despite initial volatility, markets tend to recover and even thrive in the longer term. For instance, even after the 2014 and 2019 elections, the Indian stock market saw significant gains in the months following the election results. Investors are advised to focus on long-term strategies, such as maintaining a diversified portfolio and avoiding panic selling. Strong fundamentals and resilience against political changes are crucial for navigating market volatility.•Sectoral Impact:Sectors like infrastructure, defence, and capital goods are expected to benefit from policy continuity and government focus on development projects.Large-cap stocks are preferred for their stability and resilience against economic fluctuations. In summary, while the immediate market reaction to the election results has been volatile, the overall long-term outlook remains positive, particularly if policy continuity is maintained. Investors are encouraged to stay informed, focus on fundamentals, and be prepared for short-term fluctuations. NITISH AND NAIDU SHOULD BE VERY CAREFULL AND SHOULD NOT ALIGN WITH INDI GROUP AS THEY HAD A VERY BAD EXPERIENCES IN THE PAST BECAUSE OF THE PRESENCE O... Sensex will cross 100000 very soon.. The trends yesterday panicked the investors but now they have the solace that BJP will form the alliance government and Ada-Amba will continue to flou...",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-live-updates-today-5th-june-bse-sensex-nifty50-pm-modi-stocks-status-lok-sabha-election-2024/liveblog/110717151.cms",
    "original_url": "https://news.google.com/rss/articles/CBMilwJBVV95cUxOMlRhdG9MOG1CVVFXeThJcl9RZ21FSGVtTUpobWtVQXpkRFFtTTBzVmNUSXhIa1E1UmRzemZhUy1EVEtuTFBuZzhVSVVTbHJsZV9vRnlCSEF2QjJjVE44VE9jZTlRNjN0TzRhTDE3bjRqaWZoMnFkWXAtM3RIb1V2ZVRrcTFta25GYjdiNGZZeGNvVGhFeF9tWUJZRmZzaC1COEU4ZjJsS3FtemlUTFMtTHhKNFlERzkyNXUxX1VEY1h2cTJOSnlPdi1oNlVUeWRONzBYak5zZldFX2hJZ2xIenN0Z3ZLc3JndEVHOUZ5ZzNRenA4X3pDYWVUWWx0bTlMcDVTcTY5M1ZkcGtsc3c5a1I1VkNjWjTSAZwCQVVfeXFMUHY4eXEyeE4yR0dxNk1TVnN4NDBNclBxdDN2R0dOeUhab1h3OXU4Z05Ob0VkQmdmUUdMMndLcTM4SXVYT0ZzS25UVEU4Q01iWkhuaHpDRnV0Q1Fxb3d2SmZKQ1NPd1N5SllwXzRBV281eU1GVlFCQzhDUS1OSDhLSXVMUW01SkkwR082SEZ3Tko0REFXYVVOVWNOYk9QS0cwakRnVGdTU01ZS3psNGI5RUlrWmtXbFdMdHo4UVlodG5BdjVrbVhZWHA4ODFQemFiMC1oaWo4X1NFUWdzcS1mZElHNDlJS0JnWHk4VEtlck9wR18yVndXckQ2SkpCT0hKQ2lDeE5vWWlqNUUtLTRuU2xwRFR4SDExX0MtVXg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 29230,
    "word_count": 4506,
    "gnews_title": "Stock Market Today Highlights: BSE Sensex, Nifty50 close 3% as bulls stroll back on Dalal Street; all eyes on Modi-led NDA's next steps - The Times of India",
    "published_date": "05/06/2024",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50 outlook: 4 key reasons why Indian stock market may fall 5-10%; Emkay lists 5 stocks to avoid",
    "body": "Nifty 50 outlook: Indian stock market benchmarks may see a significant correction of 5-10 per cent in the near term, while the mid and small-cap segments may suffer more. However, the long-term prospects of the Indian stock market remain positive and a meaningful correction could be an opportunity to buy stocks, according to brokerage firm Emkay Global Financial Services. \"We see the risk of an imminent 5-10 per cent correction in the headline indices, with bigger drawdowns inSMID(small and midcap) stocks. We remain constructive on India from a longer-term (more than 1one year) perspective and would use a meaningful correction to increase exposure to the market,\" said Emkay. The brokerage firm pointed out that the market'svaluationis stretched, and most variables are already priced. The Q1FY25 earnings are expected to remain tepid, and rate cuts in the US may start only at the end of the year. After a 1.1 per cent fall in the previous session, market benchmark Nifty 50 opened 0.3 per cent lower at 24,445.75 on Monday, July 22, and slipped further by 0.7 per cent to a level of 24,362.30. However, the index reversed losses and moved up soon, thanks to support from select heavyweights such asHDFC BankandInfosys. Around 11 am, the index traded 0.2 per cent up at 24,575. Emkay Global highlighted the following four key reasons why the Indian stock market could see a correction: Emkay expects policy continuity in the Budget. It said fiscal deficit should be maintained at about 5-5.1 per cent of GDP, with a focus on capital expenditure (capex) over revenue expenditure (revex). \"We see little risk of a pivot to increased welfare spending, despite the pressures of a relatively adverse election result and the loss of absolute majority for the BJP. The₹2.1 lakh crore windfall from the RBI dividend gives the government increased degrees of freedom on both, pursuing fiscal prudence and pushing capex,\" said Emkay. \"We would, however, watch for forward movement on privatization (unlikely) and asset monetisation (more likely). There is an outlier probability of negative changes in the capital gains regime, which could trigger a strong sell-off and prolonged sideways market after that,\" Emkay said. The brokerage firm emphasized that the market seems complacent about the changed political landscape, posing a risk if the upcoming assembly elections yield unexpected results. \"Though the government remains stable, there could be adverse events (like a possible NDA defeat in the upcoming Maharashtra assembly elections) that could exacerbate uncertainty,\" said Emkay. Emkay observed that the growth in FY24 PAT (profit after tax) was led by a 275bps improvement in EBITDA (earnings before interest, taxes, depreciation, and amortization) margins (BSE-500, excluding financials). This is now in the base. \"For financials, upward normalisation of credit costs could dampen PAT growth. This is partly reflected in the FY25 Nifty EPS (earning per share) growth slowing to 16.5 per cent (FY24: 18.2 per cent). While the forecasts have little downside risk, upgrade potential also looks dim,\" said Emkay. \"A weak Q1 owing to stretched valuations and a strong lead-up stock-price rally could trigger a correction. The manufacturing sector, overall, is a little more exposed to this risk than the services sector. Tech would be most immune from this trend,\" said Emkay. Emkay expects the tight monetary conditions to persist till end-2024. \"Our base case is that the Fed starts cutting rates in Q4CY25, with significant risks of further delay. The RBI is likely to be in lockstep (by choice if not by necessity), with little chance of a rate cut until inflation is firmly in the comfort zone of nearly 4 per cent,\" said Emkay. \"Domestic liquidity conditions have eased somewhat, but we expect active RBI interventions to ensure no rate cut by stealth. Therefore, the rally in banks could fizzle out as expectations of easier monetary conditions ease. For investors wishing to position themselves ahead of the year-end rate cuts, the best sectors would be autos, real estate, and technology – this, however, could take more than six months to fructify,\" Emkay said. Emkay underscored that the post-election rally has shot up the valuations of the Indian stock market. \"The Nifty, at 21.4 times one-year forward PE, is 10 per cent above the five-year historic mean. Valuations for the NSE Midcap 150 (42 times trailing PE) and NSE smallcap 250 (31 times trailing PE) are also 52.5 per cent and 35.5 per cent, respectively, above the five-year averages. Even accounting for the strong growth outlook, we see these valuations having some front-ended future returns and setting up the market for a one-time correction,\" said Emkay. \"Only meaningful upgrades in forward estimates could support such elevated multiples, and we do not see that in the next one to two quarters,\" Emkay said. HDFC Bank, SBI Cards, PI Industries, Eicher Motors and L&T Technology Services are the stocks in the \"key avoids\" list of the brokerage firm. Emkay is underweight on financials and said even as the market adjusts to new growth or ROE (return on equity) reality, there is scope for derating in HDFC Bank and SBI Cards \"We initiate a key avoids list. Our underweight financials are reflected via HDFC Bank and SBI Cards, as we see derating in both stocks even as the market adjusts to a new growth/ROE reality,\" said Emkay. The brokerage firm has added Eicher to the list as it prefers Hero and TVS, given product positioning and valuations. Emaky said L&T Technology Services, at 40 times PE, is at an unwarranted premium to large-cap IT services names, especially with a looming weak FY25 (5 per cent EPS grwoth). PI Industries is the fifth stock: the sub-5 per cent EPS growth for FY25 and FY26 is not yet reflected in the 33 times PE ratio. Emkay's model portfolio includes TVS Motor, Hero MotoCorp, Dabur, HUL, IndusInd Bank, Axis Bank, UltraTech Cement and IndiGo among the top stocks to buy. Suprajit Engineering, Honasa Consumer and Senco Gold are among Emkay's top recommendations from the small and midcap segments. Read all market-related newshere Disclaimer:The views and recommendations above are those of individual analysts, experts, and brokerage firms, not Mint. We advise investors to consult certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-outlook-4-key-reasons-why-indian-stock-market-may-fall-5-10-emkay-lists-5-stocks-to-avoid-11721626008378.html",
    "original_url": "https://news.google.com/rss/articles/CBMi_AFBVV95cUxNSS1vX2puYnB2R2l1SUxDT1dMdkZ1elRTZFNlajFhc1ZZb0tmeGpHckc4cUIwWEFoRWVzSEhuanFvQnE2eExYM0pFVXM0b1pwaFFteFVsOFRPbGpzM0pCNUlTRnN0UWVxVDNNYV9GenBjMEJaNmVzX1JEeGRJdWdyRjRZcU1WSU0zV2JaXzU0MEJ3c01QWHJFSUY5ZWNMZml2UkxUMzI1VzNfWWl1X1VNdzctcF8yLXVnOVpaaGtHNC1ibWZhaGxnTzg5UnF0YzUtcU9DTHdQdU5ZeDhENDVTZm80RE94UFJYbmQ0dHlwOGk5OF9kWlBNdXZUd1HSAYICQVVfeXFMTWQzZ1FkMDhBbElfZzdSWEJHcTFaM0liYjVqRUNfakVYSzl4TXM2NFdHMmx5S196a0JVS3QtaFhRR3RHcXMzcUVMWUlReG0tSmdRWU1yU19FTnVqVExoQmpvQzdxRFFIRmE5TjlVZFBqQzVQVk1NZzJOSnJZUjItSnE3cXBjWEtTdDBtMU5ESTRzQW9Bd3lkV3RZMVlXc0ZuQWhQOFlnd1JsUWxnS1dXNGdzY2lDX2ZzSzl4Vml6QTY3SmNkUFlZV2NhcTM1U1BwYU5faUhnY1Y1a0ZuYzhrdXQwN0Y4dXI0YkFjQVVteEVYejlFLU9uaU9hbTVieE55MEtB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6583,
    "word_count": 1062,
    "gnews_title": "Nifty 50 outlook: 4 key reasons why Indian stock market may fall 5-10%; Emkay lists 5 stocks to avoid - Mint",
    "published_date": "22/07/2024",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "ANALYSIS: Indian equity index options go from strength to strength",
    "body": "We value your privacy We use cookies to enhance your browsing experience, serve personalised ads or content, and analyse our traffic. By clicking \"Accept All\", you consent to our use of cookies. We use cookies to help you navigate efficiently and perform certain functions. You will find detailed information about all cookies under each consent category below. The cookies that are categorised as \"Necessary\" are stored on your browser as they are essential for enabling the basic functionalities of the site. ...Show more Necessary cookies are required to enable the basic features of this site, such as providing secure log-in or adjusting your consent preferences. These cookies do not store any personally identifiable data. Functional cookies help perform certain functionalities like sharing the content of the website on social media platforms, collecting feedback, and other third-party features. Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics such as the number of visitors, bounce rate, traffic source, etc. Performance cookies are used to understand and analyse the key performance indexes of the website which helps in delivering a better user experience for the visitors. No cookies to display. Advertisement cookies are used to provide visitors with customised advertisements based on the pages you visited previously and to analyse the effectiveness of the ad campaigns. Other uncategorised cookies are those that are being analysed and have not been classified into a category as yet. 24th July, 2024|Luke Jeffs FOW Data shows Asian exchanges traded 40.699 billion contracts in the three months to the end of June, which was up 106% from the second quarter of last year and 4% higher than the first three months of 2024. Asia continues to drive growth in the global futures and options industry, with Asian trading volumes breaking 40 billion lots in a single quarter for the first time. FOW Data shows Asian exchanges traded 40.7 billion contracts in the three months to the end of June, which was up 106% from the second quarter of last year and 4% higher than the first three months of 2024. June was the second busiest month on record for Asian futures and options exchanges, reporting 13.96 billion lots, which was up 99% on June 2023 and down 6% on May’s record of 14.857 billion contracts traded, FOW Data shows. Chart One: ASIAN FUTURES AND OPTIONS TRADING VOLUME The main drivers of growth in Asia are a handful of Indian equity index options contracts, listed on Mumbai’s National Stock Exchange of India and Bombay Stock Exchange, which currently host the six most-traded listed derivatives globally. The top contract in Asia and globally last month was the National Stock Exchange of India’s Nifty Bank index option which traded in June 4.208 billion contracts, which was up 65.6% on the same month in 2023, according to FOW Data. The NSE bank index option traded 12.071 billion lots in the second quarter, which represented an increase of two-thirds on the same quarter last year and a decline of 15.6% on the previous quarter, an all-time record for the Indian contract. The contract had open interest of 6.56 million lots at the end of June. The NSE Nifty Bank index option took in June top spot from NSE’s other main index option contract, the Nifty 50 index option. The Nifty 50 index option on the Indian blue-chip standard traded 4.112 billion lots last month, according to FOW Data, which was up 138.7% on June 2023, albeit down slightly from the trading record for the product in May. In the second quarter, the options contract was up 45.5% on the previous three months. This rapid increase was the main driver for the increase in overall Asia volumes in Q2. The open interest on the NSE Nifty 50 option was 10.35 million lots at the end of last month, according to FOW Data. Chart Two: NATIONAL STOCK EXCHANGE OF INDIA’S NIFTY BANK AND NIFTY 50 OPTIONS The two largest Indian index options contracts jointly contributed an extra 4 billion lots to the Asia June volumes compared to June 2023 and an additional 11.5 billion lots to the second quarter totals versus the same period last year. Another key factor in the Asian quarterly volume record has been the success of Bombay Stock Exchange’s S&P BSE Sensex equity index option, which references the oldest Indian index, made up of 30 of the largest and most liquid Indian blue-chips listed on the BSE. The S&P BSE Sensex equity option, which has emerged as the world’s third most popular listed derivative just over a year after launching in May 2023, reported 1.971 billion lots traded last month, which was more than 58 times the total in June last year but 14.2% below the previous month’s record of 2.297 billion lots. The BSE equity index option traded 5.853 billion lots last quarter, according to FOW Data, which was more than 175 times the volume in the second quarter of last year. Compared to the two larger NSE equity options contract, the BSE S&P Sensex equity options’ relatively low open interest of 42,650 lots suggests retail traders make up the vast majority of the activity in this market The fourth most-traded contact in Asia (and the world) is the National Stock Exchange of India’s Nifty Financial Services equity index option, which traded 1.264 billion lots in June, up 8.5% on the same month last year and 0.8% on the preceding month. The fifth most popular listed derivative is the S&P Bankex equity option on the BSE, which traded 617.4 million lots last month after launching in May last year, and sixth on the list is the NSE Nifty Midcap Select equity index option. The remainder of the global top ten list comprises three Brazilian futures traded on B3 and CME’s three month SOFR futures contract. Rutesh Durve, director of Business Development and Relationship Management at Nuvama Asset Services, told a FOW conference in April that, while India is perceived as complicated and difficult to access, there are different routes to market such as trading through an onshore broker or an international firm that has a presence in India. Durve said: “At some point, India becomes large enough that you need someone onshore.” FOW will host on September 19 2024 the fourth edition of its flagship Indian conference in Mumbai. To find out more about the event,please click here.",
    "url": "https://www.fow.com/insights/3701950-analysis-indian-equity-index-options-go-from-strength-to-strength",
    "original_url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOUklRUVV3V0lkV1lYRlkyWkFDUnExVmU0TkljQ2xaSGJRSmoxYzRoZlMtRjhCcmpwTnRtWjBOTEhoMGpleGxNUW9KbFUxUDVGRkhETE9MVHhROTZNdXVYajd6c2pwbktFdk12QVVFdFNVVi1ZTlh4RGhBcHZPV01rMlNSTGk5X245Rm9rUmd6ajBWRFg4QkxBTUxHanZUeXZnVFBueQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6380,
    "word_count": 1068,
    "gnews_title": "ANALYSIS: Indian equity index options go from strength to strength - Futures & Options World",
    "published_date": "23/07/2024",
    "publisher": "Futures & Options World",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Closing Bell: Sensex tanks 750 pts, Nifty closes below 24,550; Q1 results drag Ultratech, BPCL 3-4%, lifts Infosys 2%",
    "body": "July 19, 2024·15:39 IST July 19, 2024·15:54 IST Avdhut Bagkar Technical and Derivatives Analyst, StoxBox Indian shares traded lower on Friday due to weak global market cues and fears of new U.S.-China trade tensions. Despite opening at record highs, the Nifty 50 and Sensex quickly slipped into the red and fell sharply later in the session. India's benchmark stock indices ended their rally by hitting downward trends after a fresh record high for the fourth consecutive session on Friday. Sectors like Metal, Auto, Financial Services, and Energy saw significant declines. Brokerages' Stocks Fall As Microsoft Outage Impacts Operation. On the stock-specific front, Infosys shares rose after posting better-than-expected Q1 FY25 results and raising its FY25 revenue growth forecast to 3-4%. Other top gainers included Asian Paints, LTIMindtree, and Titan Company. In contrast, Persistent Systems fell nearly 7% after its Q1 profit missed estimates. The benchmark index initially opened 52 points higher but quickly faced selling pressure. After reaching a peak of 24854, it dropped over 100 points in the first few minutes of trading, accompanied by high volume, setting the tone for the day. The index continued to trend lower as selling pressure intensified, closing 269 points lower. Despite a significant correction and adverse market and momentum breadth, the index showed resilience by not dropping below the prior day’s low and closing above the psychological mark of 24500. Going forward, it will be crucial for the index to maintain support in the range of 24500-24200 to sustain bullish momentum. July 19, 2024·15:49 IST Riya Singh – Research Analyst, Commodities and Currency , Emkay Global Gold and silver prices experienced a sharp decline following the sentiment that the anticipated bullish phase might have occurred earlier than expected, leading to profit-taking. A recent slowdown in seasonal demand could exert downward pressure on prices if ETF flows do not persist or if tactical investors retreat due to high prices. U.S. data revealed the largest increase in initial jobless claims since early May, indicating a cooling labor market. This development supports a potential rate cut by the Federal Reserve in September. Despite the recent dip, gold remains nearly 20% higher, and silver over 15% higher since the beginning of the year. Additionally, uncertainty in the U.S. political landscape is contributing to short-term volatility. This temporary decline is seen as a necessary adjustment, providing central bankers an opportunity to regain purchase traction. For Gold support is placed at $2385 - $2350 whereas for silver it is at $29. - $28.85 On the other hand, oil prices have continued to decline, influenced by weak demand from China and pressure from a stronger dollar. China's economy grew at a much slower pace than expected in the second quarter, countering the narrative of tight supply. However, the significant drawdown in U.S. stockpiles and improved compliance with production cuts by OPEC members are expected to keep the market undersupplied by more than a million barrels, thereby providing support for crude oil prices. West Texas Intermediate (WTI) prices are expected to find support around $78 to $80 per barrel. Meanwhile, the USD/INR is trading at an all-time low due to a stronger dollar and widespread weakness across Asian currencies. According to the latest bulletin released by the Reserve Bank of India (RBI), the central bank purchased $4.2 billion of forex. Additionally, the market is closely monitoring the Union budget for FY 2024-25, to be held on July 23rd, for a clearer picture of economic growth. Earlier this week, the International Monetary Fund (IMF) raised India's growth projection from 6.8% to 7%. The rupee is expected to respect the resistance of 83.75 – 83.85 levels, with a potential retracement to the 83.50 level. July 19, 2024·15:42 IST Parth Nyati, Founder, ﻿Tradingo An Anti-virus Crowdstrike faced a technical glitch after an update that affected the Microsoft servers and PCs where this anti-virus was installed. This anti-virus is also installed on Microsoft servers provided by Azure as a part of their cloud infrastructure. Azure accounts for 25% market share amongst cloud services. Hence a lot of large organizations, airlines, stock exchanges globally who use Azure had technical glitches. The Crowdstrike team is currently working to resolve the issue. July 19, 2024·15:42 IST Wipro Q1 net profit rises to Rs 3,003 crore, beats estimates Wipro Ltd on 19 July reported its Q1 FY25 net profit rose from a year ago to Rs 3,003 crore, beating market expectations. The IT company’s April-June consolidated revenue fell to Rs 21,964 crore. A Moneycontrol poll of brokerage estimates had pegged Wipro’s fiscal first quarter net profit to rise to Rs 2,953 crore, and revenue to fall to Rs 22,229 crore. July 19, 2024·15:36 IST Rupee ends at record low of 83.66/$ against the US dollar, lower than Thursday’s close of 83.65/$ July 19, 2024·15:31 IST Profit booking seeped across the market ahead of the Union Budget 2024, to be tabled on July 23. Caution ahead of the event also triggered a bout of strong profit booking, pulling all major indices down in the red. At close, the Sensex was down 755.48 points or 0.93 percent at 80,587.98, and the Nifty was down 275.20 points or 1.11 percent at 24,525.60. About 756 shares advanced, 2618 shares declined, and 74 shares unchanged. All sectors witnessed selling and ended with losses. July 19, 2024·15:27 IST Stock Market LIVE Updates | US FDA issues 2 observations for Zydus Life's transdermal mfg site at SEZ in Ahmedabad July 19, 2024·15:19 IST Stock Market LIVE Updates | Metal stocks crack under pressure; JSW Steel, Tata Steel, Hindalco slump 4-5% July 19, 2024·15:13 IST Stock Market LIVE Updates | BPCL Q1 net profit falls 29% to Rs 3,015 crore #1 Net Profit down 28.6% At Rs 3,015 Cr Vs Rs 4,224 Cr (QoQ) #2 Revenue down 2.6% At Rs 1.13 Lk Cr Vs Rs 1.16 Lk Cr (QoQ) #3 EBITDA falls 38.7% At Rs 5,650 Cr Vs Rs 9,211 Cr (QoQ) #4 Margin At 5% Vs 8% (QoQ) July 19, 2024·15:04 IST Markets@3 PM | Indices at day's low; Sensex drops 680 pts, Nifty breaks 24,550 July 19, 2024·14:53 IST Stock Market LIVE Updates | UltraTech reports Q1 net profit at Rs 1,695 cr UltraTech Cement reported a weak set of Q1 FY25 results, with consolidated net profit flattish on-year at Rs 1,695 crore, missing estimates. April-June quarter consolidated revenue rose to Rs 18,069 crore. A Moneycontrol poll estimated India’s largest cement maker’s fiscal first quarter consolidated net profit at Rs 1,733 crore and revenue at Rs 17,962 crore, representing small rises on a year-on-year basis. July 19, 2024·14:45 IST Stock Market LIVE Updates | BSE not impacted due to Microsoft issue; 'Our operations are running normal,' says spokesperson July 19, 2024·14:43 IST Stock Market LIVE Updates | Blue Dart net profit declines 13% in June quarter #1 Net profit down 12.9% at Rs 53.4 cr vs Rs 61 cr (YoY) #2 Revenue up 8.5% at Rs 1,343 cr vs Rs 1,237.5 cr (YoY) #3 EBITDA up 5.8% at Rs 202.2 cr vs Rs 191.2 cr (YoY) #4 Margin at 15.1% vs 15.4% (YoY) July 19, 2024·14:38 IST Stock Market LIVE Updates | HAL, BEL, other defence stocks slump on profit booking ahead of Budget 2024 Shares of Hindustan Aeronautics Ltd (HAL) extended losses, falling over 3 percent despite the aerospace and defence firm announcing a revised Memorandum of Understanding (MoU) with the Aeronautical Development Agency (ADA), bolstering their collaboration on the LCA AF Mk-2 program. A sales note from InCred citing valuation concerns within defence stocks like HAL has likely spooked investors. The brokerage compared HAL with its global peer Dassault Aviation. Dassault reported revenue of $5.19 billion with a profit of $974 million in the last financial year, while HAL posted revenue of $3.67 billion with a profit of $921 million during the same period.Read More July 19, 2024·14:28 IST Stock Market LIVE Updates | Atul Ltd Q1 net profit rises 8.4% to Rs 112 crore Net Profit up 8.4% At Rs 112 Cr Vs Rs 103.3 Cr (YoY) Revenue up 12% At Rs 1,322 Cr Vs Rs 1,182 Cr (YoY) EBITDA up 22.5% At Rs 223 Cr Vs Rs 182 Cr (YoY) Margin At 16.9% Vs 15.4% (YoY) July 19, 2024·14:18 IST Umang Dairies, Keynote Financial Services among other locked at lower circuit July 19, 2024·14:12 IST Brokerage Call | Nomura keeps 'neutral' rating on Havells India, target Rs 1,900 #1 Q1 margin miss on weaker mix #2 Maintain 20 percent/17 percent revenue growth for FY25/26 (18 percent/14 percent ex-Lloyd) #3 Price hikes & stable commodity should support margin #4 Stock trades at 54x FY26 EPS, which believe factors in expected earnings recovery July 19, 2024·14:08 IST Jubilant Pharmova Q1 net profit at Rs 482 crore VS Rs 6.4 crore, YoY July 19, 2024·14:07 IST Wipro Q1 Earnings Preview: Macro issues to play spoilsport again; new deals a breather According to the average of nine estimates compiled by Moneycontrol, Wipro's consolidated net profit for the quarter ended June is expected to rise over 4 percent QoQ to Rs 2,953 crore, while revenue from operations is likely to remain flat....Read More July 19, 2024·13:57 IST RIL Q1 Results Preview: Telecom, retail, oil & gas to drive earnings growth, offset O2C decline Analysts will monitor user additions and ARPU growth in Reliance Industries' telecom business, as well as footfalls and store additions in the retail segment....Read More July 19, 2024·13:55 IST IPO Check | Sanstar IPO subscribed 2.4 times on opening day, NII portion booked nearly 4x Sanstar Limited's initial public offering (IPO) was subscribed 2.4 times on the first day of bidding on July 19 with non-institutional investors leading the charge. The Rs 510.15-crore public offer attracted bids for 7.7 crore equity shares, surpassing the offer size of 3.8 crore equity shares, according to exchange data. The public offer, which opened for subscription today, has a price band set at Rs 90-95 per share. The bidding is scheduled to close on July 23, 2024. Non-institutional investors displayed the most enthusiasm, bidding nearly 4 times their allotted quota. Retail investors followed closely, subscribing 2.4 times of their reserved portion. The portion set aside for qualified institutional buyers (QIBs) was subscribed 1 percent. July 19, 2024·13:54 IST Trading Strategy | F&O Setup and how to position for Budget Day? Mantri believes that sectors like PSU banks, FMCG, and Oil & Gas are expected to perform well in the coming days....Read More July 19, 2024·13:52 IST Brokerage Call | Morgan Stanley keeps 'underweight' call on L&T Technologies, target Rs 4,300 #1 Despite the miss, company has strong deal pipeline & maintained revenue & margin guidance for FY25 #2 Ask rate to meet revenue guidance is high, & continued estimate cuts could limit positive triggers July 19, 2024·13:50 IST Brokerage Call | Morgan Stanley keeps 'equal-weight' call on Dalmia Bharat, target Rs 1,900 #1 Small EBITDA beat in Q1 while key positive was better realisations #2 Opex/t was broadly in-line with estimate #3 Weak volumes, however, were a key negative July 19, 2024·13:48 IST Brokerage Call | Goldman Sachs keeps 'sell' rating on Tata Technologies; target cut to Rs 950 #1 Q1FY25 was a miss with revenue/EBITDA -2.5 percent/-8 percent QoQ & were -5 percent/-9 percent below consensus #2 Softness was due to phasing of customer business in the smaller technology solutions segment #3 Softness was due to Vinfast customer related QoQ moderation in revenue in core services (auto) business #4 Going forward, management expects a return to sequential growth in the business in Q2-Q3-Q4 Of FY25 July 19, 2024·13:41 IST Stock Market LIVE Updates | RVNL signs MoU with United Construction RVNL has signed Memorandum of Understanding (MoU) with M/s United Construction Limited, Israel to co-operate with each other to get projects in the field of Railways, MRTS, Tunnels, Roads (Highways & Expressways), Bridges, Building Works, Airports, Ports, Irrigation, Power Transmission and Distribution Sector, Solar Sector, Wind Sector in Israel. In another development in dispute settellment between Krishnapatnam Railway Company Limited (KRCL) (a JV/SPVof RVNL with RVNL's share of 49.76%) and Ministry of Railway, the Hon'ble tribunal has passed an award of Rs. 584.22 crores in favour of the claimant (KRCL). July 19, 2024·13:38 IST Stock Market LIVE Updates | USFDA conducts cGMP inspection at Divis Lab Divis Laboratories informed that the US Food and Drug Administration (US-FDA) conducted a general cGMP inspection of the Company's Unit-II manufacturing facility at Chippada Village, Bheemunipatnam Mandal, Visakhapatnam, Andhra Pradesh from July 11, 2024 to July 19, 2024. The US-FDA inspection is successfully completed with one procedural observation, which will be addressed in the stipulated period of time. July 19, 2024·13:36 IST Brokerage Call | Jefferies keeps 'hold' rating on Havells India, target Rs 1,880 #1 Q1 was in-line with estimates #2 Strong sale (+20 percent YoY) was driven by good offtake in summer products, B2B offtake, albeit with interim election impact #3 Lloyd posted EBIT margin at +3.5 percent in Q1 (+2.8 percent In Q4FY24) #4 Cut FY25-27 EPS by 1-2 percent July 19, 2024·13:33 IST Stock Market LIVE Updates | JTL Industries' QIP opens, floor price at Rs 221.57 The company has opened its qualified institutions placement (QIP) issue on July 18. The floor price has been fixed at Rs 221.57 per share. July 19, 2024·13:30 IST Stock Market LIVE Updates | Tata Consumer Products to consider rights issue price The Capital Raising Committee of the board will meet on July 23 to consider the rights issue price and related payment mechanisms, rights entitlement ratio, the record date, and the timing of the issue. The board had approved a rights issue worth Rs 3,000 crore in January 2024. July 19, 2024·13:27 IST Stock Market LIVE Updates | Vodafone Idea to allot 41.52 crore shares to Nokia Solutions and Networks India and Ericsson India The Capital Raising Committee of the board has approved the second tranche of the allotment of 41,52,02,701 equity shares worth Rs 614.5 crore at an issue price of Rs 14.80 per share, to Nokia Solutions and Networks India and Ericsson India, vendors of the company, on a preferential basis. July 19, 2024·13:21 IST Brokerage Call | Nirmal Bang downgrade defence sector rating to ‘sell’ on super rich valuations July 19, 2024·13:18 IST Sensex Today | BSE Auto index slips 2%; Apollo Tyres, Cummins, Samvardhana Motherson among major losers July 19, 2024·13:15 IST Sensex Today | Jaykay Enterprises and Shrydus Industries trade ex-rights July 19, 2024·13:13 IST Stock Market LIVE Updates | Elecon Engineering Company stock trades ex-split July 19, 2024·13:10 IST Sensex Today | BSE Bank index down 0.7%; Yes Bank, Federal Bank, Canara Bank among major losers July 19, 2024·13:04 IST Stock Market LIVE Updates | Shoppers Stop shares down 5% on posting losses in Q1 #1 Net loss at Rs 22.7 crore Vs profit at Rs 14.5 crore, YoY #2 Revenue increases 7.6% to Rs 1,069.3 crore Vs Rs 993.6 crore, YoY July 19, 2024·13:02 IST Markets@1 | Sensex down 500 pts, Nifty at 24,600 The Sensex was down 518.40 points or 0.64 percent at 80,825.06, and the Nifty was down 197.10 points or 0.79 percent at 24,603.70. July 19, 2024·12:58 IST Big tech shares lose lustre as US market rocked by violent rotation Small-cap stocks surge in expectation they will benefit disproportionately from a Fed interest rate cut...Read More July 19, 2024·12:56 IST Sensex Today | Nifty Realty index down 2.5%; Phoenix Mills, DLF, Hemisphere Properties India among top losers July 19, 2024·12:53 IST Brokerage Call | Nomura maintains ‘buy’ rating on Infosys, target raises to Rs 1,950 #1 Q1FY25 was an all-round beat #2 Surprise revenue guidance driven by strong start, deal wins, & acquisition integration #3 Project maximus’ impact on margin continues to play out #4 Raise our FY25-26 EPS by nearly 2-3%, reiterate as top pick July 19, 2024·12:51 IST SpiceJet stock jumps 5% as board to consider fundraising via QIP on July 23 SpiceJet said the company will hold a board meeting on July 23 to consider raising fresh capital through qualified institutional placement (QIP) basis....Read More July 19, 2024·12:50 IST Sensex Today | BSE Smallcap index sheds 2%; Chennai Petro, Avantel ,Bharat Bijlee among major losers July 19, 2024·12:49 IST Aether Industries Q1 net profit flat at Rs 30 crore, YoY July 19, 2024·12:48 IST Stock Market LIVE Updates | Sagar Cements Q1 net loss narrows; stocks trade flat #1 Net loss narrows to Rs 28.4 crore Vs loss at Rs 39.8 crore, YoY #2 Revenue rises 3.9% to Rs 560.6 crore Vs Rs 539.7 crore, YoY July 19, 2024·12:46 IST Sensex Today | BSE Midcap index down 2%; Cummins, Persistent Systems, Samvardhana Motherson among top losers July 19, 2024·12:43 IST Arvinder Singh Nanda, Senior Vice President, of Master Capital Services The fiscal deficit target for FY25 is likely to stay at 5.1% of GDP as per the interim budget. Emphasis will be on job creation through capital expenditure, targeted social spending, and the 'Viksit Bharat' initiative. The budget may also outline a roadmap for fiscal consolidation beyond FY26. While no reduction in personal income tax rates is expected, there could be tax relief for middle-income taxpayers. Key sectors to watch include agriculture, start-ups, housing, railways, defence, electronics, and renewables. Changes in short-term capital gains tax rates are anticipated, but significant hikes in long-term capital gains tax rates are not expected. July 19, 2024·12:41 IST Stock Market LIVE Updates | Dalmia Bharat shares down 3% on flat Q1 profit #1 Profit rises 0.7% to Rs 145 crore Vs Rs 144 crore, YoY #2 Revenue drops 0.2% to Rs 3,621 crore Vs Rs 3,627 crore, YoY July 19, 2024·12:39 IST Stock Market LIVE Updates | CEAT shares down 2.5% despite Q1 profit rises #1 Profit jumps 7% to Rs 154.2 crore Vs Rs 144 crore, YoY #2 Revenue increases 8.8% to Rs 3,192.8 crore Vs Rs 2,935.2 crore, YoY July 19, 2024·12:36 IST Wipro Q1 Earnings Preview: Macro issues to play spoilsport again; new deals a breather According to the average of nine estimates compiled by Moneycontrol, Wipro's consolidated net profit for the quarter ended June is expected to rise over 4 percent QoQ to Rs 2,953 crore, while revenue from operations is likely to remain flat....Read More July 19, 2024·12:32 IST Sensex Today | Infosys, TCS, Britannia hit 52-week high July 19, 2024·12:27 IST Stock Market LIVE Updates | CIE Automotive India Q1 shares fall post Q1 earnings #1 Profit increases 1.3% to Rs 216.4 crore Vs Rs 213.6 crore, YoY #2 Revenue drops 1.2% to Rs 2,292.7 crore Vs Rs 2,320.3 crore, YoY July 19, 2024·12:17 IST Capital Trust, VST Industries among others witness volume surge July 19, 2024·12:16 IST Sensex Today | Nazara Technologies acquires stake in Paper Boat Apps Nazara Technologies board approved to make strategic investment by way of secondary acquisition of 5,157 equity shares of Rs 10 each, representing 48.42% of the equity share capital of Paper Boat Apps Private Limited, a subsidiary of the company, from its existing founder shareholders (i.e. Mr. Anupam Dhanuka and Ms. Anshu Dhanuka), at a total consideration not exceeding Rs 300 crore, to be paid in cash. July 19, 2024·12:11 IST Sensex Today | Gravita India's step-down subsidiary Recyclers Costa Rica S.A. situated in Costa Rica closes July 19, 2024·12:09 IST Sensex Today | CaratLane Trading becomes wholly-owned subsidiary of the Titan Company with effect from 18th July 2024 July 19, 2024·12:07 IST Option strategy of the day| Long build up in Nifty IT index, Bull Call Spread in Mphasis recommended The Nifty IT Index has surpassed its all-time high levels of 39,446, entering a new bullish zone. The momentum indicator MACD has turned to buy mode across all timeframes, from monthly to daily charts....Read More July 19, 2024·12:04 IST Sensex Today | Reliance Industries, Wipro, UltraTech Cement among others to announce results today Reliance Industries, Wipro, UltraTech Cement, Bharat Petroleum Corporation, JSW Steel, Union Bank of India, ICICI Lombard General Insurance Company, One 97 Communications (Paytm), Patanjali Foods, Aether Industries, Atul, BEML Land Assets, Blue Dart Express, CreditAccess Grameen, Fedbank Financial Services, Indian Hotels, JSW Energy, Jubilant Pharmova, Mahindra EPC Irrigation, Nippon Life India Asset Management, Oberoi Realty, Orissa Minerals Development Company, PVR Inox, Route Mobile, RPG Life Sciences, Supreme Petrochem, Stanley Lifestyles, Tejas Networks, Transformers and Rectifiers (India), and Vipul Organics will release their quarterly earnings on July 19. July 19, 2024·11:56 IST Kotak Bank Q1 preview: Loan growth to drive profit, NII; margin pressure likely Kotak Bank is expected to clock up to 13 percent YoY growth in NII to Rs 7,087 crore in Q1FY25, said analysts...Read More July 19, 2024·11:55 IST Sensex Today | Nifty Bank index down 0.5%; Bandhan Bank, Federal Bank, IDFC First Bank among major losers July 19, 2024·11:53 IST Sensex Today | BSE Midcap and Smallcap underperform July 19, 2024·11:52 IST Stock Market LIVE Updates | CCI approves to acquire 56% stake in Ismartu India by Dixon The Competition Commission of India (CCI) has approved the acquisition of up to 56% shareholding of Ismartu India by Dixon Technologies. July 19, 2024·11:47 IST Stock Market LIVE Updates | GPT Infraprojects bags order worth Rs 103 crore The company has received an order worth Rs 103 crore from NHAI, New Delhi, and Eastern Railway, Kolkata. The contract is an enhancement of the existing contract with NHAI and Eastern Railway, Kolkata. July 19, 2024·11:44 IST Sensex Today | 1.07 million shares of Tata Steel traded in block: Bloomberg July 19, 2024·11:42 IST Stock broking app like IIFL, Angel One, 5 paisa were facing issue July 19, 2024·11:36 IST Paytm concall -Waiting approval to start onboarding of new UPI users Awaiting Approval To Start Onboarding Of New UPI Users Seeing A Rebound In Our Merchant Operating Metrics Confident In Our Trajectory Towards Sustained Growth Going Forward Full Financial Impact Of The Recent Disruptions Is Visible In Q1FY25 Rev & Profitability Expected To Improve Going Forward July 19, 2024·11:30 IST Stock Market LIVE Update | All key indices swim in losses; Nifty Midcap, Smallcap tanks over 2% July 19, 2024·11:20 IST Earnings Call | Paytm net loss swells up to Rs 839 crore in Q1 Cons net loss at Rs 839 cr vs loss Of Rs 357 cr (YoY) Cons revenue falls 36 percent to Rs 1,502 cr vs Rs 2,342 cr (YoY) July 19, 2024·11:15 IST Stock Market LIVE Updates | Zydus Lifesciences stock falls 3% after US FDA classifies Jarod unit as OAI Zydus Lifesciences shares fell 3 percent on July 19 after the company's Jarod injectables manufacturing facility got classified as 'Official Action Indicated' (OAI) by the United States Food and Drug Administration (USFDA). This comes after the US drug regulator inspected the facility from April 15-23 this year. The inspection was followed by the US FDA issuing 10 observations for the facility under review. The observations issued by the US FDA were likely not rectified by the drugmaker, leading to the OAI classification of the facility. The drugmaker also received US FDA approval for Zituvimet extended-release tablets today. Zituvimet is used as an adjunct to diet and exercise to improve glycemic control in adults with type 2 diabetes. July 19, 2024·11:09 IST Stock Market LIVE Updates | Caplin Steriles gets USFDA approval for Ephedrine Sulfate Injection USP Caplin Steriles, a subsidiary company of Caplin Point Laboratories has been granted final approval from the United States Food and Drug Administration (USFDA) for its Abbreviated New Drug Application (ANDA) Ephedrine Sulfate injection USP, 50 mg/mL Single Dose vial, a generic therapeutic equivalent version of the Reference Listed Drug (RLD) AKOVAZ, from Exela Pharma Sciences LLC. July 19, 2024·11:07 IST Stock Market LIVE Updates | KPI Green Energy bags 100 MW Captive Solar Power Project KPI Green Energy received a new order for a 100 MW Hybrid Captive Solar Power Project from Aether Industries under the Captive Power Producer (CPP) segment of the company. July 19, 2024·11:04 IST Sensex Today | 1.15 million shares of Gail India traded in a block: Bloomberg July 19, 2024·11:03 IST Stock Market LIVE Updates | USFDA classifies inspection at Zydus Lifesciences as OAI The United States Food and Drug Administration (USFDA) has conducted an inspection at the company's injectables manufacturing facility at Jarod, Gujarat, from April 15 to April 23 this year. The USFDA has determined that the inspection classification of this facility is Official Action Indicated (OAI). July 19, 2024·11:00 IST Markets@11 | Sensex, Nifty at day's low July 19, 2024·10:57 IST Stock Market LIVE Updates | Tech Mahindra to merge its step-down subsidiary with its parent co The company has approved a plan to merge its step-down subsidiary, vCustomer Philippines (Cebu) Inc., with its parent company, vCustomer Philippines Inc. vCustomer Philippines Inc. is a wholly owned subsidiary of Tech Mahindra. The merger is subject to regulatory approvals in the country of incorporation. July 19, 2024·10:54 IST Sensex Today | Nifty Smallcap underperforms July 19, 2024·10:50 IST IPO Check | Subscribe Sanstar, says Master Capital Service Sanstar is looking to payoff its debt and strengthen its balance and invest into building additional capacity to fuel their growth. Post the proposed expansion, the capacity will almost double from current levels creating a huge headroom for growth. The current capacity is already 90% filled and the capex for expansion has already started. The valuation of the IPO is at par with the listed peers, but given the growth rospects, we advise to subscribe to the IPO keeping a long term view. July 19, 2024·10:48 IST Stock Market LIVE Updates | Tanla Platforms Q1 profit rises; stock trades lower #1 Profit increases 4.3% to Rs 141.2 crore Vs Rs 135.4 crore, YoY #2 Revenue grows 10% to Rs 1,002.2 crore Vs Rs 911.1 crore, YoY July 19, 2024·10:43 IST Kotak Bank Q1 preview: Loan growth to drive profit, NII; margin pressure likely Kotak Bank is expected to clock up to 13 percent YoY growth in NII to Rs 7,087 crore in Q1FY25, said analysts...Read More July 19, 2024·10:40 IST Sensex Today | Nifty Media index down 1.3%; TV18 Broadcast, TV TodayNetwork, Zee Entertainment among major losers July 19, 2024·10:38 IST Stock Market LIVE Updates | Go Digit stock jumps 7% after Citi initiates coverage with 'buy'; eyes 25% upside Shares of Go Digit General Insurance surged 7 percent intraday to Rs 363 in the morning trade on July 19 after international brokerage Citi initiated coverage with a 'buy' call as it sees multiple levers of growth for the company. Analysts have assigned a price target of Rs 425, implying an upside potential of 25 percent from the current market levels. Citi expects the company's Return on Equity (RoE) to increase to 15-16 percent in FY26-27 from nearly 7 percent in FY24. A steady 13 percent annual growth in non-life premiums (excluding crop insurance), driven by health and B2B business is also anticipated, Citi said in a recent note on the company. July 19, 2024·10:29 IST HDFC Bank Q1 results preview: Soft growth in loans, deposits to limit NII, profit gain QoQ HDFC Bank's NII is pegged to grow up to 27 percent YoY to Rs 29,621 crore in Q1FY24, while profit is estimated to jump by 32 percent YoY to Rs 15,905 crore...Read More July 19, 2024·10:26 IST Stock Market LIVE Updates | South Indian Bank shares gain 3% after profit up 45% #1 Profit surges 45.4% to Rs 294.1 crore Vs Rs 202.4 crore, YoY #2 Net interest income increases 7.2% to Rs 865.8 crore Vs Rs 807.7 crore, YoY #3 Gross NPA flat QoQ at 4.50%, YoY #4 Net NPA falls QoQ to 1.44% Vs 1.46%, YoY July 19, 2024·10:23 IST Sensex Today | BSE Oil & Gas index sheds 2%; Oil India, BPCL, Gail among major losers July 19, 2024·10:21 IST Stock Market LIVE Updates | Persistent Systems shares fall 5% as Q1 profit declines #1 Profit drops 2.8% to Rs 306.4 crore Vs Rs 315 crore, QoQ #2 Revenue rises 5.7% to Rs 2,737.2 crore Vs Rs 2,590.5 crore, QoQ #3 EBIT grows 2.6% to Rs 384 crore Vs Rs 374.4 crore, QoQ #4 EBIT margin dips 50 bps to 14% Vs 14.5%, QoQ July 19, 2024·10:16 IST Sahaj Solar makes bumper debut, lists with 90 premium over IPO price Shares of Sahaj Solar Limited made a robust start on its stock market debut on July 19, listing at Rs 342, commanding a premium of 90 percent over the issue price of Rs 180 per share. The Rs 52.56-crore public offer came firing out of the blocks during the subscription period as investors subscribed a massive 506 times. Non-institutional investors were the most active, buying 862 times their allotted quota. Retail investors followed, purchasing 534 times while qualified institutional buyers roped in 214 times the portion reserved. July 19, 2024·10:14 IST Stock Market LIVE Updates | L&T Technology shares fall post Q1 results #1 Profit declines 8% to Rs 313.6 crore Vs Rs 340.9 crore, QoQ #2 Revenue slips 3% to Rs 2,461.9 crore Vs Rs 2,537.5 crore, QoQ #3 EBIT dips 10.4% to Rs 383.6 crore Vs Rs 428.2 crore, QoQ #4 Margin drops to 15.6% Vs 16.9%, QoQ #5 Revenue in dollar terms down 3.3% at $295.2 million Vs $305.1 million, QoQ #6 Revenue in constant currency down 3.1%, QoQ July 19, 2024·10:11 IST HDFC Bank Q1 results preview: Soft growth in loans, deposits to limit NII, profit gain QoQ HDFC Bank's NII is pegged to grow up to 27 percent YoY to Rs 29,621 crore in Q1FY24, while profit is estimated to jump by 32 percent YoY to Rs 15,905 crore...Read More July 19, 2024·10:09 IST Commodity Check | Gold slips but set for fourth weekly rise on US rate cut prospects Gold prices slipped on Friday, but were on track for a fourth straight weekly gain as expectations that the Federal Reserve will cut interest rates in September lifted bullion's appeal. Spot gold fell 0.8% to $2,424.34 per ounce. It has risen 0.7% so far this week, hitting an all-time high of $2,483.60 on Wednesday. U.S. gold futures fell 1.2% to $2,426.10. July 19, 2024·10:07 IST Stock Market LIVE Updates | Bharti Airtel bags multi-year contract from CBDT for providing network solutions The Central Board of Direct Taxes (CBDT) on Thursday signed a multi-year contract with telecom major Bharti Airtel, under which the latter will provide network and connectivity solutions for CBDT's Taxnet-2.0 programme. This contract is an extension as Airtel has been the network partner to CBDT since 2008 in Taxnet-1.0. \"The formal Letter of Award was handed over to Bharti Airtel by the Central Board of Direct Taxes (CBDT) and the Letter of Acceptance has been given by Bharti Airtel to CBDT. The occasion was graced by Mr. Sunil Bharti Mittal, Founder and Chairman, Bharti Enterprises, and Mr Ravi Agarwal, Chairman, CBDT,\" Airtel said in a statement.Read More July 19, 2024·10:03 IST Brokerages remain neutral on Havells India following Q1 show, see 5% downside Further price hikes coupled with stable commodity prices should support Havells India's margins going ahead, said Nomura....Read More July 19, 2024·09:57 IST Sensex Today | BSE Information Technology index up 0.5%; Cyient, Intellect Design Arena among major gainers July 19, 2024·09:55 IST Sensex Today | HDFC Bank, Kotak Mahindra Bank, RBL Bank, Yes Bank among others to announce results on July 20 HDFC Bank, Kotak Mahindra Bank, RBL Bank, Yes Bank, Poonawalla Fincorp, Aarti Surfactants, Arihant Capital Markets, Can Fin Homes, Gravita India, JK Cement, Kirloskar Pneumatic, Motisons Jewellers, Netweb Technologies India, Rossari Biotech, Seshasayee Paper & Boards, Shakti Pumps, Sportking India, and Zenith Health Care will announce their quarterly results on July 20. July 19, 2024·09:53 IST Sensex Today | BSE Oil & Gas index shed 1%; Oil India, BPCL, Gail India among major losers July 19, 2024·09:51 IST Stock Market LIVE Updates | Rallis India shares fall 5% post Q1 profit down 23% #1 Profit declines 23.8% to Rs 48 crore Vs Rs 63 crore, YoY #2 Revenue rises 0.1% to Rs 783 crore Vs Rs 782 crore, YoY July 19, 2024·09:46 IST Stock Market LIVE Updates | Dr Reddy’s signs patent licensing agreement with Takeda Pharma The pharma company signed a non-exclusive patent licensing agreement with Takeda Pharmaceutical Company to commercialize Vonoprazan tablets in India. Vonoprazan is a novel, orally active potassium-competitive acid blocker (PCAB) used to treat reflux esophagitis and other acid peptic disorders. July 19, 2024·09:43 IST Brokerage Call | Bernstein keeps ‘outperform’ rating on Infosys, target raises to Rs 2,100 #1 Delivered its strongest beat in 10 quarters in Q1 across revenue, margin & EPS #2 FY 25 revenue guidance was raised to 3 percent to 4 percent YoY CC (from 1 percent to 3 percent) #3 Deal momentum was strong at USD 4.1 billion TCV with net new of 57 #4 See beginning of an upcycle trend as growth recovers, BFSI inflects & ai deals scale up July 19, 2024·09:38 IST Sensex Today | Nifty Pharma index fell nearly 1%; Zydus Life, Torrent Pharma, Sun Pahrma among major losers July 19, 2024·09:36 IST Sensex Today | Reliance Industries, Wipro, UltraTech Cement among others to announce results today Reliance Industries, Wipro, UltraTech Cement, Bharat Petroleum Corporation, JSW Steel, Union Bank of India, ICICI Lombard General Insurance Company, One 97 Communications (Paytm), Patanjali Foods, Aether Industries, Atul, BEML Land Assets, Blue Dart Express, CreditAccess Grameen, Fedbank Financial Services, Indian Hotels, JSW Energy, Jubilant Pharmova, Mahindra EPC Irrigation, Nippon Life India Asset Management, Oberoi Realty, Orissa Minerals Development Company, PVR Inox, Route Mobile, RPG Life Sciences, Supreme Petrochem, Stanley Lifestyles, Tejas Networks, Transformers and Rectifiers (India), and Vipul Organics will release their quarterly earnings on July 19. July 19, 2024·09:34 IST RIL Q1 Results Preview: Telecom, retail, oil & gas to drive earnings growth, offset O2C decline Analysts will monitor user additions and ARPU growth in Reliance Industries' telecom business, as well as footfalls and store additions in the retail segment....Read More You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-19-07-2024-liveblog-12772398.html",
    "original_url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxOQ2FvOGVzMlY3MjYxRHlUeEpoYnZwQVFpNG9WNk5kMC15ZG1Jc2ptZXNGRWt1Z1VvRm5qaEhPT1lyZkxhcW5hbVJXSDJxMUtROEdpN0dVWkt3ZDZrM2ZVYVpCVnZIX2JJN2hCMnVFQWkzSUVIWlNPV3dGZ20xM2NZZWJpRUNIQy1nY3RaNlQ4WUNCbjFfanpFRkc4WTdVajRhT3QwVUhkcWN4MDR6WUFFZHp3WXRVb1lCUnV4bmp5SVRCNFI2ZE9rdWhMLUJKRlhFc0NBWDNrOWlzd3NmZ2doci1ra1JCRlNyUUUwb9IB8gFBVV95cUxPSFB5bGJSUkF6b2NZZEh1VDk5Z1p4Sy1ROU5zdERBNnJ0WlVjUnVlSGxsaThCenJ3V1gxWlMzekd4eDlTNm82Ul9BeHAxbzBjWnhIWHFxOU5uR1EzNlNCZE45OHhhR1VhY0swcURELV83UHNPcHRDZk5aZkRraFRWbENjUEItZHkzU25SNXQwcGRoaVJPNldzazJJOFNzTGliaGlXMTVOMGUzTVA2dy1VZG5kUjlVWXQ2aUNjSzMtUGtLNTVHYm9pX2FHaGlvOEZ6aEplYU5WRE14SWNybDdEMFVHMi0yTHhGd2IzSGt3ejlyQQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 34377,
    "word_count": 5650,
    "gnews_title": "Closing Bell: Sensex tanks 750 pts, Nifty closes below 24,550; Q1 results drag Ultratech, BPCL 3-4%, lifts Infosys 2% - Moneycontrol",
    "published_date": "19/07/2024",
    "publisher": "Moneycontrol",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "India's Nifty 50 posts record close, longest weekly rally of 2024",
    "body": "A man walks out of the Bombay Stock Exchange (BSE) building in Mumbai, India, February 28, 2020. REUTERS/Hemanshi Kamani/File Photo Purchase Licensing Rights , opens new tab Companies Mirae Asset Tiger India Nifty 50 Etf Follow Ahluwalia Contracts (India) Ltd Follow HCL Technologies Ltd Follow Show more companies BENGALURU, July 5 (Reuters) - India's blue-chip Nifty 50 (.NSEI) , opens new tab notched another record closing high on Friday, shrugging off a slide in HDFC Bank, and chalked up its fifth straight week of gains, its longest such streak this year. The NSE Nifty 50 rose 0.09% on the day to end at 24,323.85 as gains in energy stocks helped it notch a record closing high for the fourth time this week. Make sense of global markets with the Trading Day newsletter. Sign up here. The S&P BSE Sensex (.BSESN) , opens new tab settled 0.07% lower at 79,996.6 points, but still managed to mirror both the Nifty's 1.2% rise this week and a fifth consecutive week of gains. Reuters Graphics Still, the benchmarks got off to a rocky start on the day as HDFC Bank (HDBK.NS) , opens new tab , the heaviest-weighted stock on the indexes, tumbled 4.6% after posting a disappointing quarter financial update. The lackluster session is also an initial sign of investors' exhaustion near record-high levels, said Sameet Chavan, head of research at Angel One. The IT index (.NIFTYIT) , opens new tab , a relative underperformer over the year, jumped 4.3% this week, its biggest such rise in four, as soft U.S. economic data bolstered expectations of a rate cut in September. Advertisement · Scroll to continue Infosys (INFY.NS) , opens new tab , Wipro (WIPR.NS) , opens new tab , HCLTech (HCLT.NS) , opens new tab and market-leader TCS (TCS.NS) , opens new tab rose between 2.7% and 5.2%, among the top Nifty gainers this week. IT companies, which earn a significant share of their revenue from the U.S., have rallied for a third straight week and will remain in focus with U.S. non-farm payrolls data due later on Friday and as TCS kicks off the earnings next Thursday. Reuters Graphics But before earnings take centre stage, the Nifty will drift along, said Narendra Solanki, head of fundamental research of investment services at Anand Rathi. Advertisement · Scroll to continue Reliance Industries (RELI.NS) , opens new tab rose more than 2% on the day to a record high after Nomura listed it as one of the seven global stocks likely to gain from the energy transition. Reliance, along with ONGC's (ONGC.NS) , opens new tab 4% jump on block deals, helped boost energy stocks (.NIFTYENR) , opens new tab nearly 2% on the day. The small-caps (.NIFSMCP100) , opens new tab and mid-caps (.NIFMDCP100) , opens new tab rose about 0.8% each. Reuters Graphics Reporting by Bharath Rajeswaran and Hritam Mukherjee in Bengaluru; Editing by Nivedita Bhattacharjee, Mrigank Dhaniwala, Janane Venkatraman and Savio D'Souza Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Hritam Mukherjee Thomson Reuters Hritam is a breaking news correspondent covering Indian companies. Since joining Reuters in 2022, he has closely tracked India's primary and secondary markets, written extensively on a string of cement M&As, and briefly reported on general and political news out of South Asia. Previously, he was associated with two US-based newspapers. Email X Linkedin Read Next 1 hour ago Asian Markets category Sriwijaya Capital raises over $200 million for debut fund, eyes $300 million cap, sources say 2 hours ago Asian Markets category Kumpulan Wang Persaraan targets 30% private market allocation in 5 years 6 mins ago Wealth category Asia draws $100 billion in capital as investors diversify beyond US, Goldman executive says 5 hours ago India category India's September manufacturing growth cools as price rises soar to 12-year high, PMI shows 1 hour ago Business category Oil pauses as markets assess OPEC+ plans, demand concerns 5 hours ago VIEW India central bank keeps repo rate steady as widely expected",
    "url": "https://www.reuters.com/markets/asia/indian-shares-set-lackluster-open-hdfc-bank-focus-2024-07-05/",
    "original_url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQOE55S2NKalhuTkMtMVE4WmdFVXBvVncwOERfblJHcWhoakJERUJSaHhXMjNpaHVPVGlyUm44OTdnRzBLRUhpcUNpZHo3U2lGU2VaM3FSSi1mdnBhd1hIYy00S213UzZFR0xKVkY4dzdCSDZpZGJLTnRaZDZSRWlSS0d1ZkVSU2tmaENFYnhEbWpfLTNxamtBSmVYUFV1SVE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4079,
    "word_count": 675,
    "gnews_title": "India's Nifty 50 posts record close, longest weekly rally of 2024 - Reuters",
    "published_date": "05/07/2024",
    "publisher": "Reuters",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market today: Why BSE Sensex, Nifty50 are closed for trading on May 20, 2024",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-why-bse-sensex-nifty50-are-closed-for-trading-on-may-20-2024-lok-sabha-elections/articleshow/110259408.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxNTkZPZTF5aFA4NEpLOEhvNmNUZHppd2lJcTg2LWlWRzNSNjJkR3phSGR1VkdzVl9ucXB0VzFzLVJ6TVl4NkU4UU9yZmxNRkdIV0FabDlNcjVsQ0owbmVsZ3NMUUdmWFVoWU01NXFvVjBGSXBhQjdzeHNKaGtPZzFucUljMnZLOGdpNnZGc0s1bF9qYjdrTVprdk43Uk16QWk2V2xXQlhpNFBROWVDMzVmUUh4OUlNc29qNm96ekhaM0pkWkw4Q28wOF9fcVNPMGNoUjBkNkpCMFRZZGVxTU5ZREc1bUFOT3Jha1BMTXlxcnRSVXE4QWhOS3FnMFBHME05YmFEZS1HS01YRmstbkoxZU1iTdIBmAJBVV95cUxONS03ckFuNm1KVnBNMjcxUm5CTDBRMkdkU3EyX3lWeUxLV2lLVE5pRjA3M2pYd0ZudHZTemJIeWZTYUlrdF9nM2JZNlhsbW5fYnc5TS03bU9tTjJwSE5nWkh1RTZxOHNxNTBQd3lBUzU1NUE3SmR6b1pQeGZiNWZlUm5hMmdTX0RtUHhWd2d2em9ZU0J0UFR6UHotRGpxZlpXQVZlQkdsYnMwSy1HSWp0MUhqbGtJMzI1dUFmbUZZcmg2RHVoSmFoenc2SF9QbHppWWo4R1loTHB6blphZG9PX25yM3U2OXpvZnhLelNSZ0kzOTBmcTUyOVdUSVpEeG9IZGFWTmdjS3F6WGU1QVNaTDZKVkFSN2h2?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3682,
    "word_count": 627,
    "gnews_title": "Stock market today: Why BSE Sensex, Nifty50 are closed for trading on May 20, 2024 - The Times of India",
    "published_date": "20/05/2024",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  }
]