[
  {
    "title": "Stock market today: BSE Sensex ends over 500 points up; Nifty50 above 22,950 - top reasons for rally",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Kareena Kapoor Khan stuns in regal red saree & emerald glam ​10 desi ways to add gobhi in your daily dinner​ 9 benefits of flaxseed for heart health 10 dupatta draping styles every bride-to-be must know 10 timeless love quotes by Rabindranath Tagore that will warm your heart Karisma Kapoor exudes royalty in an ivory Anarkali with timeless grace 8 ways to use leftover dal makhani 10 unique and feel-good baby names 10 bad habits you must change to achieve success A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns...",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-28-2025-dalal-street-indian-equities-global-markets/articleshow/117616699.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxQakltdUFoaGJWQUk4Q2w3bWNnVklidFR3NjQxU3BjZGVCY0hDVkNiVjV2YjN0WjVISDR2SmRhT04wbGpDSjB2bmQxanhnU2xIOFlqZjVLMFlVaXFUOTZ2cnlsVnQzYjJ6UjRsZ0tLT1p4dkw1UzBwTy1RcjF5cEhfUDNIb29HOWRHV3dlWmFiQWZlOFRXdndEQ2FoaEtHZkZXLXJuQmtQc0dRNy1PMmpsUnpydTdhUDEtaG9xVWhCQVB1RzdOOFctVnlhYTY3RV80YlgtcS1mck84eW5GSjBZWjY1VjhYald3ZElYQ1pQb0N6UEhHdF9iT3hRalU2T25vNjllWkxnY1NaVDVOV0RPctIBlgJBVV95cUxPdE1yMkNRbmZzN0xraTRHMGg4dUVVOUpkd3pBcHJ1bUxLendsM0VRajBxMHVFQUpndm1hVy10cmtKcnpLaDVHRExKTW9uNEcya2YzUG5HdFlMUUhpOXItZ0pqczU0cUZKckxuLVktMFhna0x1VUY3b3Zvd29VSlUzbTlUMXREd0dkZld1RDZ6NW8ySFd2X1FhV2hjaGZ4akNucTEzNUxhRkhTQ2dFaDV6ZFV6elhGUVNPYnpKRWNlUXpjTUNxanNkWHBoR0xDNlBIbnhjMUp1VlN4Q2JIOTJ1TVowMWFSR2ptYXlxRTVGVmg3X1VMWXhyNXpXREQzQ2FMYnhXV1RJV0hIdS1tZl95MGR4V0pOZw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1636,
    "word_count": 269,
    "gnews_title": "Stock market today: BSE Sensex ends over 500 points up; Nifty50 above 22,950 - top reasons for rally - The Times of India",
    "published_date": "28/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 28 amid DeepSeek concerns",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to see a cautious opening on Tuesday, tracking weak global market cues amid sell-off in technology stocks in US and Asian markets. The trends on Gift Nifty indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 22,915 level, a premium of nearly 68 points from the Nifty futures’ previous close. On Monday, the domestic equity market indices cracked over a percent each, with the Nifty 50 drifting below 22,900 level. TheSensexcrashed 824.29 points, or 1.08%, to close at 75,366.17, while the Nifty 50 settled 263.05 points, or 1.14%, lower at 22,829.15. Nifty 50 formed a bearish candle on the daily frame and has been making lower lows from the last two sessions. Here’s what to expect from Sensex, Nifty 50 and Bank Nifty today: The Indian stock market benchmark indices extended their losses, with the Sensex tanking by 824.29 points to close at 75,366.17 on Monday. “Technically, after a gap-down opening, the market consistently faced selling pressure at higher levels and formed a bearish candle on daily charts, closing below the 76,300 mark, which is largely negative. We believe that the current market texture is weak and volatile; therefore, level-based trading would be the ideal strategy for day traders. The 76,300 level forSensexwill be key to watch, as long as it trades below this threshold, weak sentiment is likely to continue,” said Shrikant Chouhan, Head Equity Research, Kotak Securities. According to him, on the downside, the market could slip to 75,200 - 74,800, however, if it rises above 76,300, the sentiment may change. Above this level, a pullback formation is likely to continue until it reaches 76,700 - 76,900. Derivatives data revealed the highest Nifty Call OI (Open Interest) at the 23,000 and 23,300 levels, indicating strong resistance in this range. Meanwhile, the highest put OI was concentrated at 22,500, suggesting a tightly contested support level. This highlights the cautious stance of traders amid the current market volatility, said Mandar Bhojane, Equity Research Analyst at Choice Broking. Nifty 50 index dropped 263.05 points, or 1.14%, to close at 22,829.15 on January 27, forming a bearish candle on the daily timeframe. “Nifty 50 index has slipped from its recent consolidation on the daily chart, heightening pessimism across the Indian equity market. Sentiment is likely to favor bearish trades in the short term, particularly as long as theNifty 50index remains below 23,000. On the lower side, the prevailing weakness could potentially lead to a decline toward 22,500,” said Rupak De, Senior Technical Analyst at LKP Securities. Mandar Bhojane highlighted that on the technical front, the Nifty 50 broke down from a 10-day consolidation phase, closing near the critical support level of 22,800. “This indicates strong bearish momentum in the market. If the index sustains below 22,800, further corrections could take it towards the 22,500 and 22,200 levels. On the upside, immediate resistance is seen at 23,100 and 23,300, where the highest call OI is concentrated. Failure to breach these resistance levels could maintain the bearish trend,” said Bhojane. He believes the market remains under pressure, with bearish momentum dominating near-term sentiment, and advises investors to monitor key support and resistance levels closely, as a breach of 22,800 on the downside or a breakout above 23,100 could determine the next directional move. VLA Ambala, Co-Founder of Stock Market Today, expects the Nifty 50 index to see support levels between 22,550 and 22,350 and face resistance between 22,800 and 22,930 in today’s session. Bank Nifty index plunged 303.15 points, or 0.63%, to close at 48,064.65 on Monday, forming a small-bodied candle on the daily scale with a long upper shadow as selling pressure was seen at higher zones. “Bank Niftyindex also opened with a gap down but showed buying interest near its previous swing low before closing negatively at 48,065. On the technical front, Bank Nifty found support near the recent swing low of 47,900. Sustaining above this level could pave the way for a pullback rally toward 49,000,” said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Interrmediates Ltd. (A Pantomath Group Company). However, according to him, a breakdown below 47,900 may lead to further downside, with the potential to test 47,000 in the short term. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-january-28-amid-deepseek-concerns-11738029737656.html",
    "original_url": "https://news.google.com/rss/articles/CBMiiAJBVV95cUxNZnZsNmExcjFhSGx1amxwcnNLaFBwUFRxdktWc3ZzNGNVLUl3R0ItOFNnSzc3Z3NOeUlncHljNVRDQW1kUnhKdF9vMlM1bWx3UEFsZkpNNW5xejNPeDEzdjhEYVVhNTdXb0twakF3UUpxUHFMeU9pMmZ3UE5vSGZfdnVOMW1JR2xGR1dHa3dvSUIzUUFONmJlRWRZRFVoMXgxS08xT1hzNkNIV21EaFpTTHYxclBQaXIwbjZGRFMtaFM3UjMzdnRQeHU1LThSQlZjMDhBa2k5bFhzZEZXUVVGREw2TFlVdEpTcFVNcmphbFRlcml1eHlGYUJJUE1RaDU0dll3blFtMGXSAY4CQVVfeXFMTXh0cEFOSEdqRUJGcVdEc05lemhuNFBXa05jWDcxSGNrUEJXUGRKdHlmUUZYemRQT2VxcHg4VmpJWUxfRkF3bVhUMXpjN3hOYTdYVlFfVlV0N1JvenRJcXBaMzhGZjNoYnVOd0Y1eVZySERSd3ExYjBPcmFQS2ZEX3V0TE5YeTZjM2RxMlp3N1NZZm12eXVRdWt0V25hU05Ub1hGZVlaaDZqR3BIR2xYLXBGeVVnS0xydEFFTndYQUNIVUZTeUxDWHE1R3F6Z2xlcUdIeTRMc0t5NjQ4MlBDWjVnaG1BZy1JMjFYRUg3YnFxYWk2NUQtV19tbFZkWGJRTTZ4OFVrYjdLN2JMbHVn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4921,
    "word_count": 780,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 28 amid DeepSeek concerns - Mint",
    "published_date": "28/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Indian stocks set for longest monthly losing streak in over 23 years",
    "body": "A bird flies past a screen displaying the Sensex results on the facade of the Bombay Stock Exchange (BSE) building in Mumbai, February 1, 2023. REUTERS/Niharika Kulkarni/File Photo Purchase Licensing Rights , opens new tab Jan 28 (Reuters) - Indian stocks are on a four-month losing streak, set for their worst such run in 23 years as weak earnings, foreign outflows and economic uncertainty have taken the wind out of the sails of a market that hit record highs just four months back. The Nifty 50 (.NSEI) , opens new tab and Sensex (.BSESN) , opens new tab have lost about 3% each in January, the second most in the four-month losing run. They have now tumbled 12.6% and 11.7%, respectively, from their record highs hit on Sept. 27, 2024. Make sense of global markets with the Trading Day newsletter. Sign up here. They are now even below the levels in early June when Prime Minister Narendra Modi's election victory sparked a rally to record highs. India's Nifty 50 on course for longest monthly losing streak in over 23 years The slide started in October as the quarterly earnings reports started coming in. About 60% of the Nifty 50 members posted results that either met or missed market estimates, their worst performance since March 2020, hurt by curbed government spending post-elections, above-normal rains and rising inflation. Advertisement · Scroll to continue The Nifty tumbled 6% that month, also its biggest slide since March 2020. The gloom continued into the October-December quarter, with the markets now also facing a resurgent dollar and the threat of U.S. tariffs since Donald Trump won the U.S. presidential elections. India's Nifty 50, Sensex languish in correction territory A gauge for measuring Nifty returns in U.S. dollar terms (.DNIFTRI) , opens new tab , fell 4.25% in January alone, compared with a 7% jump in 2024 and a 21% increase in 2023. Advertisement · Scroll to continue India's benchmark indexes gained about 8.5% in 2024, the least among major global peers , and their slide in January has been more than these peers. India's Nifty, Sensex underperform global peers in January 2025 FOREIGN INVESTORS FLEE Foreign portfolio investors (FPI) have pulled out $8.3 billion from Indian equities this month through Jan. 28, set to second only to the record $11.18 billion of outflows in October last year. The stronger dollar, elevated U.S. yields, tariff worries, sluggish domestic economic growth and high stock valuations will only drive more FPIs away, said Sanjeev Hota, vice president and head of research of wealth management at Mirae Asset Sharekhan. Advertisement · Scroll to continue FPI outflows from Indian shares set to rise to second highest level on record SMALL-CAPS, MID-CAPS CATCH UP While the large-caps racked up records dating back to 2020 in October, the rest of the market is only just catching up. This month, the small-caps (.NIFSMCP100) , opens new tab and mid-caps (.NIFMDCP100) , opens new tab have plunged about 15% and 10%, respectively, in their worst monthly performance since March 2020. In fact, the small-caps have fallen nearly 19% from their record highs notched in December 2024, while the mid-caps have dropped 15.5% from their all-time high. Both indexes are headed towards a bear market. \"Most small and midcaps stocks have gone up between 2x and even 6x in the last two years. To justify where these stocks are trading at current levels with their earnings is extremely difficult in a dicey macroeconomic environment,\" said Mayuresh Joshi, head of equity research India at William O'Neil and Company. India's smallcap index eyes worst monthly drop since March 2020 Reporting by Bharath Rajeswaran in Bengaluru; Editing by Savio D'Souza Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Read Next 2 hours ago Parliamentary review on central bank is watered down in new Indonesia bill 5 hours ago Asian Markets category Sriwijaya Capital raises over $200 million for debut fund, eyes $300 million cap, sources say 5 hours ago Asian Markets category Kumpulan Wang Persaraan targets 30% private market allocation in 5 years 3 hours ago Wealth category Asia draws $100 billion in capital as investors diversify beyond US, Goldman executive says 9 hours ago India category India's September manufacturing growth cools as price rises soar to 12-year high, PMI shows 35 mins ago Business category Oil slips as markets assess OPEC+ plans, demand concerns",
    "url": "https://www.reuters.com/markets/asia/s-indian-stocks-set-longest-monthly-losing-streak-over-23-years-2025-01-28/",
    "original_url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOUW4zRmZESmQ1THNVYTFELUZKODl1eTZ2QzZnRFVGLWJ6WThmbFZsR2tGOHpEei1GYlg3VnJ5Nk1icm1SZ3FRZHRhX0hlMXhwMy1TSkVjVXVvaE9MSGNlWTRDcmxHem5PZUNJZjk4Q0JicE1XSERYYWRZcXZ0alJLTzdQN3dhZEJtNWJKSG9hYmU3VmI2ODhNTmp3NzF1T2dzZDJ6SDhnVUZwd3lEck1TWWRB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4503,
    "word_count": 738,
    "gnews_title": "Indian stocks set for longest monthly losing streak in over 23 years - Reuters",
    "published_date": "28/01/2025",
    "publisher": "Reuters",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Nifty's negative candle flashes bearish signals. How to trade on Tuesday",
    "body": "Stock Market Highlights: A reasonable negative candle was formed on Nifty’s daily chart with a minor upper shadow. Technically, this pattern indicates an attempt at a downside breakout of immediate supports of around 23,000 levels, which may not be a good sign and indicates more weakness in the near term. The negative chart pattern like lower tops and bottoms is intact on the daily chart. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-27-january-2025/liveblog/117588815.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQdU1FaDZod3hqOTlFQzJqV3FlZTJYOGtqSTBKWTRLOHEtd0RhSGNMWFhHaC1ad2hTOGJBaG1Gc1VaUVR6Yjl0WExpVEZybTRVanQ1V1JPa1l0Z1V1TWJWUjJwellJR25reTJPSjd6dFV5OGNURzhnT3pjUjRTQmJOTXo1TDJqb2tJZ1I0MTRaSTZGazdWTlJyOVlFbFF1Yi1vR3AwdzFYNWRZcjBIWGg0QW1waFhiTzVMZk9sVVZ6dERreGFZYm4xRmJrNXBUYnY2bzhudzR2TdIB3AFBVV95cUxPdHhhaDRKazVFS09JZW9hUmxCUkkyVDIzaFh1OUZKQ2FSY0JXM0pXcU01cUxaSHkwaWpCUnZsRDhtVV82eFJBUnJBZkRTV2dEY1lOemZ4NWlzRW1NU2txdEFWc0tZNkszdkJaS1FXbkdOSE5NQzFLTGhmeHE3MVJNWFBZTzN1SjFOMGJpRU92RHdfOHJObm1ESmV0RUdreUhMQzgySDdFcUVqaW5NVkx1M3FjS0QwalBnT1ljaWo2TU1YVEFsN01SY3ZkWUlkSjk5YV9fSnVvQnVtWEFL?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 705,
    "word_count": 117,
    "gnews_title": "Stock Market Highlights: Nifty's negative candle flashes bearish signals. How to trade on Tuesday - The Economic Times",
    "published_date": "27/01/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Crash Today: Sensex tanks 700 points, Nifty 50 down over 200",
    "body": "Stock Market Crash Today: The stock market crashed in the early trading session on Monday, January 27, 2025, with media, mid and small cap healthcare, and mid and small cap IT & Telecom stocks falling the most. At 10:30 am IST, the benchmark BSE Sensex was down by 764.08 points or 1%, reaching 75,426.38. The broader NSE Nifty was down by 237.00 points or 1.03%, reaching 22,855.20. Also Read:Budget 2025 date and time: When will FM Nirmala Sitharaman present the budget in parliament? Among the 30 Sensex stocks, Zomato Ltd fell the most by 3.38%, trading at₹208.50. This was followed by Power Grid Corporation of India Ltd, which fell 2.96%, trading at₹287, and HCL Technologies Ltd, which fell 2.47%, trading at₹1,749.20. Only 4 out of the 30 Sensex stocks were in the green, including ICICI Bank Ltd, Hindustan Unilever Ltd, Nestle India Ltd, and Maruti Suzuki India Ltd. Also Read:Apple Watch bands have cancer-causing PFAS chemicals? Lawsuit filed over study Among the Nifty sectoral indices, the Nifty Media Index fell the most by 4.29%, reaching 1,572.90, followed by Midsmall Healthcare, which fell 3.86%, reaching 39,200.65, and Nifty Midsmall IT & Telecom, which fell 3.46%, reaching 10,325.50. The stock market closed down in the red after trading ended for the week on Friday, January 24, 2025, with media, mid and small cap healthcare, and real estate stocks falling the most. The benchmark BSE Sensex closed 329.92 points or 0.43% down, reaching 76,190.46. The broader NSE Nifty was down by 113.15 points or 0.49%, reaching 23,092.20. Among the 30 Sensex stocks, Mahindra & Mahindra Ltd fell the most by 2.92%, closing at₹2,801.00. This was followed by Zomato Ltd, which fell 2.75%, closing at₹215.80, and Tata Motors Ltd, which fell 2.48%, closing at₹733.90. Only 10 out of the 30 Sensex stocks were in the green. Also Read:Budget 2025: How couples will benefit from 'joint taxation' proposed by ICAI Among the Nifty sectoral indices, the Nifty Media Index fell the most by 2.60%, closing at 1,643.40, followed by Nifty Midsmall Healthcare, which fell 2.37%, reaching 40,773.75, and Nifty Realty, which fell 2.31%, reaching 853.55. The media index's fall was led by Zee Entertainment Enterprises Ltd which dropped 3.44%, Network 18 Media & Investments Ltd which dropped 3.27%, and Saregama India Ltd which dropped 3.16%. Meanwhile, the Midsmall Healthcare index's drop was led by Syngene International Ltd which fell 5.97%, Mankind Pharma Ltd which fell 5.05%, and IPCA Laboratories Ltd which fell 4.43%. The Realty index fall was led by Prestige Real Estate Projects Ltd which fell 7.64%, Sobha Ltd which fell 7.53%, and Oberoi Realty Ltd which fell 3.43%.",
    "url": "https://www.hindustantimes.com/business/stock-market-crash-today-sensex-tanks-nearly-800-points-nifty-50-down-over-200-101737954793810.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPUHZoT2stTzVnRi1wbE04ZmJ1MXFoSWhpX2lQLU1UVG5UN1dhUEhYd3VBdWRpODhmTTBGS0tFVkl3S2tYNmF3YjRpZUE2dVUtc1Z1cm9WRlBNVk9DVHRKTE16R1BpaDRMcXB0UUJBTTNyQUU3RTZWT3ZlMXFLQmVNald3QmdJdjdzTUxVU05YVklVV01yVnlMbG5fLXZvTHp6QnpKcGR5dXlqazVYalhNWXBNcEpSbHBXeVdOY3J6NWdER0J6dFNQcXZxbW5YS3FXMlRaeG1B0gHbAUFVX3lxTE9CWjFtQWljdmJWTGJSdVhGTUFQQ00zcVIxckZVbFdFNkhuOXI2RWFlaHBWT20xRmxGRFpjNTJmcG9ZVkRac1NOMmZXcVFLaFJLME1YaXluNTFGdzlrWGFxcFhPc3FrZGJBN3Z4aVhjZjZ2N2J4Zm9qTDRfSlRBa0hwQ3B0aWZVRUtMcmN5RmQybElnRGNDdW9meGcwOU5mQnlJVlRNSUZ0Z18xUVVxbTFZNlZHQXIzNE5kNjNlVUNtRFVyV2V0dUpyNzZHd1dZa3ZrSzJ5cWFHczZYSQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2674,
    "word_count": 435,
    "gnews_title": "Stock Market Crash Today: Sensex tanks 700 points, Nifty 50 down over 200 - Hindustan Times - Hindustan Times",
    "published_date": "27/01/2025",
    "publisher": "Hindustan Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty fall since October 2nd biggest in 10 years; 16 stocks tank over 20%",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 28 2025 | 9:39 AMIST RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8%",
    "url": "https://www.business-standard.com/markets/news/nifty-fall-since-october-2nd-biggest-in-10-years-16-stocks-tank-over-20-125012800225_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPbUpvMThSWWctTlRyVU5nSjliUXFwNTRnN2tUaXdsMWZQQms3aE9icWlXZXNsZ0daQmJxU0NRbVk3b0w2MkZwdTUyQ3l4WEZuaWMya29pSnZRU1Vpbm5XNEdWMkl4d3UxeUNyeW9VMDRGTWJrYVVVd25EN2FwU1QzdXZMYXQyM3ZiU3ZXSlptOHgybEFkd2c4dmhMSWp1RzE0d2ZYcENMZXFlQ2NTNDVpdTBHYThaQ1ZqVWl5dTJia0FpeTViSUZIS3h5eHIzWW9aaExWX9IB2gFBVV95cUxONVhaRkpTWVVoeWhTbFU3S0ttZ3VDaW43dTg3VmJQLVV4YXZySFVONnVoUXM4Ylh5NnNIUjBZTHJZTWZvR3E1NlpyUEh1QnpudXBZU21JV1JvWV9VUHNrM2ZRNVdTem9MOTllRmFaMXhjQ3hwMEhoWjlUTzQzNDlYcFE3M0dmTnFTcXRDbkZFVjgxRDB0eEpSLW9WaXh4QzVaaGFjWGhveU1CTzZmYkJfQ2VJcG1XR0RHV0VDLTBwT0JUandubWFvcXpuNGRSMWVmUGIwYk5rZ2ZqQQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 499,
    "word_count": 96,
    "gnews_title": "Nifty fall since October 2nd biggest in 10 years; 16 stocks tank over 20% - Business Standard",
    "published_date": "28/01/2025",
    "publisher": "Business Standard",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market crash today: BSE Sensex ends 824 points down; Nifty50 below 22,850 - top reasons for bear attack",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 9 Biggest Time Wasters Students Should Avoid ​8 proven tips for writing high-scoring answers in exam 8 Essential Skills Students Need for Employability 8 effective revision strategies to excel in your exams 8 things to do a day before your exam to score better 8 Clever Mind Hacks to Boost Your Academic Smarts 9 tricks to study smarter not harder during exams 9 good habits that successful students follow ​10 proven strategies to combat stage fear and speak with confidence 9 motivational quotes to help students battle anxiety A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-27-2025-dalal-street-indian-equities-global-markets/articleshow/117589563.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxNdElsNWYzemxBRzBsYW1ZSUpmNUQ5eEN3aHFpeFBpY1pSeFlwRHZodFJjTmI0Y0V3LXpXTlpnbTVTbDQ1czI3NS1INlRSN09samVpNGpVaDdGdmtKZEFqM0pwcVIyTFp6eGtuZVlHT3V3VmpXeUxNOHM4Z2pMcmoyTTItcUhKVWNrQzRkeUFobEticFFjdjN1SFhQbXVNMVBiY2NkcGJtajZ5c3ZaLVAwSjA4dlg0WXpXelVDeURYZ2Q1QjNESm4wVktPUTRXWlVjOGx6TU9jMEZXYjZrOHVlSV9ZWmhrYXQyUWVTX21uRU01emFaSl9oYnVScHhzVTkxUUlvMW5TeHZIM2R5YnhTdNIBlgJBVV95cUxQbDBOdHp2VTBGbVFCSWFMcFRCT1pzY3Q3eEFEYUowQ0MySXdPaWlNRFVpWUZkU20zVWxUeV9wWk95cngyX2ZiMEgyNWJraU9KXy0ySFA2ZzlsTk9iQkljRzhod0Z5a3QtMVgtajlFVnRnaWVFaDBCM2s0NGgtM3N3d243VUp1aTJSVnhxNk1pTWRwM0JxN1NBMmhaM3AwaVdZMHZuanJJOWRFRUlYY01FUHp5WmV6QW1hd1F5SGlmeEFCbE15LS0zcm5UUUxjSnoyWnNMVFBzMWNJS3p2RUExX1FwcWU0cGlLMEpwVTZySWgtTFlYLUFhNmd3bzZUM25UR2Zxc2E5UTNLTlJsSlFDSHVIRGJodw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3690,
    "word_count": 628,
    "gnews_title": "Stock market crash today: BSE Sensex ends 824 points down; Nifty50 below 22,850 - top reasons for bear at - The Times of India",
    "published_date": "27/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 27",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open lower on Monday, tracking weakness in global markets. The trends on Gift Nifty also indicate a gap-down start for the Indian benchmark index. The Gift Nifty was trading around 22,932 level, a discount of nearly 180 points from the Nifty futures’ previous close. On Friday, the domestic equity market indices ended lower amid profit booking, with the benchmark Nifty 50 slipping below 23,100 level. TheSensexdeclined 329.92 points, or 0.43%, to close at 76,190.46, while the Nifty 50 settled 113.15 points, or 0.49%, lower at 23,092.20. Nifty 50 formed a small negative candle on the daily chart with a long upper shadow. “Technically this market action signals rejection of bulls at the lower highs. The bearish pattern like lower tops and bottoms continued on the daily chart and Friday’s high of 23,347 could now be considered as a new lower top of the pattern. After the formation of a doji pattern in the previous week, the market was not able to show any significant upside bounce last week and closed lower by 0.5%. Hence, the bullish implication raised after the doji could be nullified,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities. According to him, the near-term trend of Nifty 50 remains weak and a slide below the immediate support of 22,975 levels could open the next downside towards 22,800 levels. Any upside bounce towards 23,350 - 23,400 could be a sell on rise opportunity, he added. Here’s what to expect from Sensex, Nifty 50 and Bank Nifty today: In the last week, the benchmark indices continued to experience selling pressure at higher levels. The Sensex was down by 405 points. “Technically, the market is consistently facing selling pressure at higher levels and is holding a lower top formation on daily charts, which is largely negative. We believe that the current market texture is weak, but due to temporary oversold conditions, we could see range-bound activity in the near future,” said Amol Athawale, VP-Technical Research, Kotak Securities. For the bulls, theSensexlevels of 77,000 and 77,300 will act as key resistance areas, while 75,700 and 75,500 could serve as key support zones for traders. If the market surpasses 77,300, it could rally till 77,800 - 78,000. Conversely, if it falls below 75,500 selling pressure may intensify, potentially slipping till 75,200 - 74,700, Athawale added. Nifty 50 continued with the downside momentum continued on January 24 after a small upside bounce of two sessions and closed the day lower by 113 points. “Nifty 50 remained volatile with a predominantly bearish bias. Sentiment continues to favor the bears as the index once again retreated from the day’s high. In the short term, the bears may maintain the upper hand as long as theNifty 50index fails to surpass the 23,450 level. Any rise toward the 23,350 – 23,450 zone is likely to encounter selling pressure. However, the downside may remain limited unless the 23,000 level is breached,” said Rupak De, Senior Technical Analyst at LKP Securities. VLA Ambala, Co-Founder of Stock Market Today, highlighted that on the weekly price charts, Nifty’s movement formed a high-wave candlestick pattern, mimicking investors’ indecisiveness. “The benchmark index is currently at its 50-week EMA (Exponential Moving Average) and almost 3% below its 20-month EMA. However, this gap is likely to be filled soon as the Nifty’s monthly RSI suggests it's still at its moderate level. Considering this situation, Nifty could gather support between 23,130 and 23,200 and face resistance between 23,940 and 23,870 in today’s market session,” Ambala said. Dr. Praveen Dwarakanath, Vice President of Hedged.in, said that the Nifty 50 formed an inverted red hammer candle, indicating weakness in the index to continue. “Nifty 50 index sold off during the day after a bounce from its immediate support at the 23,000 level. The momentum indicators are well below the oversold region, which can be a possible reason for the bounce, however, one can sell the index on every rise, until the resistance at the 23,800 level is not taken off,” said Dwarakanath. Options writer’s data for the January monthly expiry showed increased writing of the calls at the 23,100 and above levels, indicating a bearishness in the index, he added. Bank Nifty dropped 221.20 points, or 0.46%, to close at 48,367.80 on Friday, forming a high wave doji candlestick pattern, reflecting cautious sentiments. “Bank Niftyformed a red doji candle with the upper shadow bigger than the lower one, indicating selling pressure in the index. The immediate resistance for the index is at the 49,500 level, until which, one can sell the index on every rise. The momentum indicators are in the oversold region, which can be a reason for a small bounce, however, it would be an opportunity for fresh selling at higher levels,” said Dwarakanath. Options writer’s data for the monthly expiry showed increased writing of the calls at the 48,400 and above levels, suggesting a weakness in the index, he added. Amol Athawale said that for Bank Nifty, as long as it is trading below 49,000, weak sentiment is likely to continue and on the downside, it could fall to 47,500 - 47,200. “Conversely, if it rises above 49,000, it could bounce back to the 20-day Simple Moving Average (SMA) or 49,500. Further upside may also continue, which could lift the index up to 50,000,” Athawale said. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-january-27-11737941411738.html",
    "original_url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxOdU1scTNVLU5ZYS1xLUhteG9CSk0tbmtrend6YnV3TDdPTDVIWURUOXpyU20wRUprV3diYkpRa3JyaThJQ29qQm8zZTRiTDdYemI1ekZDRkVDX0ZIaXRLR1VsSFpVM3ZjT09NYXZlOTdBMm5tRDBHNVg1UjRGUlpId20yb1FRU2U3QVYyVHJENFJaalZWZWJOUUNKUjRzQmMzUy04c2tWMGxzVVlhVUJRWmlacm9qYnNqV3BhSkVJLVpWSHhmTXBsT0JNbThvTlJyYnZPdE5FelFUV2c1RlBUUHdsQ3lyaDhDbnfSAe8BQVVfeXFMTk5pcWY4bUxicXFEMlF0RG1BOVl5U2JabDA2ZTFGUmxKUE1DY0hPdEoxZzlmaHpOd3gzVmkwdmEzc1VNeW54NkRTN0Y4bjFCRG4xSDNJZVBFQjlZajN1ajNBaG5aemNXYTlOOTJ1Rno5MjFpWE9yY0luMW1udHNjX3E1N2RzMlZuX2l1ODkzdjIzeFlCS2hXcUVJTTFrdnA2Y0x2NC1kZWczMHRHcXphMHZwZFRHRlYxRnY0YS1vWTUtbS1uaGRNSFdmMTVNY09FTlhiOWF1c3lsYnJldFNETXg0YzdGV1V5VWhhbXpCYnM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5903,
    "word_count": 961,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 27 - Mint",
    "published_date": "27/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Nifty sell-on-rise trend continues; 23,100 resistance in focus. How to trade on Wednesday",
    "body": "Nifty formed a doji candle with a shadow equal on both sides after the gap up, indicating indecisiveness in the index. The index was sold off from its high by more than 0.5%. Also, at the day's high, India Vix was stable, indicating a possible reversal from the current levels. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-28-january-2025/liveblog/117615774.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPc0toUUhpS3ZvUHdDTU9vdDZCU3lRaWVuWnVfaWt5a3NaNnVsQ0JpZWh0a1J0d2VBSll5SVdVa0x0aHhTYU9aUXFnVHlTTElwR1B0c1B1eTcxQWRlaGZPelVFSWFXZGZPWkN0ZUIyUThLd1Uta3hnT2tXVjRINGlJd1dvMEtZbGoyYWs3YlFrQjlMZzJpbjBMd0xsbjV6VUpiQzBFeXdNeGlRdHNIYlpMcVM4YndCdXM1WXo1dG5HVEVjdXZqc21XaWtidGdMbWFnM3B4VGJKd9IB3AFBVV95cUxNSE1UMm5ORElnNFk4VDJDV21ZV1VCMVFWdDg2aXpOTklGdUwxalg1cDdZUF9SSlJSVlowcTlGWGl2M2NucU1vMlN1Uk8ybjU5VFV6QzVuZFVUQ09DVDBfQmJFa0lrS3dRWlE2UHpDTkNKbUdJU0MxcDF5eVc2VkFRN3pKdld0MmxWLWdzTmJsaG9wWm9HZnQ3RldpbkZHY192ZzVjYnRIWklRRzJqekJuZnFCSzNEWF9oNXZjZmE0SWlBajBjQXBDTU9XTU03SnA5ejR3M1RwOFV5VGNJ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 591,
    "word_count": 102,
    "gnews_title": "Stock Market Highlights: Nifty sell-on-rise trend continues; 23,100 resistance in focus. How to trade on ... - The Economic Times",
    "published_date": "28/01/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex, Nifty 50 Today: Stock market opens in the red as consumer durables, auto and IT fall",
    "body": "Sensex, Nifty 50 Today: The stock market opened in the red as trading began on Thursday, January 30, 2025, with consumer durables, auto, and IT stocks falling the most. At 9:20 am IST, the benchmark BSE Sensex was down by 75.17 points or 0.10%, reaching 76,457.79. The broader NSE Nifty opened flatter by 3.85 points or 0.02% in the red, reaching 23,159.25. Also Read:US Federal Reserve doesn’t 'need to be in hurry' to lower interest rates, says Jerome Powell Among the 30 Sensex stocks, Tata Motors Ltd fell the most by 7.19%, trading at₹698.35. This was followed by ITC Hotels Ltd, which fell 3.14%, trading at₹173, and Infosys Ltd, which fell 0.79%, trading at₹1866. Also Read:US dollar firmer against peers after Federal Reserve keeps interest rates unchanged Among the Nifty sectoral indices, the Nifty Consumer Durables Index fell the most by 1.33%, reaching 36,884.65, followed by Nifty Auto, which fell 0.95%, reaching 22,370.70, and Nifty IT, which fell 0.50%, reaching 42,700.60. Only five of the indices were in the red, showing the broader market was doing better than the top stocks. Also Read:‘Pretty terrified by the pace of AI development’: OpenAI researcher quits, claims labs are taking ‘very risky gamble’ The stock market rallied towards the previous close and ended in the green on Wednesday, January 29, 2025, led by mid and small cap IT & telecom stocks, real estate stocks, and mid and small cap financial services stocks. The market rallied towards the close even towards the end of Tuesday's trading session, but that one was led by real estate, financial services, and PSU Banks. The Sensex closed 631.55 points or 0.83% up, reaching 76,532.96. The Nifty was up by 205.85 points or 0.9%, reaching 23,163.10. Among the 30 Sensex stocks, Zomato Ltd rose the most by 6.79%, trading at₹222.50. This was followed by Tata Motors Ltd which was up 3.29%, trading at₹752.45, and Infosys Ltd which was up 2.83%, trading at₹1,880.85. Only 7 out of the 30 Sensex stocks were in the red. Among the Nifty sectoral indices, the Nifty Midsmall IT & Telecom Index rose the most by 2.93%, closing at 10,377.85, followed by Nifty Realty, which rose 2.91%, reaching 888, and Nifty Midsmall Financial Services, which rose 2.76%, reaching 14,979.85. The Midsmall Financial Services index's rise was led by KPIT Technologies ltd which rose 9.28%, Zensar Technologies Ltd which rose 8.11%, and Persistent Systems Ltd which rose 6.69%. Meanwhile, the Realty Index's rise was led by Brigade Enterprises Ltd which was up 8%, followed by Mahindra Lifespace Developers Ltd which went up 4.53%, and Prestige Estates Projects Ltd which was up 3.89%. The Midsmall Financial Services index rise was led by Indian Energy Exchange Ltd which rose 7.06%, Computer Age Management Services Ltd which was up 6.71%, and Indian Bank which was up 6.12%.",
    "url": "https://www.hindustantimes.com/business/sensex-nifty-50-today-stock-market-opens-in-the-red-as-consumer-durables-auto-and-it-fall-101738206757031.html",
    "original_url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOT2ZKZ2Fvb2dtcHhCX3hhRUhWYlFFYlVCSVZ1aDRjYTdGX1VMV2VrRlFManRkbkJEUl9IMHZ2WGN6RzhoWlhwSkY4WU9pMVhRcW5xOUkwalJmRFp6aFU2anRNY3hMY0dyRmVxbGFicFNzYjlfX0ktdHl6dDNraGxZMExDZFRSS190MXpJcTRhVk9EODBDS2hfazF2c2xNUExIYlhsNTc0VEFEODl0UXFUdi14Z0xoV3lBSmJ3cXdJaGp0VmxRSm1CeHNVNG0wYXNLYy1CbENoMFN3NVM3QWhxWW9ybnrSAeoBQVVfeXFMTmNncW5TMndick11dmZhTWNaMEE5OU4weVhxWmM2NWl2SS1JMWJvUXRIUmlfalNZMHdjcHBqVjY3dFdxaEh1MzBjcEEtSWNNYS02SXp3bEVBc0NPZk1SQ1NManFiaXB2c1M2TFZIN2hya3hVNURVd0tyaG5xZnZtdWJWdE1KQzhfVFdfZGlXMUoyN0VXdEJCbHRVR3Q4X00zR1RWWTlWXzRaVDVsRHJUYS1aN2MzdGxtaVZoUFQweENCZndwbHQ5a1AzMXdBWXpCQWstVjg1ZjMxeHk4bWtfeVh5UmMtNUJJRlhB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2838,
    "word_count": 468,
    "gnews_title": "Sensex, Nifty 50 Today: Stock market opens in the red as consumer durables, auto and IT fall - Hindustan Times - Hindustan Times",
    "published_date": "30/01/2025",
    "publisher": "Hindustan Times",
    "topic": "Nifty 50 stock market India"
  }
]