[
  {
    "title": "Stock Market Highlights: Sensex ends 345 pts higher and Nifty50 reclaims 16,000 as market makes a comeback after 4 days",
    "body": "Stock Market Highlights: Sensex ends 345 pts higher and Nifty50 reclaims 16,000 as market makes a comeback after 4 days Stock Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty50 finished a choppy session higher on Friday, led by gains in financial, FMCG and auto stocks though losses in select IT and metal names played spoilsport. Broader markets also strengthened, with the Nifty Midcap 100 and Nifty Smallcap 100 indices rising 0.8 percent and 0.3 percent respectively. Investors awaited more of financial results from India Inc for cues. By CNBCTV18.com July 15, 2022, 5:30:56 PM IST (Updated) 1 Min Read Stock Market Highlights : Indian equity benchmarks BSE Sensex and NSE Nifty50 finished a choppy session higher on Friday, led by gains in financial, FMCG and auto stocks though losses in select IT and metal names played spoilsport. Broader markets also strengthened, with the Nifty Midcap 100 and Nifty Smallcap 100 indices rising 0.8 percent and 0.3 percent respectively. Investors awaited more of financial results from India Inc for cues. Catch highlights of the July 15 session, and more, here : Continue Reading First Published: Jul 15, 2022 7:49 AM IST Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags Brent crude oil BSE Sensex crude oil HCL Tech Mindtree Nifty 50 rupee dollar",
    "url": "https://www.cnbctv18.com/market/stock-market-news-live-update-nifty-sensex-jspl-lti-ltts-rupee-covid-crude-gold-14139602.htm",
    "original_url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNcnlTdGxMZHRsV1VBUFI2TkZkSXdhNjlzalNmaUZnMGRMa0pLTk15ZVllaFFlOHF4aElDamVNZVp6SFhid3lHSWhOMk1yX1FhdTdKSDBRaGx6dUwyYTlZOV9VZXFKY055WW5GYkgzdFhkLUo0cklJVW1DLWo5S3RYUGhrWE5EejhJZGQ0S1otV1B0WXBobVZ6azB1c3ZhY0I0MjBkS2Q0aW9RQ205SGNXZGJseDNwbnhRR0lCMWN5TFJfZ9IBxwFBVV95cUxNc0s1MHJicVAtRGlObk53amlrZ0x1UDJhRjRzOXRtclpTSTVXbVNPbEtoQ2U1ZFoyWFZkNDg1S0VNY3d0OGd0LUVpaTBZMTBJNll1R0JYajAtbDJERkp6Q0x4eWloRUE0Vl9za2V5SUZHLVZSclFNSzN5UkswTUtMdEVmd3R4UThZSXNZckRyWkpiemJpNGFCVTBXOHNZODVDM0FqYVJKUnh1MllYRFc1OUdzYnlDZzhHaG0zRENFVVAyNHRIUFo0?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1453,
    "word_count": 237,
    "gnews_title": "Stock Market Highlights: Sensex ends 345 pts higher and Nifty50 reclaims 16,000 as market makes a comeback aft - CNBC TV18",
    "published_date": "15/07/2022",
    "publisher": "CNBC TV18",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "STOCK MARKET HIGHLIGHTS: Nifty50 shows signs of weakness; support seen at 17,480",
    "body": "#MarketsWithETNOW | Check out the #FundFlow activity for August 25th! https://t.co/QHW0ZMorC7 - Rupak De, Senior Technical Analyst at LKP Securities - Vinod Nair, Head of Research at Geojit Financial Services Rupee falls 3 paise to close at 79.89 (provisional) against US dollar - Kunal Shah - Senior Technical & Derivative Analyst at LKP Securities LIVE | Market Makers with @1shankarsharma @AyeshaFaridi1 #StockMarket #StocksToWatch https://t.co/gNaPrkIlG9 - Nitasha Shankar, Head - PRS Equity Research, YES SECURITIES #MarketsWithETNOW | Piramal Enterprises will be demerging its pharma business into a separate entity – Piramal Phar… https://t.co/vaHOQgELew - Anand James - Chief Market Strategist at Geojit Financial Services #BrokerageRadar | CLSA on @TataPower: Maintain Sell as the stock remains expensive, targets for 4x PAT over FY22-27… https://t.co/CRyjQMsZFE Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-25-august-2022/liveblog/93764421.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOdmd5RWIwMHNiMDRkenI4T2VOekw2SWE2YVo5N2FaM3ppTFpzV1F0NWRIQmNYM1hLWW5mYUI5Y2E4Ykh1MFVoX191MVJiOG5hWHA3alFNdnprb2cwRElVV0U4eldUZnItRUMxakowQlFtanhNbXFaRkRaQ1JUU1Y4VWNDYmVIbDN2MlZDYUM1blBXb0N3QzFDaDhlLUswb1JyQXZPQXQtdFZxYU1PV09wWlBZY1I1amhCMDFqTUhUXzNFeF9YQ1BOR0tPR0R6cEVmRmRQY9IB2gFBVV95cUxNblVFVUlsSVluODJNZGhYYjdiay1wQjdHYUNNQ09rbHprLVlSU1ZzR2wzWlpzZzhWMFZFTDYzYjF1U1JxZmFndEtYZnF3NnRaZnRsRDZRYXJ5ZGktQXU0bl90VzRBU0ZhbHBsSDdiNEZTNzJWWW54R05BdFY2a0pKTW5HT2pmeVAxZ0l0LVJVaU16N21HOFZyQlVxQURLUTFEcnB2eG04SGgxcW1ic0dmNU1iYkVuVVp6UElnYVE2QzZmNm0xTXI4MGlQT1h2cnZDTWtFNzk1cW53dw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1185,
    "word_count": 174,
    "gnews_title": "STOCK MARKET HIGHLIGHTS: Nifty50 shows signs of weakness; support seen at 17,480 - The Economic Times",
    "published_date": "25/08/2022",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Today: Sensex rallies 1,534 points, Nifty ends above 16,250-mark amid positive global cues",
    "body": "Stock Market Today, Share Market Updates:The topline equity indices recovered theirprevious session’s lossesand ended nearly 3 per cent higher on Friday taking cues from their global peers which rose after China cut a key lending benchmark to support a slowing economy. The S&PBSE Sensexsurged 1,534.16 points (2.91 per cent) to end at 54,326.39 while theNifty 50climbed 456.75 points (2.89 per cent) to settle at 16,266.15. Both the indices had opened over 1.5 per cent higher earlier in the day and surged more as the session progressed with the Sensex touching an intraday high of 54,396.43 and the broader Nifty hitting 16,283.05. All the Sensex stocks ended higher on Friday with the top gainers being Dr. Reddy’s Laboratories, Reliance Industries (RIL),Nestle India,Tata Steel, Larsen & Toubro (L&T),IndusIndBank, Axis Bank, Sun Pharmaceutical Industries and Housing Development Finance Corporation (HDFC). All the sectoral indices on the NSE ended in green on Friday. Nifty Media index rose 4.47 per cent led by gains in the shares of Sun TV Network, Network18 Media & Investments and Inox Leisure. TheNifty Realty indexclimbed 4.21 per cent aided byMacrotech Developersand ThePhoenix Mills. This apart, the keyBank Niftyended 2.88 per cent higher following a rise in share prices of AU Small Finance Bank, IndusInd Bank and Axis Bank. In the broader market, the S&P BSE MidCap index ended at 22,506.85, up 437.12 points (1.98 per cent) while the S&P BSE SmallCap settled at 26,351.29, up 550.25 points (2.13 per cent). The volatility index or India VIX on NSE declined 5.93 per cent to 23.10. Commenting on the market rally on Friday, Vinod Nair, Head of Research at Geojit Financial Services said, “The market displayed a confident yet calm rally throughout the day, supported by fortified global markets, especially the Asian market. The Chinese Central bank cut a key interest rate to support growth, injecting optimism into emerging markets. With concerns over an economic slowdown and rate hikes across the globe, investors will continue to invest with caution. Value stocks should do well during this consolidation period.” Shares rebounded on Friday after China cut a key lending benchmark to support its economy, though a global equities gauge remained set for its longest weekly losing streak on record amid investor worries about slowing growth and highinflation. At 0833 GMT, the pan-European STOXX 600 was up 1.2 per cent and set for its first daily gain in three. The MSCI world equity index, which tracks shares in 50 countries, rose 0.5 per cent but for the week was still shedding 1 per cent and on track for its seventh consecutive weekly decline, its longest losing streak since its inception in 2001. The gains in Europe and Asia came after a late Thursday rally on Wall Street petered out, leaving the Dow Jones Industrial Average down 0.75 per cent, the S&P 500 0.58 per cent lower and the Nasdaq Composite off by 0.26 per cent. -global market input from Reuters Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/equity-markets-stocks-shares-bse-sensex-nse-nifty-oil-rupee-prices-global-cues-may-20-7927030/",
    "original_url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxQbjctbDZLRHNwTHVjTE1Kck82a20xRDBmbC1Bb0lFelpjNl94MU5fOHgtaXN1V0tjSzJhRmprZ1FONnZGT3BXZEZUVmsweENjY3Vnc0VPVEY0UmhCVnU2TW1zaDVyNkc2RGVCMWZKSk5aeFoxMGxXZ0ppd0FtX1VNWXlXZjFuclB6QXJqbWIyX29qWC1oSHdBZWE0a1ZPeXQ5dnltaWFibkswLXhyWU9pdUcwRm1mREN5enRmZjAxYW5tMk5mQ1JXVXZ2cS11aURubFlEQzJpdXp6RjRz0gHjAUFVX3lxTFA3eDN6WkU3YXZ4djVXV2FfVzRhZVFQNjdMRURiQ05paEJKb1FIWnBvekNwU1dQQjBDZS1RWUZUbndUVTduNFJPRU05RDhBRW9mX1pvRmJvOXZJaTlMYmRRM0d0NHlpYVhuNFQ5RHFaZ2JPcG5rTGlvbHJ0WVpMcndndGN5a1o2R3JuUWRKenZmZzNfQzBHMW8wbG5rZnFkTjVuOUd5OTFmcTBmazVrTDZRSzFGUVIyaXI2Wm5xM2RRbDFyUTI0NzhNbVBVdGxCR3RsdEdoSFlwckJsYUtnMDZDaVZN?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3387,
    "word_count": 552,
    "gnews_title": "Stock Market Today: Sensex rallies 1,534 points, Nifty ends above 16,250-mark amid positive global cues - The Indian Express",
    "published_date": "20/05/2022",
    "publisher": "The Indian Express",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Indian shares close out 2021 with best gains in four years",
    "body": "People walk past the Bombay Stock Exchange (BSE) building in Mumbai, India, March 9, 2020. REUTERS/Francis Mascarenhas/File Photo Purchase Licensing Rights , opens new tab BENGALURU, Dec 31 (Reuters) - Indian shares on Friday locked in their best year since 2017, driven by an economic recovery from the pandemic-led slump and infusion of massive liquidity, even as valuation concerns and a raging new coronavirus variant brought in some caution towards the year-end. The NSE Nifty 50 index (.NSEI) , opens new tab gained 0.87% to 17,354 and the benchmark S&P BSE Sensex (.BSESN) , opens new tab rose 0.8% to 58,253.82. The NSE and BSE indexes rose 24% and 22%, respectively, for the year. Get a look at the day ahead in European and global markets with the Morning Bid Europe newsletter. Sign up here. India's blue-chip Nifty 50 was one of the best performer among emerging markets in Asia in 2021, and outpaced the MSCI World Index (.MIWD00000PUS) , opens new tab which rose 17%. \"What we saw over the past two years was mostly a liquidity supported rally. If the U.S. Federal Reserve goes ahead with a faster than expected tapering and there is reversing of interest rate cycle, then these are definitely going to impact the market,\" said Ajit Mishra, VP - Research, Religare Broking. Advertisement · Scroll to continue \"Almost all the sectors are trying to recover to pre-COVID levels and these kind of repeated infections (like the Omicron variant) will definitely dent the sentiments.\" Investments in Indian markets and Nifty index performance Purchase Licensing Rights , opens new tab Indian equities scaled a record high in October, but have retreated nearly 7% on worries over high valuations and the spread of Omicron across the globe. Indian authorities began to impose stringent rules on Thursday to prevent mass gatherings at New Year parties and public venues to combat a spike in COVID-19 infections. Advertisement · Scroll to continue This year also saw several initial share sales, including those of India's biggest from digital payments start-up Paytm (PAYT.NS) , opens new tab , as ample liquidity and strong retail participation pushed the stock market to record levels. Meanwhile, Indian ministers on Friday deferred plans to hike tax rates on textile items, the federal finance minister said, after protests by industrial associations and some states. read more Advertisement · Scroll to continue The Nifty bank (.NSEBANK) , opens new tab and metals (.NIFTYMET) , opens new tab indexes were the top boosts on Friday, rising 1.2% and 1.9% respectively. Breakdown by sector for Indian equities performance this year Purchase Licensing Rights , opens new tab Reporting by Nallur Sethuraman and Chris Thomas in Bengaluru; Editing by Shailesh Kuber Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Read Next 17 mins ago Business category New Tesla sales in Spain rise 3.4% in September, other EV sales surge 19 mins ago Boards, Policy & Regulation category Widely-used stablecoins need to be regulated like money, BoE's Bailey says 24 mins ago European Markets category London's FTSE 100 hits new record high as healthcare stocks surge 33 mins ago Sustainability category Dutch pension fund ABP sells stake in Caterpillar 1 hour ago Sustainability category ECB backs fewer bank buffers, simpler rules for small lenders, de Guindos says 1 hour ago Euro zone inflation picks up, bolstering ECB's case for staying on hold",
    "url": "https://www.reuters.com/markets/europe/indian-shares-track-best-year-since-2017-2021-12-31/",
    "original_url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPY3d4bDF0OWNyNi1mVzd1Q2EybGwwOUdpWndyWkprNnBzWS1yRXBGZVNqamQwQ0FBVktzcDhoS1JGbzZKdWctNThzdi1yMktISDRCYUQzbXVwMGVLT21wNElMUmV0d19GaWpjLVJ0RzBJMmMwOFFaTGNHem96SXdWSWVsWXJCcU14VXZLU2p0cUVjSnNtR0E?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3519,
    "word_count": 572,
    "gnews_title": "Indian shares close out 2021 with best gains in four years - Reuters",
    "published_date": "31/12/2021",
    "publisher": "Reuters",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Nifty50 ends 2 pts shy of 17,700 and Sensex rebounds 350 pts from day's low",
    "body": "Stock Market Highlights: Nifty50 ends 2 pts shy of 17,700 and Sensex rebounds 350 pts from day's low Stock Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty50 scaled fresh four-month closing highs on Friday, as Dalal Street headed into a long weekend on account of the Independence Day holiday ahead. Gains in financial, metal and oil & gas shares pushed the headline indices higher, though losses in IT and healthcare counters capped the upside. Broader markets also strengthened, with the Nifty Midcap 100 and Nifty Smallcap 100 indices rising 0.7 percent and 0.3 percent respectively. By CNBCTV18.com August 12, 2022, 5:24:52 PM IST (Updated) 1 Min Read Stock Market Highlights : Indian equity benchmarks BSE Sensex and NSE Nifty50 scaled fresh four-month closing highs on Friday, as Dalal Street headed into a long weekend on account of the Independence Day holiday ahead. Gains in financial, metal and oil & gas shares pushed the headline indices higher, though losses in IT and healthcare counters capped the upside. Broader markets also strengthened, with the Nifty Midcap 100 and Nifty Smallcap 100 indices rising 0.7 percent and 0.3 percent respectively. Catch highlights of the August 12 session, and more, here : Continue Reading First Published: Aug 12, 2022 7:53 AM IST Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags BSE Sensex Hero MotoCorp india stock market IPOs Nifty50 ONGC",
    "url": "https://www.cnbctv18.com/market/stock-market-live-update-share-today-nifty-sensex-hero-ongc-syrma-sgs-ipo-14453372.htm",
    "original_url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQVFVsMFNxeUZxRjA4d2dhSDhPVWU0b1J2eWtkalZqZzZNSFI0dGttcWM3V2R2cU8wLUZPMWMwUTZ3R2dNZFVyV3lNUWVnMUFMYVRLTkk4Z2kyU05wX1NGcXRRM1hNbzZZMkJDeWw2LXBqQjdMOS00dGgxLXQ4VjFNRXRGR3NreXZORDNxeTl0WVNwYlBZM2ZXOExtM2pTdE9wemlEOUZTY3pXak54NTRWeVdqUjZsVzQtY3fSAb8BQVVfeXFMTmdwVFdCZmp6bkNoamliMXltNV9aVzdzNG5ONEtOdTJGSWVadFlRUUxGcDhVWF84X0dxLUVSRGg3OG12dlVjb0pVd1BmaWhJcVJaNDN0b2xuSDhmbWRsTmxDYnd2ZWZVcXRJT3E3SnQwTG1pdW5PLWRKRnZtZTM0bmYyVkRXRzkyLUhLNFY3SzQxalViN1QtY1JTTi1TWjY5WWc1SEwtRDJVODBuQU9ZNTVFZTFMX3Zlel9nV3BuemM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1553,
    "word_count": 251,
    "gnews_title": "Stock Market Highlights: Nifty50 ends 2 pts shy of 17,700 and Sensex rebounds 350 pts from day's low - CNBC TV18",
    "published_date": "12/08/2022",
    "publisher": "CNBC TV18",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Nifty50 bears in driving seat; further downside on cards",
    "body": "- Rupak De, Senior Technical Analyst at LKP Securities - Vinod Nair, Head of Research at Geojit Financial Services - Anil Kumar Bhansali, Head of Treasury, Finrex Treasury Advisors - Dr. VK Vijayakumar, Chief Investment Strategist at Geojit Financial Services - Shaktikanta Das, RBI Governor - Shaktikanta Das, RBI Governor - Shaktikanta Das, RBI Governor - Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/sensex-nifty-live-today-2022-05-04/liveblog/91301145.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQVW1ES05YMUlFbXhZQTVsOHRvMFhiNHR1Q3RrR2tfNXBULXRmLXNFNkxRUWhDRnY0SXhUOFFGbHRTeGJzMjBkdjlZNDhjNW5LM0ozQ0FLWmVrdy12Z2N2SEdZbmtNY0ZaWXh4cW9ZaFlEMW8wRU1jb2lPOW9YT3FfVDZya3pLUDc2Z1B2bNIBkgFBVV95cUxQSUFQS3NjMC1QNVJWSWlNOGpLUEx2cThlTi1Udm1JY2VpUGxtQlNIMV9QcWJpRWdJRGY2NnhCUkNVVG5laG9nXzlrcW5ZSm9zWlVHN0NvcjlZNzRGZGEzZzJnNUNIUGJlSlJ2Z0RsYjFQRnRiZVc4RmNFUldtQ3FkcnNMbDZ5ZU9TR1E1aG10V0VIUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 749,
    "word_count": 119,
    "gnews_title": "Stock Market Highlights: Nifty50 bears in driving seat; further downside on cards - The Economic Times",
    "published_date": "04/05/2022",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Closing Bell: Nifty ends above 15,800, Sensex gains 180 pts led by auto, bank, power, realty; IT drags",
    "body": "The Nifty opened on a positive note & attempted to build upon the early gains. On the higher side, however, it stumbled near the 16000 mark. Thus, the index oscillated throughout the day & ultimately formed a Doji pattern on the daily chart. This shows indecision in the minds of the market participants. The index is expected to stay under pressure as long as it trades below 16000. In that case, it can test the March low of 15671. On the flip side, if the bulls manage to take out the 16000 mark on a closing basis then the Nifty can take a leap towards 16200-16250.",
    "url": "https://www.moneycontrol.com/news/business/markets/share-market-live-updates-stock-market-today-may-16-latest-news-bse-nse-sensex-nifty-covid-coronavirus-bank-of-baroda-tech-mahindra-maruti-suzuki-india-amber-enterprises-eicher-motors-alkem-lab-8511511.html",
    "original_url": "https://news.google.com/rss/articles/CBMi8wJBVV95cUxNRDA3aHcyZUtjQkNOUnYzclVNQV9nMkNJQTlxa284ZjZ6bTVNMS1GU3hsRkIyQkhNSnNNX1Nyc1FMZHZJVHNseXFIWEtYbHZWMXRTRnR0Q0tMX01HRVVQZmF4Wk14X1hUM3d3Qm1odjVQbVN1czBUcjR3QjFzaWxXU21TWHBwNVpNc21oRVJfQVRKN0tma3VHNHBiSTJwVEhHRk9MUmVjYUF6RERKVXRzVnB0bnRHU29UWWlMT0xKUjN3X0p2cWNDT19CSy1zVTl3R1hjOXBHTEhmOEZPSEdkeEhtbUR1LUh6OUp1RTF0c1Rob2dpX3poVVJ0UHAzcXVfa3ItaWtva2lndjcxRXQ1dE5IaDJHcEpqaTVUSGNLUUttQzIxVTBIOFltSU1wSEJKdEtQQU15LXFzQnJMaVFIOUdxek9OZzN0TWlCaDdiazhRRGkwVUhkNFFKcXZnZ3g1VmhZUTJZTjBJTjRjS3R3c3VoNNIB-AJBVV95cUxOMjZrNG5WR0RwV1Jfb0hwQUQ1MjJadjE3bFdVdXRfRXBKdmtUd1dhNzhLS3BSajljaEtMVmZ4bjRBdEpFWEJHZWZKVFJBeUktemM4NkJkWjh1M0hiOHVPeXNWY21BOVZUTXl6NE1lbWVyWVVHTGNUZmFEWFphOGtlSlFCaWU0NlM3cGZBczJQQ3ZfbnhpSXZ2U2tmaWh1RHZqOTR2YWsxbjJGWkJmZzVUQnVBUXRDOVNYcWtIeVFsRENGemx1Z0xqYUsyOXlKeTZkNHdpaDRMdG1EcjVRY1dyVGliVTJTd2pYMFFGb0FicXJ0OFFKQ1VYOG9CUDNjYnZ6RGlRWmhkZnZ6MnZYQnV3NGE0ejFDakZKbExPOXhLVHc0SG9VTmFIZWMyZWxiSTF4QnVqUFJYZktVTWJ4T0hsSnhyR3J0bGFkZXZIcHhxSnpXMmVic1k4TjMwb1lyb1phLUxiMXdHWU11TzZsV1RTRzBqVi1MdERZ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 569,
    "word_count": 106,
    "gnews_title": "Closing Bell: Nifty ends above 15,800, Sensex gains 180 pts led by auto, bank, power, realty; IT drags - Moneycontrol",
    "published_date": "16/05/2022",
    "publisher": "Moneycontrol",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Sensex and Nifty50 scale 4-month closing highs — rupee slips to 79.64 vs dollar",
    "body": "Stock Market Highlights: Sensex and Nifty50 scale 4-month closing highs — rupee slips to 79.64 vs dollar Stock Market Hhighlights: Indian equity benchmarks BSE Sensex and NSE Nifty50 clocked their highest closing levels in four months on Thursday tracking strength across global markets, after a better-than-expected inflation reading from the US eased growing concerns about steep hikes in COVID-era interest rates. Gains in IT and financial shares pushed the headline indices higher, though losses in oil & gas counters limited the upside. Broader markets also strengthened, with the Nifty Midcap 100 and Nifty Smallcap 100 indices finishing 0.9 percent higher each. By CNBCTV18.com August 11, 2022, 4:08:37 PM IST (Updated) 1 Min Read Stock Market Highlights : Indian equity benchmarks BSE Sensex and NSE Nifty50 clocked their highest closing levels in four months on Thursday tracking strength across global markets, after a better-than-expected inflation reading from the US eased growing concerns about steep hikes in COVID-era interest rates. Gains in IT and financial shares pushed the headline indices higher, though losses in oil & gas counters limited the upside. Broader markets also strengthened, with the Nifty Midcap 100 and Nifty Smallcap 100 indices finishing 0.9 percent higher each. Catch highlights of the August 11 session, and more, here : Continue Reading First Published: Aug 11, 2022 7:47 AM IST Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags BSE Sensex Coal India india stock market IPOs Nifty50 Tata Consumer US inflation",
    "url": "https://www.cnbctv18.com/market/stock-market-live-update-share-today-nifty-sensex-coal-india-hindalco-eicher-14439512.htm",
    "original_url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPN3FKWkxGX3dhRWNGRFlNWlhTa1EzRm1XTEp1ajBPWGpiTURzNms2UTc3MVVybVJTQVVTNkVheGtvRHJZWkZvQlM2aEFHM1ptcURSanhXMVkxc2VqbUVsZmtTamVjM1RTa3dsbGozd2pyNnFDdFBCNzhiSkRVU01sel8zQUsyZzliaU9YOUIyVkxLSEhqZHZpaURsNmtCRExMMXNQeThqWFZ1ajdfWkhoWEp1MkRPcV9xVjR3N3FB0gHDAUFVX3lxTE5XME1IbVdMbHRLVHgzR2tCeDJodUZ1cDBQUVMtYl9XUTN6SThHdHdUSG10d3c3OXpKc1pXTVlGWUt5ZjJUa3NDODlWcjhNZUpOMWxjTVNIT3ROTlpBVFJvUkdmS2NlQTRpcmNsbVQ4RTU5V1NlZUY1TTU2ZTVXWWJJeE5NUlY5Q1dhTThDNjIxb3B5ZGFEZXBvdHFDSkIwSFlxSEw0SzhwSXg4WnFoeHBFcGgwaWRIUkdpWjhFck9ybDh4dw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1691,
    "word_count": 263,
    "gnews_title": "Stock Market Highlights: Sensex and Nifty50 scale 4-month closing highs — rupee slips to 79.64 vs dollar - CNBC TV18",
    "published_date": "11/08/2022",
    "publisher": "CNBC TV18",
    "topic": "Nifty 50 stock market India"
  }
]