[
  {
    "title": "Sensex, Nifty close at record highs: 3 reasons behind stock market optimism",
    "body": "Indian benchmark indices on Mondayclosed at record highsonce again as market sentiment remains high. S&P BSE Sensex rose 1 per cent or 486.81 points to 49,269.32, while NSE Nifty 50 ended at a record closing peak of 14,484.75, up almost one per cent. A good start to the quarterly earnings season, ongoing vaccination developments and hopes of a higher stimulus package in the US boosted domestic markets in India. Higher foreign fund inflows also contributed to domestic market’s performance today. The rally in IT stocks was a major reason behind higher optimism on the trading floors of Dalal Street. IT stocks led from the front today and remained top gainers on the indices. Top gainers on the 30-share Sensex pack included technology firms like HCL Tech, Infosys, TCS, and Tech Mahindra — all of them had gained between 2 to 6 per cent on the BSE. The Nifty IT index also closed 3.3 per cent higher at 27,027.75. The robust earning performance from TCS also helped today’s rally and boosted markets. The technology giant gained after reporting blockbuster third-quarter results. The company’s shares rose by almost three per cent in morning trade before closing almost 1.6 per cent higher. Read |Sensex tops 49,000 as TCS earnings boost IT stocks, Nifty above 14,400 \"The expectations of results from blue-chips are very high. The global markets are good and liquidity is also coming. The sentiment is so solid that markets are not concerned about valuations. This (up)trend is looking difficult to break,\" said Vinod Nair, head of research at Geojit Financial Services. Another factor that contributed to domestic market optimism on Monday was good news regarding the vaccine rollout. It has been confirmed by the government that phase one of themass vaccination against Covid-19 will begin from January 16. Market participants are keenly awaiting the mass vaccination drive to start as it will further lead to further easing of economic activity. It may be noted that India has authorised two Covid-19 vaccines till date — Bharat Biotech’s Covaxin and the Oxford-Astra Zeneca & Serum Institute of India vaccine Covishield for emergency use. Read |India's vaccine cost-effective, vaccination to begin from Jan 16: PM Modi The first phase of the Covid-19 vaccination drive is expected to start by January 16 with health care workers, frontline workers and the elderly. There are a bunch of other factors that have boosted market optimism. Higher foreign fund inflows, the possibility of a bigger US stimulus package and buzzing auto stocks also helped boost market optimism. Market investors are optimistic ahead of the government’s upcoming budget, which will be crucial for India’s economic revival. Although the government is tight on finances due to additional Covid-19 expenditure, it is likely to go for higher spending in its budget to boost growth and demand.",
    "url": "https://www.indiatoday.in/business/story/sensex-nifty-close-at-record-highs-3-reasons-behind-stock-market-optimism-1758019-2021-01-11",
    "original_url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPbkVCN2h3NkdvSVFLdFh2cUxGRE9fdVFhUDBrSnVkcHc2ZFdjbktCN2VhN0d6RzZQUkhfOHhnUUl3UkZRcHc2RVZGX3M0d1pBREh4Q0pYSmo4VldObjhNNXdQOW9jRndDV2g3X1VyaTRKbVAxdHhfc2NaZF92U0RUbDVHdkJWRFFwWmc0ZFliS084NGpqQkFXRVk5TDRwYk5xVFAzNTdWNnNsU0RpbnJnVjFWaUpwQnNhcDdKQWRrM2RXRGl4MGlRd2dEazRHQdIB0wFBVV95cUxPbmJMLVZzY242ZW9kdWFmMUZaMHU0OVBOdF9vYU9jWnNoQnBONk1OQ3ljdHZQQXdyLTR0ZmFYMXBVWFd1YndlQkZzNTd4X1c0MDVsUDFpdnBWOG5XaGpQLTZJM0FtVW04ZTYzNXh3T3pHZ1NhWEd1NUwwTVVPeE5fQS0yYUZwQW5GM25wTU5BSHhTY0VDX210Q094Ul9qQTNHV0ZBRW9pRzNLajVLcmFVRkFnS3lfVjRaTXF4M09wMFJPS3pZRU82QlNjalhwZ3pnVDdn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2873,
    "word_count": 465,
    "gnews_title": "Sensex, Nifty close at record highs: 3 reasons behind stock market optimism - India Today",
    "published_date": "11/01/2021",
    "publisher": "India Today",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Market Highlights: Sensex ends 403 points higher, Nifty settles above 16,600-mark",
    "body": "Share Trading at a firm in Kolkata. (Express photo by Partha Paul) Share/Stock Market Highlights: The benchmark equity indices on the BSE and National Stock Exchange (NSE) ended around 0.75 per cent higher on Tuesday led by gains in metals, banking and financial stocks. The S&P BSE Sensex rose 403.19 points (0.73 per cent) to end at 55,958.98 while the Nifty 50 settled at 16,624.60, up 128.15 points (0.78 per cent). Story continues below this ad The gains on the Sensex were led by the shares of Bajaj twins – Bajaj Finserv, and Bajaj Finance , along with Tech Mahindra , Tata Steel , HDFC Bank and State Bank of India (SBI). Among the sectoral indices on the NSE, the Nifty Metal index rose 2.90 per cent on Tuesday led by gains in National Aluminium Company, NMDC and Welspun Corp. The Bank Nifty too rose 1.67 per cent aided by IDFC First Bank and AU Small Finance Bank. The Nifty Financial Services index climbed 1.39 per cent led by Bajaj Finserv, Mahindra & Mahindra Financial Services and Cholamandalam Investment and Finance Company. In the broader market, the S&P BSE MidCap index was trading at 22,809.53, up 334.23 points (1.49 per cent), while the S&P BSE SmallCap was at 25,783.63, up 425.61 points (1.68 per cent). In the broader market, the S&P BSE MidCap index rose 341.05 points (1.52 per cent) to end at 22,816.35, while the S&P BSE SmallCap ended at 25,786.96, up 428.94 points (1.69 per cent). The volatility index or India VIX fell 3.63 per cent to 13.1875. Apart from this, two new IPOs made their debut in today’s trade – Aptus Value Housing Finance India and Chemplast Sanmar. While Aptus Value Housing Finance made a weak listing on the stock exchanges at 6.5 per cent lower than its issue price, Chemplast Sanmar had a mixed listing today. (with inputs from agencies) Live Blog Stocks, BSE Sensex, NSE Nifty, Crude oil prices, gold, silver prices, commodity market and money markets LIVE updates: 16:07 (IST) 24 Aug 2021 MARKET QUOTE | Deepak Jasani, Head of Retail Research, HDFC Securities on Tuesday's market performance \"Nifty bounced up well over the past two days and on Aug 24, it filled the downgap formed on Friday on closing basis. The Advance-decline ratio also improved dramatically to the highest since Aug 12. Nifty is just 76 points away from the all-time high formed on Aug 18. More than the Nifty, focus will remain for some time on the broader markets, as to how much does the broader market recover when the Nifty is near all-time highs.\" 15:55 (IST) 24 Aug 2021 MARKET QUOTE | Vinod Nair, Head of Research, Geojit Financial Services on Tuesday's market performance \"Strong rebound in broader markets along with favourable global cues bolstered optimism in Dalal Street, led by metal, banking and realty stocks. Metal stocks led the rally as value buying was witnessed in the sector after deep sell-off during the past four trading sessions due to weak iron ore futures across the globe. The USFDA granted full approval to the Covid-19 vaccine by Pfizer and BioNTech which pumped in hopes of faster inoculations.\" 15:52 (IST) 24 Aug 2021 Rupee at close Rupee inches up 3 paise to close at 74.19 (provisional) against US dollar. (PTI) 15:33 (IST) 24 Aug 2021 Equity markets at close The S&P BSE Sensex ended at 55,958.98, up 403.19 points or 0.73 per cent, while the Nifty 50 settled at 16,624.60, up 128.15 points or 0.78 per cent. 15:30 (IST) 24 Aug 2021 Crude oil futures rise on spot demand Crude oil prices rose Rs 45 to Rs 4,932 per barrel on Tuesday, as participants widened their positions on a firm spot demand. On the Multi Commodity Exchange, crude oil for the August delivery traded higher by Rs 45, or 0.92 per cent, at Rs 4,932 per barrel in 4,927 lots. Analysts said raising of bets by participants kept crude oil prices higher in the futures trade. Globally, West Texas Intermediate crude oil was up 1.01 per cent to USD 66.30 per barrel, while Brent crude traded 1.15 per cent higher at USD 69.54 per barrel in New York. (PTI) 15:29 (IST) 24 Aug 2021 Silver futures drop on subdued demand Silver futures on Tuesday dropped Rs 90 to Rs 62,837 per kg, as participants reduced their bets on low demand. On the Multi Commodity Exchange, silver contracts for the September delivery tumbled by Rs 90, or 0.14 per cent, to Rs 62,837 per kg in a business turnover of 8,115 lots. Silver traded lower by 0.24 per cent at USD 23.65 per ounce in New York. (PTI) 15:28 (IST) 24 Aug 2021 Gold futures fall on low demand Gold prices fell Rs 98 to Rs 47,486 per 10 gram in the futures trade on Tuesday, as speculators reduced their positions amid low demand. On the Multi Commodity Exchange, gold contracts for the October delivery traded lower by Rs 98, or 0.21 per cent, to Rs 47,486 per 10 gram in a business turnover of 11,947 lots. Analysts attributed the fall in gold prices to trimming of positions by participants. Globally, gold traded 0.18 per cent lower to USD 1,803 an ounce in New York. (PTI) 15:04 (IST) 24 Aug 2021 Soybean futures rise on fresh bets Soybean prices on Tuesday went up by Rs 110 to Rs 8,740 per quintal in futures market as traders created fresh positions tracking positive spot demand. On the National Commodity and Derivatives Exchange, soybean for September delivery rose by Rs 110, or 1.27 per cent, to Rs 8,740 per quintal with an open interest of 20,325 lots. Marketmen said raising of fresh positions by speculators on the back of higher demand mainly led to rise in soybean prices. (PTI) 15:02 (IST) 24 Aug 2021 Nickel futures rise on firm spot demand Nickel prices rose 0.2 per cent to Rs 1,425.60 per kg in the futures trade on Tuesday, as speculators built up fresh positions on rising demand from alloy makers in the spot market. On the Multi Commodity Exchange, nickel contracts for the September delivery gained Rs 2.90, or 0.2 per cent, to Rs 1,425.60 per kg in a business turnover of 914 lots. A rise in demand in the spot market from alloy makers mainly supported the price rise in nickel futures, analysts said. (PTI) 15:01 (IST) 24 Aug 2021 Copper futures fall on weak demand Copper futures on Tuesday slipped 0.18 per cent to Rs 708.35 per kg, as participants cut their positions amid muted demand in the domestic market. On the Multi Commodity Exchange, copper contracts for the August delivery eased by Rs 1.25, or 0.18 per cent, to Rs 708.35 per kg in a business turnover of 2,421 lots. Analysts said trimming of positions by speculators due to muted demand in the spot market mainly led to the fall in copper prices here. (PTI) 14:20 (IST) 24 Aug 2021 Gold eases, hovers above $1,800 on virus fears, easing taper concerns Gold prices eased on Tuesday but hovered above the key psychological level of $1,800, as the rising threat from increasing Delta coronavirus variant cases fanned expectations that the US Federal Reserve might delay easing its accommodative stance. Spot gold eased 0.1% to $1,803.53 per ounce by 0650 GMT, after jumping about 1.4% on Monday. US gold futures were flat at $1,806.30. (Reuters) 14:11 (IST) 24 Aug 2021 Petrol and diesel prices cut Prices of petrol and diesel eased across the country on Tuesday, August 24, 2021, after remaining steady for a day. In the national capital, the petrol price fell 15 paise while that of diesel slipped 15 paise. Following the latest price revision, petrol in Delhi is now retailing at Rs 101.49 a litre while diesel is selling at Rs 88.92. In the financial capital Mumbai, petrol price now stands at Rs 107.52 while diesel costs Rs 96.48, data available on Indian Oil Corporation’s website showed.",
    "url": "https://indianexpress.com/article/business/market/equity-commodity-money-markets-live-updates-stocks-shares-bse-sensex-nse-nifty-rupee-crude-oil-gold-silver-metals-prices-august-24-7467918/",
    "original_url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxNeVppZjFYRldta1NqVTBPbFY3MXRyVk9YaXpUbEp2dmVROWRLUlR3YkVvWXIxMHdzR0x6MWh5NkYzTFpQQ1A2aHFqaDdMTVNzbXF1Qlkxa2dfVnVJUmJWa3U2WGlqTTVLZHBSeWEwb3BmX3gwNWxhaVBuY3BidzZvSkNkMHBJMEpuNzh5Wm5oVzZGYkczYlppZHpmcXhnV3ZXUl9UaFVWakJNNGV2eTQ3QjRqOEx4eGNHS1VFX2ZjYW9pNlBXVm5sNWJTUEE3a1hkZXZBdC1tVzR2dUJUa2x4N3hBVC1oLVVMdms3dXJZYXFmOUVRejhlZ21VWFlxY0F4NkRnbjY0alFYVlgxeVlKTjMwd2tmd2cy0gGfAkFVX3lxTFAzRGRBLVN1ekp0Y2ZYb1N0b3k4WGh6cVM4cExfV05lNGFweWpOU3h0NkN3MUNCMW1tclU0TmFfMDZ6YlRWekpVLUpVWF9qOVVYZ2lBQmxGdWRVRWtRaUhPd3dlSlhGV25mZXNqdEl1Y28wUHVnMERSUWp6XzV5dmt5X1c0NzZjN2FJTm5ObFBMRE5icGVZc29aMjRDT18wNnFHMmtQc2E4NzJOYUZyQ3NxaVl2bkdCaTI3TGozVVcwdWUzSzhlODVGT2E3d25WcTBoZnMwenZtblNxblY5MWxYa2RsTzNaUDFldXhCMHhkZW5kWTUyZ2ZVbUpyS0o3dFJOQjJacjQ5YnhBN1RBbXVadHNzelJ5cVV0cGFxck5r?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7565,
    "word_count": 1325,
    "gnews_title": "Market Highlights: Sensex ends 403 points higher, Nifty settles above 16,600-mark - The Indian Express",
    "published_date": "24/08/2021",
    "publisher": "The Indian Express",
    "topic": "Nifty 50 stock market India"
  }
]