[
  {
    "title": "Boom to gloom: India middle-class jitters amid trillion-dollar market rout",
    "body": "Boom to gloom: India middle-class jitters amid trillion-dollar market rout 6 March 2025 Share Save Soutik Biswas and Nikhil Inamdar BBC News Share Save BBC Rajesh Kumar pulled out the bulk of his bank savings and and shifted to the stock market Two years ago, on his bank adviser's suggestion, Rajesh Kumar pulled out his savings - fixed deposits included - and shifted to mutual funds, stocks and bonds. With India's stock market booming, Mr Kumar, a Bihar-based engineer, joined millions investing in publicly traded companies. Six years ago, only one in 14 Indian households channelled their savings into the stock market - now, it's one in five. But the tide has turned. For six months, India's markets have slid as foreign investors pulled out, valuations remained high, earnings weakened and global capital shifted to China - wiping out $900bn in investor value since their September peak. While the decline began before US President Donald Trump's tariff announcements, they have now become a bigger drag as more details emerge. India's benchmark Nifty 50 share index, which tracks the country's top 50 publicly traded companies, is on its longest losing streak in 29 years, declining for five straight months. This is a significant slump in one of the world's fastest-growing markets. Stock brokers are reporting that their activity has dropped by a third. \"For more than six months now, my investments have been in the red. This is the worst experience in the last decade that I have been invested in stock market,\" Mr Kumar says. Mr Kumar, 55, now keeps little money in the bank, having shifted most of his savings to the stock market. With his son's 1.8 million-rupee ($20,650; £16,150) private medical college fee due in July, he worries about selling investments at a loss to cover it. \"Once the market recovers, I'm thinking of moving some money back to the bank,\" he says. His anxieties reflect those of millions of middle-class Indians who have poured into the stock market from cities big and small - part of a financial revolution. The go-to investment route is Systematic Investment Plans (SIPs), where funds collect fixed monthly contributions. The number of Indians investing through SIPs has soared past 100 million, nearly trebling from 34 million five years ago. Many first-time investors, lured by the promise of high returns, enter with limited risk awareness - often influenced by a wave of social media \"finfluencers\" on platforms like Instagram and YouTube, a mixed bag of experts and amateurs alike. Tarun Sircar moved his retirement fund to the stock market last year before the crash Meet Tarun Sircar, a retired marketing manager, and you get a glimpse of India's new investor. When his public provident fund - a government-backed tax-free investment - matured last year, he sought a way to secure his retirement. Burnt by past stock market losses, he turned to mutual funds - this time with an adviser's help and a buoyant market. \"I've put 80% of my savings into mutual funds, keeping just 20% in the bank. Now my adviser warns me - Don't check your investments for six months, unless you want a heart attack!\" For now, Mr Sircar isn't entirely sure if moving his retirement fund into the stock market was the right decision. \"I'm both ignorant and confident,\" he says with wry candour. \"Ignorant about what's happening and why the market is reacting this way, yet confident because Instagram 'experts' make investing sound like a fast track to millions. At the same time, I know I might be caught in a web of deception and hype.\" Mr Sircar says he was drawn to the markets by TV shows hyping stocks and excited chatter in WhatsApp groups. \"The TV anchors talk up the market and people in my WhatsApp group boast about their stock market gains,\" he says. In his sprawling apartment complex, even teenagers discuss investments - in fact, during a badminton game, a teenager gave him a hot tip on a telecom stock. \"When you hear all this around you, you start thinking - why not give it a shot? So I did, and then the markets crashed.\" Mr Sircar lives in hope. \"My fingers are crossed. I am sure the markets will recover, and my fund will be back in green.\" Reuters One in five Indian households have put their savings in the stock market There are others who have taken more risks and already lost money. Lured by get-rich-quick videos, Ramesh (name changed), an accounting clerk from a small industrial town in western India, borrowed money to invest in stocks during the pandemic. Hooked to YouTube influencers, he dived into risky penny stocks and trading in derivatives. This month, after losing over $1,800 - more than his annual salary - he shut his brokerage account and swore off the market. \"I borrowed this money, and now creditors are after me,\" he says. Ramesh is one of 11 million Indians who lost a combined $20bn in futures and options trades before regulators stepped in . \"This crash is unlike the one during the Covid pandemic,\" says financial adviser Samir Doshi. \"Back then, we had a clear path to recovery with vaccines on the horizon. But with the Trump factor in play, uncertainty looms - we simply don't know what's next.\" Fuelled by digital platforms, low-cost brokerages and government-driven financial inclusion, investing has become more accessible - smartphones and user-friendly apps have simplified market participation, drawing a broader, younger audience seeking alternatives to traditional assets. On the flip side, many new Indian investors need a reality check. \"The stock market isn't a gambling den - you must manage expectations,\" says Monika Halan, author and financial educator. \"Invest in equity only what you won't need for at least seven years. If you're taking on risk, understand the downside: How much could I lose? Can I afford that loss?\" Getty Images Monika Halan says new investors must learn to manage expectations This market crash couldn't have hit India's middle class at a worse time. Economic growth is slowing, wages remain stagnant, private investment has been sluggish for years and job creation isn't keeping pace. Amid these challenges, many new investors, lured by rising markets, are now grappling with unexpected losses. \"In normal times, savers can take short-term setbacks, because they have steady incomes, which keep adding to their savings,\" noted Aunindyo Chakravarty, a financial analyst. \"Now, we are in the midst of a massive economic crisis for the middle-class. On the one side, white-collar job opportunities are reducing, and raises are low. On the other, the real inflation faced by middle-class households - as opposed to the average retail inflation that the government compiles - is at its highest in recent memory. A stock market correction at such a time is disastrous for middle-class household finances.\" Financial advisers like Jaideep Marathe believe that some people will start taking money out of the market and move them to safer bank deposits if the volatility continues for another six to eight months. \"We are spending a lot of time telling clients not to liquidate their portfolios and to treat this as a cyclical event.\" But clearly, all hope is not lost - most believe that the market is correcting itself from previous highs. Foreign investor selling has eased since February, suggesting the market downturn may be nearing its end, says veteran market expert Ajay Bagga. Following the correction, valuations for many stock market indices have dipped below their 10-year average, providing some respite. Mr Bagga expects GDP and corporate earnings to improve, aided by a $12bn income-tax giveaway in the federal budget and falling interest rates. However, geopolitical risks - Middle East and Ukraine conflicts, and Trump's tariff plans - will keep investors cautious. In the end, the market meltdown might serve as a hard lesson for new investors. \"This correction is a much-needed wake-up call for those who entered the market just three years ago, enjoying 25% returns - that's not normal,\" says Ms Halan. \"If you don't understand markets, stick to bank deposits and gold. At least you have control.\" Follow BBC News India on Instagram , YouTube, X and Facebook . Asia Stock markets Middle classes India",
    "url": "https://www.bbc.com/news/articles/cz7vlezv05no",
    "original_url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9KaU1hSV8wZE5Vd3hfNDJmaXVGVzdmeVJKUGN6U0lGU2J1THBTcU1mSklBNEhKVDJTTThkR1NkY05NejB3RlZ5RUpGampBdXk4eDh0Mlg2eF9VUdIBX0FVX3lxTFBLbllRUlYyUHZnU2U4bnpLWVNSb3hHb2gzV0VyZWVkRlZiOFhVc2x6LUxvOXB6WjVWV1g1WUtPTjgyODlMWWxISUFlWE54VUwxVXpvRjNYSjlXb3VlVmNR?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 8237,
    "word_count": 1370,
    "gnews_title": "Nifty, Sensex: India middle-class jitters amid stock market rout - BBC",
    "published_date": "05/03/2025",
    "publisher": "BBC",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market crash today: BSE Sensex ends 857 points down; Nifty50 below 22,550 - top reasons bears growled",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Chitrangda Singh wows in beautifully crafted salwar suits Top Samantha Ruth Prabhu movies to watch 9 reasons to have black coffee in the morning 10 animals with a bone crushing bite How to say 'No' to kids without saying 'No' Hansika Motwani exudes grace in stunning ethnic wear Madhuri Dixit proves less is more in this exquisite saree look 10 times Shweta Tiwari beat daughter Palak Tiwari in the game of saree How Varun Chakravarthy worked on his physical and mental fitness for ICC Champions Trophy A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns...",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-february-24-2025-dalal-street-indian-equities-global-markets/articleshow/118518878.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikgJBVV95cUxPbmtFREtRZEFBSnhXcUd3cmRwMXdqdjV3WmJNbllYUmZnSmE2bkRQcEpDMkV3VkZBYXdFbDREVEZKMnBnRjRNYUlTUHFtcHFkaVpYS0tyNDlDd0JRNFdPNVdTMUM0X0EybXFPWEpnTG91eVUyTkE1cFQtSC1uUjBOanF2NUE0bnBmTXJNUHJvQVBYVkpUS2ZoREVxQXg5MHZ0OWV5WGNBQWlaYVM0bkg2TW9oSllOTE5mak1zVE5jUjFmRWs3bXJWSXN3SnNNM0NPWDRpYTZTR2Z3NHVMRG1OUS12TXpQaXhTVmwtU1hJbHlDdVhaTnBWRzJXX3ZNNlVrRUhSZWRlc1lPVm1PNFNvTlFn0gGXAkFVX3lxTFBIQ1c2WEVoS2EtdFBzbGk2aU5UQzVBYjJTbXlIYkFHcldOTDFwYVlTalhnUTRfQXBIeUpSSUppbjFxQ3YyWlZTNTJ1MWlpazltOEFYRVU0UnE3NW5vODBMOS1MNUw2V1J4anZlZHhpb0h4cFA3VTk3SXlXNy1rTmc0SGZsLUo3Y3BBTkpWX1AtSmVJMG4yc1haR2xCTDRNT3Z5WXh1MHNYU2RtVVduelhxRWxleFpkMmlmRmtzUW9SdzVfLUNseXRvNWVDTFc0RTc4eFduTUNNQmxkZllHWTFjOEFzb2R5VE9MUXltUW9fV2pVb04tXzlfRDNPSGk3azZmcVVzRnpCU1NBZjNab0M3S0NtcF84VQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1673,
    "word_count": 274,
    "gnews_title": "Stock market crash today: BSE Sensex ends 857 points down; Nifty50 below 22,550 - top reasons bears growl - The Times of India",
    "published_date": "24/02/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  }
]