[
  {
    "title": "Sensex, Nifty post biggest quarterly gain in 10 years. What analysts say",
    "body": "Reversing intraday gains, Indian markets settled lower today but ended the quarter with strong gains. The Sensex slipped 45 points to 34,915 while NSE Nifty 50 index settled down 0.1% at 10,302, after rising around 0.8% each during the session. The Nifty closed the quarter about up 19.8% and the Sensex 18.5%, registering their best performances since the June quarter of 2009, after hitting a four-year low in March. However, bothSensex and Niftyare still down around 15% for the year as markets grappled with the impact of the coronavirus pandemic on the country's economy and more recently the border tensions with China. Meanwhile, coronavirus infections continued to surge in India, with total cases rising to 566,840, including 16,893 deaths, as several states prepared to extend their lockdowns. Oil refiners Bharat Petroleum Corp Ltd and Indian Oil Corp Ltd today led the losses on the Nifty, falling 2.4% and 2%, respectively. Miner Coal India slid 1.5% and top lender HDFC Bank ended 1% lower, while gains in Shree Cement and Maruti Suzuki India helped limit losses on the Nifty. Here is what analysts said on today's market action: Manish Hathiramani, Index Trader and Technical Analyst, Deen Dayal Investments \"The markets have been sideways since Friday of last week. We are still unable to trade in a single direction. The Nifty is still in a consolidation phase with low volume trading. We would need to break 10200 or cross 10450 for a directional trade to get activated.\" Vishal Wagh, Research Head, Bonanza Portfolio \"Nifty closed with a flattish note on the last trading session of the June month. It has opened positive inline with the global market but wasn't able to hold the gains. Going forward, major support will be seen around 10195 and Resistance will be 10550.\" Ajit Mishra, VP - Research, Religare Broking Ltd. \"Markets settled almost unchanged amid volatility, in continuation to the prevailing consolidation phase. The benchmarks opened with an uptick, taking cues from the global markets but selling pressure erased all the gains in the latter half. Consequently, the Nifty index ended flat at 10,300 levels. On the sector front, a mixed trend was witnessed as on one hand sectors like auto, capital goods and banking ended in green whereas telecom, healthcare and oil & gas ended with losses.\" \"Nifty has been hovering within 10,200-10,400 for the last four sessions and either side break may trigger the next directional move. Meanwhile, limit your trades and use dips to accumulate quality stocks.\" Sumeet Bagadia, Executive Director, Choice Broking \"Investors to keep close eye on the coronavirus situation in the country and development related to India-China border tension.Index has been sustain above 21&50 DMA which suggest strength for upside as RSI indicator also trading above the level of 50 with positive crossover which points out strength in the index. At present level index is having a support of 10100 while resistance comes at 10500 levels.\" Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-nifty-post-biggest-quarterly-gain-in-10-years-what-analysts-say-11593512902208.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNcWlndFV2MzZsOGNJTEk5eEtPc2ItWWhKRmNQcFFKMmpHajJrbEt0aUd1NlZYR0VQeGFoWWpsd3Rxamt0UzJoaGJOSWFpT2F1QTNnbVg4WU5iWXJzcVpEWE5URFQxY2hvbFJHSnVCbmZaOVFITnBlTVFRQUQtWU5ZSHFidnI0TVRRWjBsazVJMUNxR2FYdGRJY2gydXdJZHI2c2YzQ0V4Y0FjSkVldlRLRjBnTnBhSDF1RHlib294Y2ZuYzBHeG5PeHdzdzBfY3FGM3ZVdGp0a9IB3AFBVV95cUxPRVJDQlU0bEpMMDZKdHJ2eFNlWEEwWmVVSjVuLWZjeHZBSUdOSlduU0Npb2h3NjhDRkxqUFN0d3pzWjV4blZ2b1owbFlUMTJCaTNGaGNNRVVWaUotU2xKZ1BZVDA1MEhhTi1ra3A1OW03TDNDM0VPLTZoeE9MTzFTS1A3LThpY3gzcktlelhhWG5vTEVNcVZhVEVGUnhGS2pYSlVaUXVwdkZ0RUM5cFlJTDhWd0tsYzRWekxZTlVHN2VxSlRvUkZFZzJYSUFtN0huQkZWY0dJbVFnYzZG?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3216,
    "word_count": 519,
    "gnews_title": "Sensex, Nifty post biggest quarterly gain in 10 years. What analysts say - Mint",
    "published_date": "30/06/2020",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex registers biggest one-day fall in 4.5 years, plunges 1,942 points on coronavirus fears, oil price crash",
    "body": "Share/Stock Market Today Live Updates:The benchmark equity indices on the BSE and the National Stock Exchange (NSE) tanked around 5 per cent lower on Monday, registering their biggest one-day fall since August 2015, tracking the weakness in the global markets which tumbled due to rising concerns over the economic impact of coronavirus outbreak and crashing crude oil prices. The S&PBSE Sensexfell 1,941.67 points (5.17 per cent), its worst fall since August 24, 2015, to settle at 35,634.95, its lowest level since February 19, 2019. During the intraday trade, the 30-share benchmark had crashed as much as 2,467.44 points (6.57 per cent) to hit a 15-month low of 35,109.18. Among the stocks on Sensex, shares of oil-to-telecom behemoth Reliance Industries (RIL) declined 13 per cent to end at Rs 1,105 apiece on Monday. The stock had crashed 13.79 per cent to Rs 1,094.95 per share in the intraday trade, its lowest level since August 2019. This apart, state-owned Oil and Natural Gas Corporation (ONGC) too declined 16.55 per cent to settle at Rs 74.40 per share. Earlier in the day, it had slipped 16.99 per cent to Rs 74.00 on the BSE, its lowest level since September 2004. The broaderNifty 50 indexon the NSE ended 538.00 points (4.90 per cent) lower to end the day at 10,451.45, its lowest since November 1, 2018. The 50-share NSE benchmark had slipped as much as 695.00 points (6.32 per cent) to 10,294.45. All the sectoral indices on NSE ended in a sea of red on Monday. The Nifty Metal index was the top laggard of the day, slipping 7.72 per cent dragged by Welspun Corp, Vedanta and NMDC. This apart, the Nifty PSU Bank index too slipped 6.07 per cent weighed by Bank of India, Union Bank of India and Canara Bank. In the broader market, the S&P BSE 500 index settled at 13,668.30, down 687.52 points (4.79 per cent). The index had slipped as much as 853.39 points (5.94 per cent). The S&P BSE MidCap index ended at 13,554.07, down 673.42 points (4.73 per cent), while the S&P BSE SmallCap settled at 12,770.55, down 559.23 points (4.20 per cent). The stock markets have been on a downward spiral since the past two weeks ascoronaviruscases in the country have risen sharply and the ongoing developments in the banking space regardingYes Bankduring the past weekend. The number ofcoronavirus cases in Indiaso far has risen to 43 as on Monday, after four fresh cases werereported from Jammu and Kashmir, NewDelhiand Uttar Pradesh and Kerala, respectively, officials in the health ministry said. No deaths due to the deadly virus have been reported yet. About Yes Bank, the shares of the private sector lender climbed 31.17 per cent to settle at Rs 21.25 on the BSE on Monday. During the day, the stock had surged 40.74 per cent to Rs 22.80 per share as State Bank of India (SBI) announced over the weekend that it will pick a 49 per cent stake in the troubled private lender. SBI shares slid 6.19 per cent to end at Rs 253.70 on the BSE. “Risk of recession increased fuelled by crash in crude oil prices and increasing virus cases outside China. Even though fall in crude oil prices is positive for India in the long term, short term concerns weighed with FII outflow in emerging markets. Coronavirus fear is intensifying and fresh travel bans seems to hurt the global economic sentiments more than feared,” Vinod Nair, Head of Research at Geojit Financial Services said in an aftermarket statement. Going ahead, the equity markets in India will be shut on Tuesday on account of Holi. The rupee breached the 74-mark against the US dollar as it had opened 25 paise lower against the greenback at 74.03 on Monday. During the intraday trade, it further slipped to 74.18 against the US currency, however, it pared some of its losses and was last seen hovering around 74.05-74.06 levels in late afternoon deals. Oil prices lost as much as a third of their value on Monday in their biggest daily rout since the 1991 Gulf War after Saudi Arabia signalled it would hike output to win market share when the coronavirus has already left the market oversupplied. Saudi Arabia slashed its official selling prices and made plans to ramp up crude output next month after Russia balked at making a further steep output cut proposed by the Organisation of Petroleum Exporting Countries to stabilise oil markets. Brent crude futures were down 22 per cent at $37.05 a barrel by 1000 GMT, after early dropping by as much as 31 per cent to $31.02, their lowest since February 12, 2016. US West Texas Intermediate (WTI) crude fell by more than 24 per cent, to $33.20 a barrel, after initially falling 33 per cent to $27.34, also the lowest since February 12, 2016. Global stocks plunged on Monday and prices for crude oil tumbled as much as 33 per cent after Saudi Arabia launched a price war with Russia, sending investors already panicked by the coronavirus fleeing for the safety of bonds and the yen. European markets suffered hefty losses in early trade with London dropping more than 8 per cent, Frankfurt falling more than 7 per cent and Paris almost matching those losses. The pan-regional STOXX 600 tumbled into bear market territory — a drop of more than 20 per cent from recent peaks. The number of people infected with the coronavirus topped 110,000 across the world as the outbreak reached more countries and caused more economic carnage. In Asia, the MSCI’s broadest index of Asia-Pacific shares outside Japan lost 4.4 per cent in its worst day since August 2015, while Shanghai blue chips fell 2.9 per cent. Japan’s Nikkei dropped 5.1 per cent and Australia’s commodity-heavy market closed down 7.3 per cent, its biggest daily fall since the 2008 global financial crisis. (With global markets and crude oil prices inputs from Reuters) Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/sensex-nifty-crash-live-updates-coronavirus-fears-oil-gold-6306233/",
    "original_url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQeEZEODdXbTIzU2xLTnA2c0RvOFJiOGlsVGJGdmlxWHl3ak9UcWJ6bmZDYnJRQk1wOG1iRFZUMGRmSmFydmc1WW93VTFLWEZaQ3RNS0cxNGdLX0hEZzB5WmwzREVjSVJzNG1yV1lfUG04b25qTXBRd1FPVi11RmtHc3pKaExyV25kRWpwS1cxWkpwZldsOU5aNkhBT3ZfYVRCdzBzQmZxemJNU2IxbUp1SFdTUkxpWnhQ0gG_AUFVX3lxTFBaMzFiSC1MUzJ2Vk13cmdZTGJNZmpYXzAtYUtOLW9tOGx1V1RDRm9iQ3Vyd3ZQenRNWm5oTWNQeEx3YldXMkMyb2NXUFBNcUZ1aDhIeWp6aDVlTmk0RV8zVlRIYlVBeTNfakd1bDU3a2hHaWloMmdaT0cyV0hrWldEMm4yQk4zd1R3YTl1NEExRmxId3paQ3Jta0doSGlTZm1vbzFveWFiaUp5UmZfME5sU1JFaE5VV01TU3F0LVFZ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6136,
    "word_count": 1052,
    "gnews_title": "Sensex registers biggest one-day fall in 4.5 years, plunges 1,942 points on coronavirus fears, oil price crash - The Indian Express",
    "published_date": "09/03/2020",
    "publisher": "The Indian Express",
    "topic": "Nifty 50 stock market India"
  }
]