[
  {
    "title": "Sensex, Nifty 50 fall for third consecutive session. What is driving Indian stock market down? Explained with 5 factors",
    "body": "Stock market today:Falling for the third consecutive session, Indian stock market benchmarks - the Sensex and the Nifty 50- declined over half a per cent each in intraday trade on Friday, January 10, amid weak global cues, rising US dollar and bond yields. Sensex opened at 77,682.59 against its previous close of 77,620.21 and dropped over 500 points, or 0.70 per cent, to the intraday low of 77,099.55. The index finally closed 241 points, or 0.31 per cent, lower at 77,378.91. The Nifty 50 opened at 23,551.90 against its previous close of 23,526.50 and declined over 180 points, or 0.80 per cent, to 23,344.35. The index ended with a loss of 95 points, or 0.40 per cent, at 23,431.50. The selloff was more intense in the mid and small-cap segments. The BSE Midcap and Smalllcap indices plunged 2.13 per cent and 2.40 per cent, respectively. The Sensex has dropped 1 per cent, while the Nifty 50 has fallen 1.2 per cent in the last three sessions. The BSE Midcap index has fallen 4.13 per cent, while the BSE Smallcap index has lost 4.6 per cent. Investors have lost nearly₹12 lakh crore in these three days as the overall market capitalisation of BSE-listed firms has dropped to below₹430 lakh crore from nearly₹442 lakh crore on January 7. \"The recent fall in the Indian stock market can be attributed to several interconnected factors. Some of them include the significant outflow of foreign capital from Indian markets, the emergence of the HMPV virus and the Indian rupee's fall against the US dollar. Additionally, weakness in Asian markets has compounded the negative outlook for Indian equities overall,\" said Atul Parakh, CEO of Bigul. Most sectoral indices suffered significant losses, except for the Nifty IT index which jumped 3.44 per cent due to a healthy Q3 result of heavyweight TCS. Among the losers, Nifty Media (down 3.59 per cent), Realty (down 2.77 per cent), PSU Bank (down 2.72 per cent), Healthcare (down 2.21 per cent), Pharma (down 2.13 per cent), Consumer Durables (down 1.80 per cent), Private Bank (down 1.74 per cent) and Metal (down 1.62 per cent) lost 2-4 per cent. Here are the five crucial factors, according to experts, that are driving the Indian stock market down. Let's take a look: Traders and investors are cautious ahead of the December quarter earnings. India's IT bellwetherTata Consultancy Services(TCS) reported its December quarter (Q3) numbers on Thursday, January 9, which were largely in line with market expectations. “Since the results season has started, the market will witness lots of stock-specific action in response to the results. Results of TCS indicate that the IT sector will continue to remain resilient. Results of banking majors will be good, but in the context of FII selling, the sector may not perform in response to the results,” said V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services. US benchmark 10-year bond yields and the dollar have been rising in light of strong US macro data and waning prospects of a significant rate cut by the US Fed this year. US treasury yields were near eight-month highs on Friday. This has been a major negative for emerging markets like India as elevated bond yields and a strong dollar trigger foreign capital outflow. Till January 9, FPIs (foreign portfolio investors) have sold off Indian equities worth over₹19,000 crore. This trend may continue due to uncertainty surrounding President-elect Donald Trump's trade policies and the US Federal Reserve's interest rate path. Concerns over Indian economic growth losing steam appear to weigh investors' risk appetite. As Mintreported,India's gross domestic product (GDP) is expected to grow by 6.4 per cent in the financial year 2024-25, according to the Ministry of Statistics & Programme Implementation's (MoSPI) official release on Tuesday, January 7. This marks a four-year low and a fall from its 8.2 per cent growth in the financial year 2024-25. Slowing growth has raised concerns about downgrades, further accelerating the fall in the Indian currency and the outflow of foreign capital. Meanwhile, media reports suggested that the global financial services firm HSBC has downgraded Indian equities from 'neutral' to 'overweight' amid concerns over high valuations and slowing growth momentum. The recent strong US macro data and expectations of a rise in inflation have raised concerns that theUS Fedmay not go for even two rate cuts this year. According to Reuters, the minutes from the US Federal Reserve's last meeting revealed that policymakers expect inflation to keep slowing down this year. However, they also noted a growing risk that inflation could remain stubborn, partly due to concerns aboutDonald Trump'spolicies. Trump will take office on January 20. There is much speculation about his plans for tariffs and protectionist measures. Experts believe his policies may drive up inflation, which would be a severe blow to the central bank's efforts to keep price rises under control. Shrikant Chouhan, the head of equity research at Kotak Securities, observed the index formed a bearish candle on the daily charts and a lower top formation on the intraday charts, indicating further weakness from the current levels. \"For traders now, 23,650/78,000 will be the key level to watch; below this level, the market could continue its weak formation till 23,400-23,375/77,300-77,200. If the indices rise above 23,650/78,000, they could bounce back to 23,750-23,800/78,300-78,500. Short-term traders should remain cautious and be very selective, as there is a risk of getting trapped at lower levels,\" said Chouhan. According to Reliance Securities, Nifty 50 has failed to break 24,800 levels on multiple counts andclosed near the lower range of the support levels in the previous session. The next band is at 23,250 levels. \"On the higher side, the crossover of the resistance band of 24,000-24,150 levels will witness a broader up-move across sectors and stocks. RSI has failed to sustain an above-the-average line and is trending lower, while other key technical indicators are in neutral mode from current levels. The highest call OI has moved lower to 24,000 strikes, while the downside, the highest put is at 23,000 for the weekly expiry,\" said Reliance Securities. Read all market-related newshere Disclaimer:The views and recommendations above are those of individual analysts, experts, and brokerage firms, not Mint. We advise investors to consult certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-nifty-50-fall-for-second-consecutive-session-what-is-driving-indian-stock-market-down-explained-with-5-factors-11736415205248.html",
    "original_url": "https://news.google.com/rss/articles/CBMilgJBVV95cUxPQkdsTHZLT21kd3M0MWNEVFBPTmhHb0hWamRtNVMtNktqeGhjUTdnRjNPUDludlZfc0hlR3FRcEtqaUQzWGlNTzRwb3Rud0VSRUt4dWRMbldpMXRhSnRvemtvQ2c0UlN4ZTFwU3BnWFBMRGNLTTRrSGpZMXJnc2dtblhJcWNYU05uaU1NdGdTRmpvSTlidEpmcjlmMnctTjBoSzVjNzVtanQxZkRubjY5ZWlaM2g4WW9Ya045dmFxUm4ybVNpd2poSjdfaGNDeHljYU03d1BNd3BkcjBUQ3FZQTlSY3l0VElMYXlWeXRHSzMxNGh2ZGR1YjJSWDNKbVEtal91ZW9PWERjODl0dm85X3E4dlREQdIBmwJBVV95cUxNdGl4dFlIRGtWOEYxd0NPeW1QM3JYdTlmdXNIQXdVaC1xN01EcktRVm1NaHRzMGVlX01NcE9KZlZsakFOTWFycmhKODZrLTlUSnU1NlJobm41NTJIT1VlNUVLaXo2aUs1RVRtQkdrTmtjd2pzTlRMY0QyVUJQUXIySXVDZ21RWXUxQmZvRGE3Y3VtWnVmX3VweVRmQkNTbjc1V25LYldpS3lsaFhobWFZbkRuU2lKRFp0d0xCWHg2YlQ0SHRFR0U4OW1nVzFwT3J2cDRlcGxmU3FBdFAtdndBVGsyQ2RrMTJYOG9KVUZHa0R1TlVnazFfVVdsUUJVUXdZMVN0bkpCQ2ozM0tlQTM5XzVtMFFqNWc2RVc0?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6724,
    "word_count": 1073,
    "gnews_title": "Sensex, Nifty 50 fall for third consecutive session. What is driving Indian stock market down? Explained with 5 factors - Mint",
    "published_date": "10/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "CNBC’s Inside India newsletter: Stocks have ‘bottomed out.’ Here’s what 2025 has in store",
    "body": "This report is from this week’s CNBC’s “Inside India” newsletter which brings you timely, insightful news and market commentary on the emerging powerhouse and the big businesses behind its meteoric rise. Like what you see? You can subscribehere. The stock market in India hasn’t had the best start to this year. Fears of lofty valuation multiples alongside trimmed earnings expectations have led to a steady decline for theNifty 50. The index has now re-entered correction territory – a 10% fall – since its most recent high in late September. In fact, year to date, the benchmark is now in the red. That’s hardly out of the ordinary for investors, however. By my count, the Nifty 50 turned negative by the fifth trading day of the year in seven of the past 10 years. However, this time it’s different. Many analysts arrived into the new year raising concerns about elevated valuations and slowing earnings growth at companies. It’s a far cry from the bullish sentiment of yesteryear that the Indian stock market would race ahead of theS&P 500, which rose by more than 20% for the second year in a row. Equity strategists at HSBC believe the glum mood gripping markets is likely to continue. “As earnings disappoint – consensus has cut [financial year 2025] growth estimates for the NIFTY 50 from 15% to 5% – investors will likely re-evaluate their positions, limiting market returns,” said the bank’s Asia Pacific strategists led by Herald van der Linde in a note to clients Thursday. The investment bank downgraded Indian equities to neutral. Morgan Stanley pointed out that stocks last year, for the first time in eight years, performed worse than bonds and gold (which, to be fair, outperformed most global markets). ″Over the long run, we think equities will lead in financial assets and gold will shine among physical assets,” said the investment bank’s Ridham Desai. Many also believe that Indian equities, after their long slide, are now ripe for picking. “India has bottomed out,” wrote Venugopal Garre, strategist at Bernstein, in a note to clients last week. Garre is expecting economic growth to pick up over the next three to six months and is urging investors to get ahead of the turnaround. “Investing ahead of the recovery is suggested,” he added. Bernstein expects the Nifty 50 to end the year at 26,500, up 13% from current levels. Morgan Stanley says the central government is likely to reduce the fiscal deficit in February when it unveils its budget, which could lower bond yields and reduce borrowing costs for companies. This view is echoed by equity strategists at Citi. They expect the Indian economy to expand by 6.5% this year, driven by a boost from the government’s infrastructure spending, which was in the doldrums last year. “We have a constructive outlook on equity returns given the market’s more reasonable valuations post recent corrections,” said Citi’s Surendra Goyal in a note to clients. The investment bank also expects Nifty to end the year at 26,000 – up 10.5%. India’s authorities expect its economy to grow 6.4% in fiscal year 2024-2025.The Indian National Statistical Office provided its first advance forecast on Tuesday, thelowest since 2020when India’s gross domestic product shrank 5.8% because of the pandemic. The estimate is lower than the Reserve Bank of India’s projection of 6.6% for the current fiscal year. Here’s what economists at HSBC and HDFC Bankthink of the estimate. India wants the country’s overseas missions to help boost exports.The Indian Commerce Ministry has asked Indian missions toincrease market intelligence effortsand identify export opportunities, government sources told CNBC-TV18. Commercial heads from Indian missions in 20 key countries will gather for a three-day meeting, organized by the ministry, that will focus on growing exports. Trump’s second term will benefit Indian stocks, portfolio manager says. U.S. President-elect Donald Trump’s plans to impose heavy tariffs on China makeIndia’s geopolitical positioning“favorable in this Trump 2.0 era,” according to GIB Asset Management’s portfolio manager Kunal Desai. “A number of Indian companies are taking advantage as customers look to take a dual source approach to their supply chain,” Desai said. India is a “compounding machine.”Investor interest in India waned at the end of 2024 because of a pullback in Indian equities during that period. One portfolio manager, however, remains bullish on the country. The dip in the market is a buying opportunity, he says, andnames three Indian stocks to buyfor 2025. [For subscribers only] Indian stocks started the year sliding. TheNifty 50index closed around 23,500 points, a decline of 1.8% since last week. The benchmark 10-year Indian government bond yield has been flat so far this year and has traded around 6.76%. On CNBC TV this week, BNP Paribas’ head of Indian equities, Abhiram Eleswarapu, thinks Indian markets are going through “a soft phase” at the moment because valuations are at an elevated level. However, this “shallow correction” might be ending, and marketscouldreturn high single digitsfrom March until the end of the year, Eleswarapu said. Meanwhile, Pulkit Patn, India industrials analyst at Goldman Sachs, noted that the bankexpectsIndia’s cement industry to expand in the second half of the year, which suggests that “infrastructure spending is coming back.” Government expenditure, residential real estate and rural spending will form the bulk of such investment, resulting inrelatively strong demand for infrastructureand related materials. A busy week with major economies releasing inflation data, while India’s Standard Glass Lining Technology, Capital Infra Trust and Quadrant Future Tek list publicly. January 10: U.S. nonfarm payrolls for December, U.K. consumer price index for December January 12: China consumer price index and balance of trade for December January 13: India consumer price index for December, Standard Glass Lining Technology IPO January 14: Capital Infra Trust IPO, Quadrant Future Tek IPO, U.S. producer price index for December January 15: U.S. consumer price index for December, India balance of trade for December January 16: U.K. gross domestic product for November This Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information. WHAT ARE COOKIES AND HOW ARE THEY USED? Like many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits. First-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities. Certain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services. The Services use the following types of first and third-party Cookies for these purposes: Strictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly. Information Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers. Measurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes. Personalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices). These Cookies also allow your device to receive and send information, so you can see and interact with ads and content. Content Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos. Ad Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you. Social Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit. We and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you. Depending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below. Browser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions: Google ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer If the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services. Analytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms: Google’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out The above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms. Flash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager. Interest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit: Digital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance You can also opt out of some of the advertising providers we use by visiting their opt-out pages: Google’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page These are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms. After you opt out, you will still see advertisements, but they may not be as relevant to you. Mobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings. Connected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking. Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”. These settings vary by device type. Cross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above. You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics. Consequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences. For inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US. For inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK CHANGES TO THIS NOTICE This Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies. These Cookies and SDKs are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these tracking technologies, but some parts of the site may not function properly.",
    "url": "https://www.cnbc.com/2025/01/09/cnbcs-inside-india-newsletter-stocks-have-bottomed-out-heres-what-2025-has-in-store.html",
    "original_url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxONWdxaDhMRFRtcEZJN2xCa2N5RUM3T3dodGcteTBFTXl3N1Q1b3NmdzJXWXRhRzJzMVpSeEFUaS1oQ216NG9Mamp2cHQyeW0tby1LZXEtb1hZS21IVWd6WDlXdzItYWZBVnNHSjNqeVhEbFVJLU00OWxibl9iUlF2ZnpPTUVSRVhMcGFzNjVtekI5Y0NuWHpGQ3JlY3hCZGUxeDVvYjlEVHFpWXZ0RGFQemRTRFZwZXBlSEtnVNIBwgFBVV95cUxNNDEzQWRfLXF1a05zcnBESHBhWGYzYUhBYWxlQVRzWGZ1dGQ3RkYweWNoWmVuY2ZZczhjVUVpWlE3VlFMNFJyYVNIR0s1U2U5YXdpazFoajdLQ0QzdUNIU3hvSDJ2Vzg0VEFtZjRoVzJjczJYVEY4RzU3clNvWkRKQlByQ3NMZFF4T2h2TlRMOGYtUG1PSHRQaExvS1VXMHJDcGJZSmRKSnhYelI1Q1hjU090RDZRRkwyY3VMM1J3YkVGUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 16405,
    "word_count": 2492,
    "gnews_title": "CNBC's Inside India newsletter: Stocks have 'bottomed out.' Here's what 2025 has in store - CNBC",
    "published_date": "09/01/2025",
    "publisher": "CNBC",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market today: BSE Sensex ends 241 points down; Nifty50 below 23,450",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 9 Biggest Time Wasters Students Should Avoid ​8 proven tips for writing high-scoring answers in exam 8 Essential Skills Students Need for Employability 8 effective revision strategies to excel in your exams 8 things to do a day before your exam to score better 8 Clever Mind Hacks to Boost Your Academic Smarts 9 tricks to study smarter not harder during exams 9 good habits that successful students follow ​10 proven strategies to combat stage fear and speak with confidence 9 motivational quotes to help students battle anxiety A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-10-2025-dalal-street-indian-equities-global-markets/articleshow/117102950.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxNZGZfdlVqVTFRazNKajJ5eGYyc0ozZDJtS2pvWldPQjIzOUM4NHozQWZydlo4XzRPT3NLT2Y0UEhpY2F0S242SkMwLVdkYUxpeDhhRVowenRRbHctRm5BOUFPUWdCVzNZekNFNVlXdnRnMEdIWXVyN3V5ekl1bXRTSGk3UTVpU2tmX3ZIRXN1alFWN1VXZHluaW83TXc1RmRoNllMUUZKLUZ6WWtnX3RrbThaX3E1SVU4RjdZR0dNeGxrcjNFa0V6TGVnYkthNElOVE1oZUZfNmVDVGxSNWY1QTlGNTQydG13dlpOYlZjMjVBREhmMWdYU2t5UVlLOHVQdXdNWFBlWWswcDJlN2tYQtIBlgJBVV95cUxPOFRfanQtMjdzeDdacEdvYUZDRThYaWp5ZHBpSm92MVkwOGxaMWFnZmdhaVp4Mjd6Tk4zbG1NMVNxSlRlVVBqeEF4YzU0NS1Cd3VoYnlrNjRSLWZUT0RzOE1kcHFkNFRnVXFkdDJnUEMwLXI0Q2U2dzctYVNJQkpjcFNLb3FUc281S1cxbV9Ec01ucS1odVRyc25ockxtQkxfUkJFVnF0OUx3SVdMQTBkQVBEeTBGSll5RDJxc0h2eFozV2NiV3QwaWtlYkR6aDg2YmlRSWlQM2NuTndYSnVVRXUzelA5cElkRFN5RzdFcEwyZi1HVnE5dzNFZzBVQmxuOFN0NUVCVmtWc0xia19hUklpM0RNdw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3690,
    "word_count": 628,
    "gnews_title": "Stock market today: BSE Sensex ends 241 points down; Nifty50 below 23,450 - The Times of India",
    "published_date": "10/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Nifty likely to test 22,700 support. How to trade on Tuesday",
    "body": "A reasonable negative candle was formed on the daily chart with gap down opening and with a long upper shadow. Technically, this pattern indicates a decisive downside breakout of a symmetrical triangle pattern with lack of strength to bounce back. The immediate support of 23,260 has been violated on the downside and the market is now placed to slide further lows. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-13-january-2025/liveblog/117185959.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNeVh4X0RQbDRKMGxENnNyNHlZSGtSek1kbW00ODhjbktTZkF2MHBwZWd6ZFlKSjhBT01vTWNKdkRRRElocmRkaUNkdHMwNWs0cU1ibjB2SFJuLUZiVERzZkxrSHUxNlRYN2Y3QUcxSlNIMVNlaVQ1aW1SSksyY0p5Rm1DVXh6WkhCXzVlUlBlWDNnZTMyMk5fVlNKTHhsN3hQY1VtdXEyT0JEMnhUYVcxVjRsc3VzNlZPa1FadXMzTndhYkx0N0ZMUVljQjdWVC1DZHVfSENnNNIB3AFBVV95cUxQRGR2ZjBtcjluZndLcjVwT05rRXY2Rm1IQTlKV2E0ZHMtYlVSZ2hMMm05T0ZSQUM0NHZ2MDBXaGdpN1BpSVRHN1FkUFUxY0VqZHpyUUl3amxHbkhNcEk5YjNoVHhYOFAzVVRwclk1amZDcTBqZlhFMmMxT0ozZUU2aEhpSFpfcUE4Tm9oOXcycU5vSmdDVlVJUjVvcGhhUDNIQURWaDdZemd3SzVoT3lVZ2w0NUxOMG9JWnFJc0QweEt0Y1pFRXIwcG5HNWRxSkRTbmJ4cG9xMDRudmZM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 679,
    "word_count": 113,
    "gnews_title": "Stock Market Highlights: Nifty likely to test 22,700 support. How to trade on Tuesday - The Economic Times",
    "published_date": "13/01/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "SENSEX, NIFTY50 continue to bleed, down 12% from record highs; top factors behind the market's free fall",
    "body": "4 min read | Updated on January 13, 2025, 12:17 IST The NIFTY50 and SENSEX fell over 2% last week as Indian markets continued to face an exodus of foreign capital, largely influenced by rising US treasury yields. In addition, slower GDP growth and no fireworks expected in the earnings season have dampened investor sentiments NIFTY50 has fallen nearly 12% from the record high levels touched in September 2024. Foreign institutional investors (FIIs) who once had a substantial stake in Indian equities reduced their holdings to multi-decade lows in 2024. The overly pessimistic stance continued in 2025 as global market dynamics changed dramatically. FIIs’ net buying in the Indian markets reduced by 99% to ₹427 crore in 2024 as against ₹1,20,000 crore in 2023. The provisional figures for the first 10 days of 2025 suggest that they sold equities worth more than ₹18,000 crore in the secondary markets. Rising treasury yields in the US have added more worries as FIIs move away from risky emerging markets like India to treasury investments in the US. The US 10-year yields traded at 4.7%, up from 3.6% in September 2024, a 32% jump in four months. The rise in treasury yields is significant as interest rates dropped 50 bps during the same period. Rising treasury yields highlight two things. First, inflation is expected to increase in the days ahead, indicating a slower rate-cut cycle or a potential tightening of monetary policy. Second, rising treasury yields drive the money flow back to the US markets as investors get higher returns on safe-haven assets like government bonds. Consequently, we see more and more FII outflow from Indian markets. When money flows out of emerging markets like India, it puts high pressure on the domestic currency and causes it to depreciate further. The rising dollar index severely impacted the Indian currency in 2024, when it depreciated nearly 4% from its peak in September 2024. The sharp devaluation of the rupee poses challenges, from rising import bills to higher oil prices, adding inflation worry to the domestic economy. Moreover, it also reduces rupee-denominated returns for foreign investors, making the Indian markets unattractive. As a result, we may see more FII outflow from the Indian markets. India’s GDP growth for FY25 was revised lower to 6.6% as the economy struggles from slower credit growth and a drop in consumer spending and demand. The revised estimates for the GDP growth are the lowest in four years and much lower than previous estimates of RBI (Reserve Bank of India) at 7.2%. This can be attributed mainly to slower public and private investment, weakened manufacturing, and lower consumer spending. Further, interest rates have stayed higher for longer than estimated, impacting credit growth in the economy, which has come down to 11% in 2024 from the peak of 16% in 2023. Domestic indices, especially the NIFTY midcap and small-cap indices, traded at higher valuations when the underlying earnings growth of the companies remained muted. This reduces investor appetite for paying premium valuations for Indian companies in the absence of strong growth. The ongoing Q3FY25 result season is also expected to be a weakshow regarding earnings growth, as advanced business updates suggest pain in the underlying economy. Despite being the fastest-growing economy in the world with 5.4% GDP growth for Q2FY25, Indian markets continue to face a mass exodus of foreign capital from secondary markets. However, FIIs have bought into the primary market opportunities through QIB and QIPs in secondary issues. The global market cues remain weak, with the top two economies (US and China) struggling on multiple fronts. The impending trade war scenario makes the outlook bleak in the near term. However, investors remain optimistic about the upcoming budget for some economic stimulus, which could end the dry run in the Indian markets. By signing up you agree to Upstox’sTerms & Conditions By signing up you agree to Upstox’sTerms & Conditions",
    "url": "https://upstox.com/news/market-news/trading/sensex-nifty-50-continue-to-bleed-down-12-from-record-highs-top-factors-behind-the-market-s-free-fall/article-140037/",
    "original_url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxQRllhSmZsbFdGQUJpRTZVM2RmZkRPbkZUY0xWdVlUa0Q3Uzg3aC01bTYtN3BwSjhyZGxVVkhoRFQtRHUtaXZxR0g1Sno5UnoxRWZKSzNzVVdwU0xzbUtmSVJlaGF6MUVEa3Nxb2dYd2lGd3FFelMxcTEyNTdEMGJZMlpwMGxDRWhlTGJmbmdXcEtwTV8zdHdwaV82anNod2F5NUR0MDg0NFktQVhycFQ0eHV3a2NMazFYUVZ3V0YxZ1pOU1Z1Q2hhMmVIbjVkMlZnZS1OVEZSeDRINENkcXphNm1uX0FpLVphR25JY3BTeHVPRkU?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4014,
    "word_count": 649,
    "gnews_title": "SENSEX, NIFTY50 continue to bleed, down 12% from record highs; top factors behind the market's free fall - Upstox",
    "published_date": "12/01/2025",
    "publisher": "Upstox",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 9",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open lower on Thursday tracking weak global market cues. The trends on Gift Nifty also indicate a negative start for the Indian benchmark index. The Gift Nifty was trading around 23,721 level, a discount of nearly 60 points from the Nifty futures’ previous close. On Wednesday, the domestic equity market recovered from day’s low to end flat with negative bias. TheSensexeased 50.62 points, or 0.06%, to close at 78,148.49, while the Nifty 50 settled 18.95 points, or 0.08%, lower at 23,688.95. Nifty 50 formed a small red candle on the daily chart with a long lower shadow. “Technically, this market action indicates a formation of ‘hammer’ type candle pattern. Normally, such hammer formation after a reasonable decline calls for an impending trend reversal on the upside post confirmation. Though, Nifty 50 placed below the crucial 200-day EMA (Exponental Moving Average) at 23,700 levels, there is an absence of sharp break down below this key support. This 200 DEMA has offered significant trend reversal on upside in the past,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities. According to him, the short term trend ofNifty 50remains weak, but the smart upside recovery from near 23,500 levels is indicating chances of an upside bounce in the coming sessions. “A sustainable move above the hurdle of 23,800 levels could confirm an upside bounce in the market. Immediate support is placed at 23,496 levels,” Shetti said. Here’s what to expect from Nifty 50 and Bank Nifty today: Nifty Open Interest (OI) data indicates the highest OI on the call side at the 23,800 and 24,000 strike prices, highlighting strong resistance levels. On the put side, OI is concentrated at the 23,600 and 23,500 strike prices, marking these as key support levels, said Hardik Matalia, Derivative analyst at Choice Broking. Nifty 50 witnessed a smart upside recovery from the lows on January 8 after showing a deep cut in the early-mid part of the session and settled the day lower by 18 points. “Nifty 50 index is trading within a range of 23,500 to 24,200. In Wednesday’s session, it formed a hammer candlestick on the daily chart, closing near its 200-day EMA, thereby strengthening the 23,500 support level. A decisive move will require the index to close below 23,500, which could lead to heightened selling pressure, or sustain above 24,000 to pave the way for a potential rally toward 24,500. Monitoring these crucial levels is essential to identify the next trend in the index,” said Vatsal Bhuva, Technical Analyst at LKP Securities. Dr. Praveen Dwarakanath, Vice President of Hedged.in highlighted that the Nifty 50 tested its critical support at the 23,500 level again, however, it bounced from the same level, indicating a mild bullishness in the index. “The ADX average line is nearing the 40 level, suggesting that the weakness in the daily timeframe is decreasing. It also indicates a small bounce from present levels, which can be used to sell the index on the rise. The momentum indicators on the daily chart are rising from the oversold region, also indicating a possible bounce from the current levels,” said Dwarakanath. According to him, the options writer’s data for the January monthly expiry showed increased writing of the calls at the 23,400 and above levels with a short covering of 24,000 puts, suggesting a weakness to continue in January month for the index. Bank Nifty index declined 367.10 points, or 0.73%, to close at 49,835.05 on Wednesday, forming a bearish candlestick pattern on the daily timeframe. “Bank Niftybroke its critical support at 49,500 levels, however it bounced during the day. The index has closed below the 50,000 level, indicating a possible weakness in the index. Any bounce in the index can be used to sell on every rise until the index breaks the 51,600 level. The ADX average line is rising with the ADX DI- line also rising, indicating a possible weakness in the index,” said Dwarakanath. Options writer’s data for the monthly expiry showed increased writing of the calls at the 50,000 level, suggesting a weakness in the index, he added. Om Mehra, Technical Analyst, SAMCO Securities said that the Bank Nifty index breaking below the 49,964 level, a key support that had remained unbroken since August 14, 2024, further weakened the overall trend. “The daily RSI hovers near the oversold zone, reflecting the ongoing bearish pressure. However, the Bollinger Bands on the daily chart indicate that the index remains in the lower band. If 50,200 is sustained, a relief rally may emerge in the coming session. The support level is positioned at 49,450, which could act as a cushion in case of further declines. Premature attempts to capture bottoms should be avoided until a strong base is firmly established,” Mehra added. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-january-9-11736353101985.html",
    "original_url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOQUZPbFNZSEJ3MmlPZVh0emlFNGhwd0N1RDRHNVJOMDN4ckRCTWhVVERCUVJCcW9fdmFmSDNlaWczWVBmM3lldHo4ZHAxZkVzRm9qU2ZQVHlDSG81Y3pEQm01UmdIcEY0am5fOW83eFdXcDI0MW0xNHBtNlVFdUxvNmU2S2hpYjhkY1Y5MC1tZkxzcjdkRzQyS3ZLWmwtS3E2eHlaNzhNSTdBcnRGbkhNMUlWY3l3Y09TbjUtWWJlR2FJZWp6UGFIMTRJVjlpTWlqM05jRmRoNTBDRURTcWk5UkhGbjVQTHMy0gHuAUFVX3lxTE4tRHRqdWsxWDJnRFBuMHRWWkdxRVhVcjRfODJjNE1OenNiM3FGS2dpSy1JaVFwUFZpRlVqdTZNUkQwaHBwWTkzcU9kak5YRTFQa1Y0OGE5T3VfaVlVVzlHLUZpUkxrX1Bwa1B0NGkyN2tPWWV1eUJRUGNrb05vX3luTnJ6MUxIOXNvMjlqSFgxUjRHZmlJUTRiQVptVGRXTER1UFVLU3JqMi01ZDE5c3cweEpXTjVHSFJzenZ5bGN2NUZ4X0tULU5tSXpyWXgwVWVpMXMtMkN6Sm9GbFpSNkRxM2FLaHZtalZpUHlkZGc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5305,
    "word_count": 867,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 9 - Mint",
    "published_date": "09/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market today: BSE Sensex crashes over 1000 points & Nifty50 at 23,085; rupee dips to life-time low of 86",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 9 Biggest Time Wasters Students Should Avoid ​8 proven tips for writing high-scoring answers in exam 8 Essential Skills Students Need for Employability 8 effective revision strategies to excel in your exams 8 things to do a day before your exam to score better 8 Clever Mind Hacks to Boost Your Academic Smarts 9 tricks to study smarter not harder during exams 9 good habits that successful students follow ​10 proven strategies to combat stage fear and speak with confidence 9 motivational quotes to help students battle anxiety A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-13-2025-dalal-street-indian-equities-global-markets/articleshow/117188714.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxPM1dqLUg0MVdBWHZyVWFWY19iRW5tTjYwQ09RUHZGblFqWllzWHVvcHp3UnpiWUNsNk9BSlhhQi1iMzdYY0Y5TFU1LUl1QnpNM0NwWFRvdnNfbUtnU3lQZDktbmZ6S20xdkdiTnc1dnBOSnkzdGNHVlNuTlp6WHNqalFwbTRSRjczWGozVk51eHhZSFk0cWN2c2stZWZMU2xBRzFaOF9fYkZWQmdBMGtRZlItQ1ViVU5veUNKUzkxYmZRTDdfdHkyVXBUd0twRWVZQzljMmQ2eUlpalBERjNFajNJWDMyWHV0LVNEUVQ0S3RrUHg5bDBHNnBNaE5MNWRRUVdQNzB6cENORGJFYVl6TtIBlgJBVV95cUxNZHlyOWRhcVBzUFdHT0NHdE9zWFF2NFRpUW5kTzF0XzA2THlJSDNHM1N3QURvcG9hLUVkNlluckgtZU5ncHdKMGNkb2FzcEpKcHhuWGtsclJZXzdpbHFUcEJIRTRrRjYwUU5pT05FdGFNenVmQ0pUSnJaam9HVmJ6RXRhbTEtQzB3XzNicFJoTDJyWmwweUhKQUsxdkxnRThZVzRXSjZIUTBBMmEtbDdBZ3lfdUswWU9oeGRZa2NpRXJ0ZWhNbFc0N2VGRlNKODFfZVU2MFlfSmZKWVJ5cGlPazU5Z1RLYjNobXQ0NHFsYVliSV9LclhBemFLR3diRW5RSDlYUkVMcVhMU3Y3emJxV01wMy1fdw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3690,
    "word_count": 628,
    "gnews_title": "Stock market today: BSE Sensex crashes over 1000 points & Nifty50 at 23,085; rupee dips to life-time low - The Times of India",
    "published_date": "13/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Nifty's crucial support at 23,500. How to trade on Monday",
    "body": "A long negative candle was formed on the daily chart on Thursday after the formation of a hammer-type candle pattern on Wednesday. The positive sentiment of Hammer is now on the verge of negation. This is not a good sign and one may expect more weakness in the coming sessions. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-10-january-2025/liveblog/117101476.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNd0lZR0ozUnp2bGRhRHhFcmJzMzg3RHZGUldfbVB5UlBOTGlpektPams3RFgwcXlWV2FPek5kTlJ0X1oydllaaFFGejBVWGZ1Z2cyRjlPWDFQc2JxX2ROMGRnQnBCcXJIOHl4WThkaU9hREx5Wjh0eER5QkRUUXFnYlV5MzV1bGhjTEF5ZmdwNjZJSFJidzcxQTQwOXhJaUtpT2o3R0RNd1BENnZOazViYmo5WUJCM1dscUsxbE56OC1Vdk9ia01rTENRMVBoeDdlR2c4NVROd9IB3AFBVV95cUxPeER6MktkU3FYSEFPTW1Tb2xHNVRwb0dGVXpPaEVLZFpXZWJrcVIxU1paU0NOVjNWU2RXQ2JUeTRyaXdyOTZrQzhhLVZHX05acFV5a3JSaDdQV2tDLThLMGJsVmNLalR4UnNCN2pjcGhsU0pTaGhJRTdwNHJMOXBzdXlOX21lNWlYdnNXTGdjdFBPQTZQSDZDRzZRdjNqSlhjNEl3aDBBRm9RdjhNbmpXaVM0UFhWZ3hHamt2R3dpc19MV3hTQVM5VXhkUGxXWWhzeVloZmlBeUhVc25s?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 591,
    "word_count": 102,
    "gnews_title": "Stock Market Highlights: Nifty's crucial support at 23,500. How to trade on Monday - The Economic Times",
    "published_date": "10/01/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 14",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open higher on Tuesday, amid mixed cues from global peers. The trends on Gift Nifty also indicate a gap-up start for the Indian benchmark index. The Gift Nifty was trading around 23,280 level, a premium of nearly 118 points from the Nifty futures’ previous close. On Monday, the domestic equity market crashed and the benchmark Nifty 50 slipped below 23,100 level. TheSensexcracked 1,048.90 points, or 1.36%, to close at 76,330.01, while the Nifty 50 settled 345.55 points, or 1.47%, lower at 23,085.95. Nifty 50 formed a reasonable negative candle on the daily chart with gap down opening and with a long upper shadow. “Technically, this pattern indicates a decisive downside breakout of a symmetrical triangle pattern with lack of strength to bounce back. The immediate support of 23,260 has been violated on the downside and the market is now placed to slide further lows. The underlying trend of Nifty continues to be weak,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities. According to him,Nifty 50is on the way down to the next lower support of around 22,800 - 22,700 levels, and any pullback up to 23,350 could be a sell-on-rise opportunity. Here’s what top expect from Nifty 50 and Bank Nifty today: Nifty 50 witnessed sharp weakness on January 13 and closed the day lower by 345 points. “Bears remained at the helm as the Nifty 50 continued to breach crucial levels. The index slipped below its previous swing low on the daily chart, indicating increasing bearishness. However, it held the 23,000 mark, which remains a key level to watch. If the Nifty sustains above 23,000 over the next few days, it could signal a potential recovery. Conversely, a decisive fall below this level might trigger a deeper correction,” said Rupak De, Senior Technical Analyst at LKP Securities. VLA Ambala, Co-Founder of Stock Market Today, noted that both Nifty 50 and Sensex closed below their 50-day exponential moving averages (EMAs), a key technical level, signaling further selling pressure. “The Nifty is now only 3% away from its 20-month EMA, which had been identified earlier as a critical support zone. Meanwhile, mid-cap stocks also witnessed heavy selling due to profit bookings. However, this pullback could offer long-term investors opportunities to accumulate quality stocks at attractive valuations. On technical charts, Nifty formed an Inverted Hammer candlestick pattern during the day, indicating a strong upper price rejection,” Ambala said. Considering these developments, Ambala expects Nifty 50 to gain support between 22,950 and 22,800 and face resistance between 23,050 and 23,100 in today’s trading session. Bank Nifty plunged 692.90 points, or 1.42%, to close at 48,041.25 on Monday, and formed a bearish candlestick pattern on the daily timeframe. “Bank Niftymaintained below its 250-Days Simple Moving Average (250-DSMA) support which is placed near 49,900 levels and formed a red candle on daily scale, indicating weakness. On the downside, 100-WEMA support is placed near 47,300 levels, which will act as key support,” said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Interrmediates Ltd. (A Pantomath Group Company). According to him, as long as Bank Nifty maintains below 49,900 levels, traders are advised to follow a sell-on-rise strategy. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-january-14-11736789918961.html",
    "original_url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxQbWZkRGJZX2Y1Nmc4NHhwaDdOOEYwTDJmMkRSWEFnOVo5WXZubHZRYm9jZUN1UHYwVDRLbjF3MzdLNTFBczlPT0pITEI5VWloZjFRTUktVmgxTE1KOVlwelJoUnpMZ1RFWUk5UmpWbDk5MUtyU3Eybm0wQ2RLeEoyMkx0LVhUaS1yZFZfeU1pYWlHU1FMbGdFd2Z2cU5ZSE1CcWp0WllTSmRzUkd2RmR0clp5c2YtQ0NRRHBjZ0JBN290cWRadC1zS3RjUDBWREhtY0NiNjI2MmhHa2ExRkVLUjkxUjBkNVpOOWfSAe8BQVVfeXFMUHk2dUViUENURXFKRVRIQWFEbjN2TzFKUkx3YnZ3ajBEVnJKMGN2TG9GWkpfNmxkbnByM0FNc2M0YXdXb1dDZjZCcWxSVzJ1WXc5R1lDcjYtNld4LUZrbUg5X0w3cjBxTnBkd2YweHpaNjJUdnh2RmxhRzNfcDRESTRFSnA3TVhaRnBWYUhpaVRPX3R4b3ZVTzl1QzdsUzFVU0JZS1FWbndhODBuYXlCZld2UkVyQUVCZUtod3NLa1VKVDRaMzlRSVU2TVNRLU1GbHdwUzNuQjhwQXFvMFQwQnBoYkVnYWVtR3FGMWJxYWM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3847,
    "word_count": 605,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 14 - Mint",
    "published_date": "14/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  }
]