[
  {
    "title": "An international dispute about a popular investment product could shape India's market",
    "body": "A dispute between stock exchanges inIndiaandSingaporehas cast doubts on a popular investment product, and it has raised questions about the future of India’s more than $2 trillion equity market. While the problem — a disagreement about the planned listing of a derivative product — may appear to be a niche one, it potentially affects a large swath of international investors with an interest in India. The contract at the heart of the dispute is the Nifty 50 index futures contract currently traded on the Singapore Exchange. According to industry players, that's one of the primary ways that investors around the world have been able to play the Indian market. The derivative product in Singapore is \"the incumbent, the largest and most liquid\" of futures contracts on offer, Ross Finlayson, on the iShares capital markets team at BlackRock, told CNBC. The National Stock Exchange of India has been providing data to the Singapore Exchange for the derivative product, which is used by offshore investors looking to hedge exposure to the Indian stock market. At present, many regard Indian equities as difficult to access because of the country's tax rules and other roadblocks. Now, that contract in Singapore is set to go away following an announcement from the NSE and two other Indian exchanges that they would be ending agreements to provide market data to overseas exchanges. That would affect the trading of offshore derivatives, including the SGX's Nifty 50 Index Futures. The NSE said the move was needed as derivative trading based on Indian securities had resulted in capital migrating offshore. That was “not in the best interest of Indian markets,” the NSE said in arelease. Following the announcement, the SGX said it would list newly created Indian derivative products, but its plans were dealt a blow by the NSE, which took the dispute to court. That was because the proposal was seen as identical to the incumbent SGX Nifty futures, local media outletThe Times of Indiasaid, citing sources. For now, the issue remains in a holding patter. An Indian court last monthorderedthe NSE toextendthe existing license for SGX Nifty futures for at least two successive contract months after arbitration — which the Indian stock exchange said is expected in February 2019 — is completed. Both the SGX and NSE told CNBC they had no additional updates on the matter beyond statements released last month. Investors have been left with plenty of uncertainty in the wake of those developments. Interest in Nifty futures on the SGX has tapered: Volumes of the derivative traded on the SGX have slipped from above the 2 million mark per month to consistently coming in below that level from March onward. The dispute makes things difficult for investors trying to get exposure to Indian equities, thus potentially increasing costs for those looking to access the Indian market, said Zhikai Chen, a Hong Kong-based portfolio director at Lombard Odier. And even though the NSE's existing license has been prolonged for now, investors are unlikely to wait until the last moment before scrambling for alternatives in the scenario the arbitrator rules in the Indian stock exchange's favor. That's because India has a roughly 8.5 percent weighting in the MSCI Emerging Markets Index and those tracking that benchmark need to ensure they have exposure to the Indian market. \"From one day to the next, it's very difficult for these managers to be sitting in a limbo as to whether they know they can access that exposure,\" Finlayson said. There aren't too many alternatives that investors caught in the middle can turn to for now, Finlayson said, citing other smaller futures contracts and less liquid derivatives as examples of options. He added that interest in one of BlackRock's recently launched exchange-traded funds focusing on Indian equities had spiked since the two exchanges began legal proceedings. “Because of this turbulence in the market, no one’s really too sure as to the viability of this new product and the overhanging court proceedings obviously bring it a little more into disrepute as well,” Finlayson said of the new India stock futures the SGX plans to launch. Another potential casualty could be the onshore Indian equity market as liquidity could take a knock if arbitrage trading between the two stock exchanges is affected by SGX Nifty futures being halted, said Dbritto Ronald Michael, senior development manager at brokerage Phillip Futures. All of that also comes against the backdrop of the development of the Gujarat International Finance-Tec (GIFT) City, a district in Gujarat state positioned by the Indian government as a high-tech hub for financial services. Concessions, such as exemptions from short-term capital gains taxes on derivative trades made in GIFT City for foreigners, are being made to encourage offshore trading volumes to return onshore. This Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information. WHAT ARE COOKIES AND HOW ARE THEY USED? Like many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits. First-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities. Certain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services. The Services use the following types of first and third-party Cookies for these purposes: Strictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly. Information Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers. Measurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes. Personalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices). These Cookies also allow your device to receive and send information, so you can see and interact with ads and content. Content Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos. Ad Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you. Social Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit. We and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you. Depending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below. Browser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions: Google ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer If the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services. Analytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms: Google’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out The above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms. Flash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager. Interest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit: Digital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance You can also opt out of some of the advertising providers we use by visiting their opt-out pages: Google’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page These are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms. After you opt out, you will still see advertisements, but they may not be as relevant to you. Mobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings. Connected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking. Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”. These settings vary by device type. Cross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above. You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics. Consequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences. For inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US. For inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK CHANGES TO THIS NOTICE This Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies. These Cookies and SDKs are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these tracking technologies, but some parts of the site may not function properly.",
    "url": "https://www.cnbc.com/2018/06/29/nse-and-sgx-nifty-dispute-uncertainty-for-investors-in-india-markets.html",
    "original_url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOMUJLSDZNRS1aZEV1amJseXh1OXIyUEJQM0tiODUyVFc2Wjg5MGdLSjFfV25ydDc5SDViQ0Y5YmRzZGFpcnlaY2JXelNSVUJtWVF3cjdwa0IydFVON3JGVGRoT0QwbEtYZEs1a0ZKaDlPTkZVQ3d2NWtwSFhINkJGajA4R216dDVZenFKeXYzNV82Y2l2cXpOcl9YVmMtczA2MUhwUERhc0nSAa4BQVVfeXFMT21INll1TnNNNm9NWGFqNVZxeFNNV2FDR3ByUHFBX0dqc1JvbG9TOE52Sm42LW5qYUtJMllVc0dBNHVKcjlpMkh5OWN6QTBzTWViTW1MTUl2dWJDUjF3TmJfVmJNWUZqQ25RblZmUnNheFlfT1I5cmM3RG5qd2liZEdzSkd0ZmRlZGxDbFBNU21vUHBGbmFOMTFSQzk3Z19MYU9vS3ZsV21EZDVWbXdn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 15077,
    "word_count": 2299,
    "gnews_title": "An international dispute about a popular investment product could shape India's market - CNBC",
    "published_date": "04/07/2018",
    "publisher": "CNBC",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Traders' diary: Minor stock bounceback likely next week",
    "body": "- Prashant Jain, HDFC AMC Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/sensex-nifty-live-today-2018-09-28/liveblog/65988848.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOSk5IRVYyNFNpYVYzZHJhQzNvN25LaVlPa3RrYzUtdzdseVR4UmRHRGtVdFdfbEpPUFpoMmdwVTNYRTFvc0haQ3R4akVBR3ZfOHdaemhxb1VZd3g4b1lmTlRrS0tyTF9KZE5QTGlubzQ2WEFKdHFxMkp1by1LNWJqSENxTFlfVFIxY0otNtIBkgFBVV95cUxPTWNSZnNpbUJHQ2dWOWEyLU9IMVFKSjlKRzNPdU4wLXQtZ0cteGtKbnRQeTFCN01Udk1YN3g1UWhycjB3ampQR3g3X2l6V0RxbkM3a1loaVZPWmJQVGxTV0dJajdYS3VvTmQ1SS1JcjhtU2ZFOFpNaXl3eFZHbmZXLXpMR2M2WlhiYWRoZTlBSndBQQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 339,
    "word_count": 57,
    "gnews_title": "Traders' diary: Minor stock bounceback likely next week - The Economic Times",
    "published_date": "29/09/2018",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Closing bell: Sensex surges 257 points led by banking stocks, Nifty settles at 10,821",
    "body": "Credit for small businesses may be central to the government's strategy of providing employment, but these small loans come at a cost to banks@aparnaviyer02https://t.co/SK0kTadvZo Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/Money/QcUMWJTEmcwcnLdW18m9DP/Stock-Market-LIVE-Sensex-Nifty-set-weak-opening.html",
    "original_url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPbm1FdXdPcUV1V3NLSDFQR3BxdEU0SndqWHVLOGVVVTd0dG9xQjBJWkwxRm1oMTNDQXA5eEgxbTMtY2xlVjU5OFhaWU0yNzF3YUlvQkR3ck4xc2d3dlVwWmh6V29Ub1BYZ3ZnaHpIMEpLTWUxX2ZqUE9xSl9oOVczam1kcTduRzYzbXFrd1BxTTVEelctVkdNdGtzU2ZhVEpnbVRYMDdCTXEwdw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 400,
    "word_count": 57,
    "gnews_title": "Closing bell: Sensex surges 257 points led by banking stocks, Nifty settles at 10,821 - Mint",
    "published_date": "22/06/2018",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Market on Budget 2018: Sensex ends near 35,900, Nifty holds 11,000; PSU bank, pharma shares bleed",
    "body": "Budget 2018: Indian stock markets ended marginally lower on Thursday as Finance Minister Arun Jaitley presented the last full-year Budget before the Lok Sabha Elections in 2019. Investors all across are keenly awaiting for the Union Budget 2018 as it was the first budget after the nation-wide constitutional reform GST (Goods and Services Tax) implemented in July 2017. The benchmark Sensex extended yesterday’s losses to close slightly lower and Nifty index also saw a little decline but managed to end above 11,000-mark. Earlier yesterday, Indian stock markets ended marginally lower ahead of the Union Budget 2018 with Sensex and Nifty finishing in negative territory for the second consecutive day. Meanwhile, US stock markets concluded slightly higher on Wednesday as indices gave up early gains after the US Federal Reserve said it sees inflation rising this year, signalling it remains on track to boost interest rates again in March, Reuters said in a report. The Federal Reserve kept rates unchanged but, in a statement following its two-day policy meeting, it repeated that it expected that “further gradual” rate hikes will be warranted, Reuters added. The Dow Jones Industrial Average rose 73.74 points or 0.28% to 26,150.63, the S&P 500 gained 1.47 points or 0.05% to 2,823.9 and the Nasdaq Composite added 9.00 points or 0.12% to 7,411.48. — Indian stock market activity on the day when Finance Minister Arun Jaitley tabled Budget 2018 — 15:30 pm: Closing Bell | Indian stock markets finished marginally lower on the Budget 2018 day, Thursday in a heavy volatile trading activity with stocks of pharma and PSU bank dropping the most. The benchmark Sensex extended yesterday’s losses to close slightly lower and Nifty index also saw a little decline but managed to end above 11,000-mark. BSE Sensex lost 58.36 points or 0.16% to conclude at 35,906.66 and NSE Nifty shed 10.8 points or 0.1% to settle at 11,016.9. During the day, the S&P BSE Sensex plunged 463.28 points to hit an 8-day low of 35,501.74 while Nifty washed away 148.9 points to hit an 8-day low at 10,878.8. Shares of M&M, L&T, IndusInd Bank, Bajaj-Auto, Asian Paints , ITC, Yes Bank, TCS emerged as the lead gainers on BSE Sensex on Thursday rising 1-5% while, on the other hand, shares of ONGC, Sun Pharma, Dr Reddy’s Lab, SBI, ICICI Bank, Reliance Industries, Tata Steel, Maruti Suzuki, Tata Motors, and Wipro lost up to 4.1%. This image shows the 30 shares of S&P BSE Sensex index after the stock markets were closed on Thursday. (Image: BSE) Shares of Heavyweight companies such as Reliance Industries, ICICI Bank, HDFC Bank, State Bank of India , Sun Pharma, ONGC, Maruti Suzuki, and Infosys contributed heavily to the Sensex losses. Jointly, these eight stocks washed away as much as 238 points out of the 58-point drop in the Sensex. While a sustained uptick in the shares of L&T, ITC, M&M, HDFC, IndusInd Bank, TCS, and Kotak Mahindra Bank helped to trim partial losses in the index, adding 193 points to the index. This image shows the point-wise contribution of 8 stocks which led the Sensex fall on Thursday. (Image: BSE) Among the PSU bank stocks, shares of Syndicate Bank, Allahabad Bank, Canara Bank , Union Bank of India, Bank of Baroda , Indian Bank, State Bank of India, Punjab National Bank, Andhra Bank, and Bank of India lost 2-5% with benchmark Nifty PSU Bank index shedding 2.3% to finish at 3,597.1. 15:20 pm: Indian equities again fell into negative territory in the last 30 minutes of trade with Sensex trading 63.72 points lower at 35,901.3 as stocks of blue-chip companies such as RIL, ICICI Bank, and HDFC hovering in the red. 15:05 pm: In Union Budget 2018, Finance Minister Arun Jaitley has announced various agricultural reforms in a bid to double farmer income by 2022. Notably, agriculture sector provides employment to nearly 50% of the total workforce in India and contributes around 17-18 percent to the country’s GDP. Read More | Budget 2018 and agriculture: FM Jaitley provides relief to farmers; 4 key takeaways 14:50 pm: The last full Budget of the present government, presented by Finance Minister Arun Jaitley today, disappointed the middle-class by not announcing any changes in the income tax slab while choosing to dedicate the fiscal space to farmers, poor, rural population and small businesses. Read More| Budget 2018 analysis and expert reactions: Arun Jaitley dedicates his little fiscal space to farmers, poor, small businesses 14:35 pm: Indian stock markets erase gains in the late afternoon trades with Sensex trading up 8.99 points or 0.02% at 35,974.01 and Nifty trading at 11,030.35, up by 0.02%. Shares of ITC, L&T, IndusInd Bank, M&M, HDFC, TCS, Yes Bank and Axis Bank contributed the most in the Sensex gains, collectively contributing about 222 points to the index. This image shows the point-wise contribution of 8 shares to Sensex. (Image: BSE) 14:20 pm: Finance Minister Arun Jaitley tabled the budget 2018 in Parliament on Thursday. The budget is the last one ahead of general election in 2019. The budget mostly focussed on agriculture and rural infrastructure. It also proposed to provide housing to all poor in the country by 2022. Here are the 10 new announcements and key features of Budget 2018 14:00 pm: Some relief to the middle class will come as Finance Minister Arun Jaitley announced an excise duty cut on petrol and diesel by Rs 2 per litre in the Budget 2018. The oil ministry had demanded excise duty cut from the finance ministry on the back of rallying crude oil price. Read More | Some relief for middle class! Petrol, Diesel to get cheaper by Rs 2 per litre as Jaitley cuts excise 13:45 pm: In the Union Budget 2018 presented in Parliament today, Finance Minister Arun Jaitley said that the government will merge the three public sector general insurance companies, to create a single insurance behemoth prior to its listing. Read More | Government to merge 3 public sector insurance companies before listing 13:25 pm: Shares of India’s largest FMCG company ITC surged over 6% to the day’s high of 288.15 followed by the shares of Yes Bank, IndusInd Bank, L&T, M&M, Axis Bank rose 2-4%. BSE Sensex gained 247.89 points or 0.69% to 36,212.91. 13:07 pm: Indian stock markets recover most of the losses with Sensex trading flat at 35,965.69 while Nifty still hovering in the red at 11,007, down by 0.19%. 13:00 pm: In the Budget presentation in the Parliament, Finance Minister Arun Jaitley announced a corporate tax cut to 25% for MSMEs. “I propose to extend benefit the benefit of lower tax rate of 25% to companies with a reported turnover of Rs 250 crore,” the finance minister said. Read More | FM Jaitley announces corporate tax cut to 25% for turnover up to Rs 250 crore Finance Minister Arun Jaitley on Union Budget 2018. (Image: ANI) 12:50 pm: “Arun Jaitley on introducing LTCG at 10%” “Madam Speaker, currently, long-term capital gains arising from transfer of listed equity shares, units of equity oriented fund and unit of a business trust are exempt from tax. With the reforms introduced by the government and incentives given so far, the equity market has become buoyant. The total amount of exempted capital gains from listed shares and units is around Rs 3,67,000 crores as per returns filed for the assessment year 2017-2018,” Arun Jaitley said. “Major part of this gain has accrued to corporates and LLPs. This has also created a bias against manufacturing, leading to more business surpluses being invested in financial assets. The return on investment in equity is already quite attractive even without tax exemption,” Arun Jaitley said further. “There is, therefore, a strong case for bringing long-term capital gains from listed equities in the tax net . However, recognising the fact that vibrant equity market is essential for economic growth, I propose only a modest change in the present regime. I propose to tax such long-term capital gains exceeding Rs 1 lakh at the rate of 10% without allowing the benefit of any indexation. However, all gains up to 31st January 2018 will be grandfathered,” Arun Jaitley added. “Example provided by the Finance Minister Arun Jaitley” For example, if an equity share is purchased six months before 31st January 2018 at Rs 100/- and the highest price quoted on 31st January 2018 in respect of this share is Rs 120/-, there will be no tax on the gain of Rs 20/- if this share is sold after one year from the date of purchase. However, any gain in excess of Rs 20 earned after 31st January, 2018 will be taxed at 10% if this share is sold after 31st July 2018. The gains from equity share held up to one year will remain short-term capital gain and will continue to be taxed at the rate of 15%. 12:43 pm: Indian equities witness heavy sell-off pressure following Finance Minister Arun Jaitley’s introducing an LTCG tax at 10%. The benchmark Sensex plunged 463.28 points to hit an 8-day low of 35,501.74 with shares of heavyweight companies such as Infosys, RIL, ICICI Bank, Maruti Suzuki, SBI shedding the most. 12:38 pm: Indian stock market crashes! Sensex tanks on heavy selling after Finance Minister introduced an LTCG (long-term capital gains) tax at 10% for investments over Rs 1 lakh. The S&P BSE Sensex tanked 374.85 points to the day low of 35,590.17 while Nifty shed as much as 117.2 points to the day’s low of 10,910.5. 12:34 pm: Shares of Infosys, RIL, ICICI Bank, Maruti Suzuki, HDFC Bank. Sun Pharma, Tata Steel, State Bank of India, Dr Reddy’s and Bharti Airtel contributed the most to the Sensex decline. Collectively these 10 shares washed off as much as 136 points out of the Sensex index while an uptick in shares of L&T, M&M and ITC helped to trim the losses. This image shows the point-wise contribution of top 10 stocks of Sensex. (Image: BSE) 12:27 pm: In the Union Budget 2018, Finance Minister Arun Jaitley announced a modest increase in disinvestment target to Rs 80,000 crore for FY 18-19. Earlier, it was expected that Finance Minister Arun Jaitley would set a steeper disinvestment target for FY19. India’s disinvestment target for the year 2017-18 was Rs 72,500 crore, of which, as on January 22, Rs 55,560.73 crore has been achieved, and with ONGC-HPCL deal Rs 36,915 crore, the government is not merely set to achieve the goal for the first time, but also surpass it by a wide margin. Read More | FM Arun Jaitley announces modest increase in disinvestment target to Rs 80,000 crore 12:20 am: Finance Minister Arun Jaitley today fixed the fiscal deficit target for the fiscal year 2018-2019 at 3.3%, higher than previous year’s 3.2% target on account of shortfall in non-tax revenue. He also revised the fiscal deficit for the fiscal year for 2017-2018 upwards to 3.5% as against targeted 3.2%, which in absolute terms was about Rs 5.95 lakh crore. Read More | Arun Jaitley fixes fiscal deficit target for FY19 at 3.3%, FY18 revised to 3.5% from 3.2% 12:15 pm: Indian stock markets take a heavy jolt as Sensex plunges 98.77 to hit a day’s low of 35,866.25 with shares of Infosys, ICICI Bank, Maruti Suzuki, Tata Steel, Bharti Airtel, Reliance Industries, HDFC Bank, Dr Reddy’s, State Bank of India slipping into negative territory. 12:12 pm: In the Union Budget 2018, Finance Minister Arun Jaitley said that there has been a mass formalization of MSMEs after structural reforms of GST and demonetization. The government had earlier announced GST with the aim to help move small-scale businesses from the unorganised to organised sector. Read More | FM Jaitley says mass MSMEs in for mass formalization after GST, demonetisation 12:07 pm: FM Arun Jaitley says Indian capital market regulator, SEBI To consider a mandate for large corporations to meet 25% of debt needs from the bond market, adding to it, he said b onds available to insurance companies to be widened to A-rated bonds from AA-rated bonds. 12:01 pm: FM Arun Jaitley said b lockchain technology allows the organisation of records w/o intermediaries. The government d oes not recognise cryptocurrencies or bitcoin as a legitimate currency and w ill take all measure to eliminate the use of crypto in financing illegitimate operations, Arun Jaitley said further. 11:56 am: Finance Minister Arun Jaitley today announced flagship National Health Protection Scheme to cover 10 crore poor families in the country and allocated Rs 5 lakh per family per year. He said that the health scheme will cover nearly 50 crore poor citizens of this country. Read More | Arun Jaitley announces Rs 5 lakh for 10 crore poor families annually 11:50 am: Shares of the industrial sector were the top gainers among all the sectors as Finance Minister Arun Jaitley ensured every poor will have a house by the year 2022. Finance Minister in his budget speech said that there will be 51 lakh houses built in rural areas by end of FY18-19. Shares of Kingfa Science & Technology , Sanghvi Movers , Gammon Infrastructure Projects rose up to 6%. A dedicated Affordable Housing Fund will be set up under NHB that will ensure there are 37 lakh houses built in urban areas by end of FY18-19. PMJBY will be extended to all poor houses, says Finance Minister. 11:44 am: Most Shares of capital goods were trading higher with stocks of Thermax, Kalpat Power, NBCC, L&T, Suzlon, Sadbhav and BEML rose 1-5%. This image shows the S&P BSE Capital Goods index. (Image: BSE) 11:40 am: Finance Minister Arun Jaitley proposes to raise institutional credit for agriculture to Rs 11 Lakh Crore for the financial year 2018-2019. 11:38 am: Shares of MCX jumped 2.6% to the day’s high of Rs 795.9. 11:33 am: In Union Budget 2018, Finance Minister Arun Jaitley said that the government had always been keen to enhance their commitment to the welfare of farmers, and achieving the goal of doubling farmer income by the year 2022, by the 75th year of Indian Independence. Read More | FM Arun Jaitley announces agricultural reforms to double farmers income by 2022 11:30 am: Indian stock markets sustained the gains as FM Arun Jaitley speaks about various schemes. Sensex was trading up 154.54 points at 36,119.56 with heavyweight hares of L&T, M&M, IndusInd Bank, ITC, Kotak Mahindra Bank, TCS, Asian Paints rose 1-4%. 11:25 am: Arun Jaitley emphasizes on the agriculture sector. Arun Jaitley said that government is committed to the welfare of farmers with considering agriculture as an enterprise, want them to produce more using the same land parcel at lower cost, and at the same time, realise higher prices. Following this, shares related to agriculture sector such as Bayer CropScience , PI Industries, Rallis India, Monsanto India, Excel Crop Care, Sharda Crop, Dhanuka Agritec and Nacl Industries rose up to 8%. 11:18 am: Indian markets cheer as Arun Jaitley addresses Parliament. The global indicator of NSE Nifty, SGX Nifty Futures rose 0.36% to 11,099.5 on the Singapore Stock Exchange. 11:16 am: Finance Minister Arun Jaitley while presenting the last Budget of the present government in Hindi, gave the report card of the economic growth of the country and expressed confidence that soon India will achieve the 8% growth rate and become the fifth largest economy in the world soon. Read More | Budget 2018: Arun Jaitley says India can achieve GDP growth of 8 %; to become 5th largest economy soon 11:10 am: As Finance Minister Arun Jaitley’s speech progresses, Indian stock markets extend jubilation. S&P BSE Sensex shoots up 220 points to 36,185.04 whereas NSE Nifty scales 68.25 points to 11,095.95, just 5 points short of 11,100. 11:05 am: As Finance Minister Arun Jaitley presents the Union Budget, Indian equities held the morning gains as investors all across have waited with the baited breath for this moment. BSE Sensex was trading 180.1 points 0.50% at 36,145.12 and Nifty index was just 18 points short of climbing 11,100-mark, trading up 54.45 points or 0.49% at 11,082.15. 11:00 am: “Arun Jaitley Budget 2018 speech begins” 10:40 am: Budget documents got clearance in the cabinet meeting. Union Finance Minister Arun Jaitley is all set to present the India Budget 2018 at 11 am today. 10:35 am: “Shares related to Indian Railways” Shares related to the Indian Railways were trading mixed ahead of the Budget 2018. Stock Rise/Fall(%) Price (Rs) L&T 2.84 1,456.9 Texmaco Rail and Engineering 1.35 102.05 BEML 0.15 1451.25 Siemens 0 1,297.6 ABB -0.05 1,656.5 Gateway Distriparks -0.41 228.8 Titagarh Wagons -3.48 151 Kernex Microsystems -4.14 52.15 Shares of BEML, Siemens and Reliance Infrastructure may gain on the back of this, she said, adding that these three stocks are also technically well placed. 10:20 am: The Finance Minister Arun Jaitley may break the tradition and deliver his maiden Budget speech in Hindi today for the first time. Ever since the time, India became independent, Finance Ministers have been delivering their respective Budget speeches in English languages, but FM Jaitley might go against all odds and deliver his speech in Hindi. 10:07 am: Shares of heavyweight companies such as L&T, Tata Consultancy Services, HDFC, Reliance Industries, HDFC Bank, M&M, IndusInd Bank, ITC, Kotak Mahindra Bank contributed in the Sensex rally. Collectively these nine shares added about 190 points to the index out of 186-point upsurge. 10:00 am: As the Indian stock markets eagerly await Finance Minister Arun Jaitley Union Budget presentation today, S Naren of ICICI Prudential mutual fund says that Sensex and Nifty will react to any tax changes over the next 2-3 days. Read More | Budget 2018: Will Sensex and Nifty react to changes in tax on equities? 9:53 am: Breaking! Indian stock markets extend gains with Sensex firing 261.95 points to hit the day’s high of 36,226.97 whereas Nifty reclaimed 11,100 -level zooming as much as 73 points to hit the day’s high at 11,100.7. 9:45 am: Seven out of 11 sectoral indices of National Stock Exchange were trading in green with Nifty Realty, Nifty PSU Bank, Nifty Auto, leading the charge while Nifty Metal, Nifty Pharma shed 0.5% each led by a slump in shares of Lupin, Dr Reddy’s, Sun Pharma, Hindustan Copper, Tata Steel, and Vedanta. Sectoral indices of NSE. (Image: NSE) 9:42 am: Shares of Vedanta fell over 2% to the Rs 333.35 on NSE after the metals and mining conglomerate Vedanta reported a marginal 1.8% rise in consolidated net profit to Rs 2,173 crore for the third quarter ended December 31, on the back of higher income. 9:35 am: Shares of L&T, M&M, TCS, HCL Tech, IndusInd Bank, Bajaj-Auto, Hero MotoCorp, Hindustan Petroleum Corporation, ONGC and Yes Bank were the top 10 gainers on NSE Nifty today with L&T emerging as the leader after posting robust Q3 results on Wednesday. This image shows the top 10 shares of Nifty 50 index. (Image: NSE) 9:28 am: Shares of Fortis Healthcare shed 4.5% to hit the day’s low of Rs 132.45. 9:25 am: Shares of IT services provider Vakrangee tanked as much as 20% in the morning trades. The stock of Vakrangee dived 20% to hit the day’s low of Rs 292.3 on BSE while the stock crashed to a day’s low of Rs 291.8 on NSE. A heavy trading volume was observed in the shares of Vakrangee, as at 9:25 am, more than 90 lakh shares exchanged hands on both NSE and BSE with about 73 lakh on NSE alone. 9:20 am: Indian equities quickly extend morning gains with Sensex advancing as much as 171.38 points to hit the day’s high of 36,136.4 while Nifty inched up 49.7 points to mark the day’s high at 11,077.4. Shares of L&T were among the top gainers on BSE Sensex, rising over 3% to Rs 1,461.5 followed by M&M, Yes Bank, and ONGC. Opening Bell | 9:15 am: Indian stock market opened little higher on Thursday ahead of the Union Budget 2018 as Finance Minister Arun Jaitley readies to present the last full year Budget before the 2019 general elections. The S&P BSE Sensex rose 83.97 points or 0.23% to start at 36,048.99 whereas NSE Nifty added 16.85 points or 0.15% to begin at 11,044.55. Shares of L&T, SBI, M&M, Axis Bank, Tata Steel, Wipro emerge as the top gainers on the headline indices. 9:07 am: Indian equities at pre-open | At the pre-opening session, stocks of L&T, Indiabulls Housing Finance, Hindalco, SBI, M&M, TCS, Zee Entertainment Enterprises were the top gainers on Thursday ahead of Union Budget 2018. Top 10 gainers in the pre-opening session on Thursday. (Image: NSE) 8:45 am: Shares of Vakrangee, Tata Steel, ICICI Bank, HDFC, Quess, HDFC Life, Indian Oil, RIL, Infosys and ITC topped the turnover on National Stock Exchange on Wednesday. This image shows the top 10 shares which topped the turnover on Wednesday. (Image: NSE) 8:35 am: Shares of Shares of Bharti Infratel, Kotak Mahindra Bank, Tech Mahindra, Reliance Industries, Tata Motors, Hindalco, HDFC, BPCL , IndusInd Bank, HPCL were the top 10 gainers on NSE Nifty on Wednesday rising 07-2.2%. This image shows the top 10 gainers on the Nifty index on Wednesday. (Image: NSE) 8:30 am: All the broader market indices closed in red with Nifty Midcap 50, Nifty Mid100 Free, Nifty Sml100 Free losing the most while Nifty Next 50, Nifty 100, Nifty 200, Nifty 500 shed 0.2-0.8%. India Vix, the indicator of volatility fell 2.69%. This image shows broader indices of NSE as on Wednesday. (Image: NSE) 8:25 am: The blue-chip stock of L&T will likely to see action on Thursday as India’s infrastructure major on Wednesday reported a 53% rise in the quarter ended December 2017, beating analysts’ expectations, as new orders rose, mainly in the infrastructure and hydrocarbon segments. Net profit during the quarter rose to Rs 1,490 crore from Rs 972 crore a year earlier. 8:20 am: Shares of ICICI Bank will be closely watched on Thursday as India’s third-largest bank by assets reported a plunge of 27.45% on a yearly basis in the consolidated net profit to Rs 1,894.15 crore for the quarter ended 31 December 2017 on Wednesday due to higher provisioning as the bad loans of the private sector lender increased. On the assets front, the gross NPAs (non-performing assets) of ICICI Bank worsened to 7.82% of the gross advances as on 31 December 2017 as compared to 7.2% as on 31 December 2016. 8:16 am: The early indicator of NSE Nifty, SGX Nifty Futures was trading little changed, up 0.17% at 11,078 on the Singapore Stock Exchange on Thursday ahead of Budget 2018. Sensex on Wednesday: BSE Sensex slipped below the 36,000-mark losing 68.71 points or 0.19% to conclude at 35,965.02 whereas NSE Nifty managed to close above the psychological mark of 11,000 at 11,027.7, down by 21.95 points or 0.2% after hitting an intraday low of 10,979.3. This image shows the 30 stocks of S&P BSE Sensex index at closing on Wednesday. (Image: BSE) Read Next Muted Monday: Nifty ends below 24,650 pulled lower by financials, auto – 4 key highlights Markets slide: Nifty near 24,600, Sensex down 130 points; Banks under pressure 3 reasons why the market is falling today: Nifty cracks 1%, Sensex slides 800 points, small and midcaps sell-off",
    "url": "https://www.financialexpress.com/market/live-budget-2018-market-sensex-nifty-bse-corporate-sector-nse-indian-stock-market-live-on-budget-day-fm-arun-jaitley-1039188/",
    "original_url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxQbldnWC1QeGE3YkxHTV92MDYyUUtBby1oRHpucjhOREpOVVVMNmxWYVdFR2xZTTJaVldXUFc5SWstSkJ1bzRyeXZOUHZGYmMzZ05FdmtTMmlId2hLeVY0cWxkdFZCdFZXelJCQUVjdnJ1TzBIWDc5WFZkT1YzSm5iSU11TkhDdUZKTnpQVUpfbXFvcXVkTUtsTk9zQ3piMFlFUHNaSGpVRm5xUjEtVlhKZERBbFJ6dmZqSnpTNi0wR0NSUExOR3RyZHEyRjk5UjBadTJONFE2UC1BVmdJcnlwRDVDTUxBUFJ6UUdvMEVsd0llLWtFOHZrTg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 22880,
    "word_count": 3871,
    "gnews_title": "Market on Budget 2018: Sensex ends near 35,900, Nifty holds 11,000; PSU bank, pharma shares bleed - financialexpress.com",
    "published_date": "01/02/2018",
    "publisher": "financialexpress.com",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Traders’ Diary: Nifty needs to hold 10,550 level",
    "body": "- Vaishali Parekh, Senior Technical Analyst, Prabhudas Lilladher - Arun Kumar, Market Strategist, Reliance Securities - Chandan Taparia, Technical & Derivative Analyst, MOFSL - Jimeet Modi, Founder & CEO at SAMCO Securities and StockNote - Abhijeet Dey, Senior Fund Manager-Equities, BNP Paribas MF - Vinod Nair, Head of Research, Geojit Financial Services - Mazhar Mohammad, Chief Strategist – Technical Research & Trading Advisory, Chartviewindia.in Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/sensex-nifty-live-today-2018-12-07/liveblog/66980608.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOVFhaQW5JWDNSN2pWSERpMmdhUktaXzA2azNTejJIWFJZSlhoVW9NSERibXVoRFBBVU51MGlrS3VvRGNtUGhvSzVIUnl4SW5DSmRsV3FfN3dGYzEwb2Ria2E0OU9jOWR1bU10U0hPSHA4ekItUkEtdmJ4c0dJbi1LeFNjc1lLZUJQc2IxTdIBkgFBVV95cUxNbzlMSm14TjZRc3kyaWVaYkRndzJfbmVKcnZjZDVZMDVKbHE1U21Kb1RKQ2NMaWplc2tDQzBOYTNLejdPUVRjRC1Yb3J0Z25oM255MmltSXlQSW9rT3k3bDhQUVZ3Y3Zqb2N2UkFkX1M1SVF3cUxTX092eUxjR09WZTZrRW5iUjhBYlJDRmxoMDJKUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 765,
    "word_count": 116,
    "gnews_title": "Traders’ Diary: Nifty needs to hold 10,550 level - The Economic Times",
    "published_date": "07/12/2018",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Share market HIGHLIGHTS: Terrific Thursday! Sensex surges 453 pts; Nifty ends above 10,850 on F&O expiry day",
    "body": "Share market HIGHLIGHTS: The BSE Sensex continued its winning streak for the fourth consecutive day and ended Thursday’s trade 453.46 points or 1.27% higher at 36,170.41 points. The NSE Nifty 50 closed 129.85 points or 1.21% higher at 10,858.70 points. The benchmark indices continued to gain for the fourth consecutive session today on the back of positive global cues, coupled with an appreciating rupee on the back of sliding crude oil prices, and healthy buying in financials stocks. The rupee appreciated past the 70/$ mark for the first time today in over three-months. Shares of Reliance Industries Ltd gained over 2% to a high of Rs 1,176.8 today. Notably, this was the highest level since October 17. Yes Bank shares staged a smart recovery and recovered nearly 13% from its day’s low at Rs 147 per share on the BSE. Shares of the private lender plunged to their lowest in more than two years on Thursday after credit rating agencies ICRA and CARE Ratings downgraded ratings on the lender’s debt instruments. Jet Airways shares jumped nearly 3% to a high of Rs 317.90 per share on the BSE today after the airline clarified that reports of Naresh Goyal’s exit and the increase in share price of the company were speculative in nature. Asian stocks advanced on Thursday, tracking a surge on Wall Street, after the chairman of the U.S. Federal Reserve suggested it may nearing an end to its three-year rate tightening cycle, boosting interest in riskier assets, said a Reuters report. European shares joined the rally on Wall Street after dovish comments from Federal Reserve Chair Jerome Powell boosted investor sentiment towards stock markets despite uncertainty over a possible escalation in the U.S./China trade dispute. Read Next Markets rally after RBI announces big banking reforms: Nifty near 24,800, Sensex gains 500 Points; Bank Nifty jumps 1% Tuesday momentum: Nifty steady above 24,700, Sensex up 280 points From BEL, Waaree Energies, HUL to JSW Steel – Here are 10 stocks to watch Live Blog Share Market HIGHLIGHTS: Sensex, Nifty, Indian Rupee vs US Dollar, Latest Stock Market News, NSE, BSE Highlights 15:52 (IST) 29 Nov 2018 Viewpoint: Geojit Financial Services \"Market held-on to its strong gap-up momentum fuelled by FED’s dovish tone on interest rate cycle coupled with a fall in US bond yield to 2.99. Tailwinds in domestic macros led by sharp fall in oil prices and strong rupee supported the trend. While any ease in global trade tension after G20 meet this weekend will fillip global sentiment.\" -- Vinod Nair, Head of Research, Geojit Financial Services 15:44 (IST) 29 Nov 2018 NSE live! Check top Nifty gainers and losers The NSE Nifty 50 closed Thursday's trade 129.85 points or 1.21% higher at 10,858.70 points. The Nifty continued to gain for the fourth consecutive session today on the back of positive global cues, coupled with an appreciating rupee and a slump in crude oil prices. Check out the top five Nifty gainers and losers in today's trade: 15:34 (IST) 29 Nov 2018 CLOSING BELL! Sensex surges 453 pts; Nifty ends above 10,850; Bajaj Auto up 4% The BSE Sensex continued its winning streak for the fourth consecutive day and ended Thursday's trade 453.46 points or 1.27% higher at 36,170.41 points. The NSE Nifty closed above the 10,850 level. Bajaj Auto was the top gainer on the Sensex, up over 4%. 15:23 (IST) 29 Nov 2018 European shares join Wall Street rally on dovish Fed comments European shares joined an overnight rally on Wall Street after dovish comments from Federal Reserve Chair Jerome Powell boosted investor sentiment towards stock markets despite uncertainty over a possible escalation in the U.S./China trade dispute, said a Reuters report. The pan-European STOXX 600 benchmark was up 0.7% with all major bourses and most sectors trading comfortably in positive territory. Traders believe the risk of fast-rising interest rates hurting the U.S. economy and the stock market is now on the downside after Powell said monetary policy rate is now \"just below\" estimates of a level that neither brakes nor boosts a healthy economy. 15:13 (IST) 29 Nov 2018 10-year government bond yield slips below 7.6% While the rupee traded on a strong note tracking a slump in crude oil prices, the 10-year government bond yield slipped below 7.6% for the first time in the last 6 months. The rupee appreciated nearly 78 paise or 1.10% to trade at 69.84 against the US dollar. 14:50 (IST) 29 Nov 2018 Government plans NTPC OFS in December The government is planning to sell at least 3.25% stake in power producer NTPC in December, which will help garner Rs 3,800 crore to the exchequer, PTI reported quoting an official. The Cabinet had earlier approved disinvestment of 10% stake in NTPC, of which 6.75%was sold in August last year. At the current market price, sale of 3.25 per cent stake in NTPC will fetch about Rs 3,800 crore to the exchequer, the report said. The government currently holds 61.77% stake in NTPC. Through sale of 6.75% in NTPC, the government had last year raised over Rs 9,200 crore. NTPC shares were trading at Rs 142.25, down 0.87% in afternoon trade on BSE. 14:34 (IST) 29 Nov 2018 Crude extends decline; WTI crude falls below $50/barrel Crude oil prices extended decline on Thusrday, with WTI crude trading with losses of over 1%. WTI crude currently traded at $49.60 per barrel, down 1.37%. Brent crude oil prices traded 1.43% lower at $57.92 per barrel. 14:25 (IST) 29 Nov 2018 Nifty trades firmly above 10,850; check top gainers and losers The NSE Nifty traded firmly above the 10,850-level during the late afternoon trade deals today. Market sentiment was buoyed by positive global cues, along with an appfreciating rupee and healthy gains in bluechip stocks. Check out the top five Nifty gains and losers at this hour: 13:16 (IST) 29 Nov 2018 Yes Bank share recovers over 12% from day's low Yes Bank shares staged a smart recovery and recovered nearly 12% from its day's low at Rs 147 per share on the BSE. Yes Bank share price tanked over 9% to a fresh 33-months low after ICRA, CARE downgraded ratings on the lender's debt instruments. ICRA downgraded domestic long-term ratings of the bank's senior debt instruments to 'ICRA AA' from 'ICRA AA ' and its subordinate debt instruments to 'ICRA AA-' from 'ICRA AA', the bank said in a statement late on Wednesday. Meanwhile, CARE Ratings cut domestic ratings of Yes Bank's senior debt instruments to 'CARE AA ' from 'CARE AAA' and subordinate debt instruments to 'CARE AA' from 'CARE AA '. Read here: Yes Bank share price dives 9% on ratings downgrade, but soon recovers 13% from day’s low 12:30 (IST) 29 Nov 2018 Nifty IT only sectoral loser The Nifty IT index was the only sectoral loser in tody's trade as the rupee appreciated against the dollar. Meanwhile, the NSE Nifty continued to trade with nearly 1% gains led by positive global cues, a strong rupee and healthy buying in blue-chip stocks. 11:34 (IST) 29 Nov 2018 Rupee strengthens further, gains nearly 70 paise against the US dollar The rupee extended gains during the late morning trade deals and rose 67 paise to trade at 69.9475 against the US dollar. The rupee gained past the 70/$ mark today for the first time since August 27. Rupee strengthened after the Federal Reserve Chairman Jerome Powell said that US interest rates were just below neutral, signalling that the rate hike cycle was nearing its end. Also, recent softening in crude oil prices and hopes of some positive developments in the US-China trade ties in the upcoming G20 summit also helped the currency. Read full story here: Rupee extends gains past 70 vs USD for first time since Aug 27 11:06 (IST) 29 Nov 2018 NSE LIVE! Nifty FMCG index gains over 1% The Nifty FMCG index gained over 1% during the mid-morning trade deals today. GlaxoSmithKline Consumer Healthcare shares gained over 3%, while Emami and HUL shares rose over 2% each. 11:02 (IST) 29 Nov 2018 RIL rises over 2%, hits 6-week high Shares of Reliance Industries Ltd gained over 2% to a high of Rs 1,176.8 today. Notably, this is the highest level since October 17. Reliance Industries arm has recently acquired a substantial stake in media startup New Emerging World of Journalism (NEWJ) with an initial investment of Rs 10.3 million. RIL stock is up 25.15% this year as of last close, compared with the NSE Nifty's 1.88% gain in the same period. Also read: RIL shares jump 2%, hits six-week high; chart shows further upside 10:39 (IST) 29 Nov 2018 Dollar under pressure after Fed's Powell says US rates near neutral The dollar weakened against its peers on Thursday after Federal Reserve Chairman Jerome Powell said U.S. interest rates were just below neutral, taken by many investors as a tip that the rate hike cycle was nearing its end, Reuters reported. Powell's dovish remarks took the currency markets by surprise as he noted that the policy rate, at 2-2.25%, is now \"just below\" the broad range of estimates of neutral, which in September was 2.5-3.5%. This view represents a significant departure from comments in October, when Powell said rates were a \"long way from neutral at this point\". The Fed chairman's remarks led to the dollar weakening across the board, especially versus riskier currencies such as the Australian and New Zealand dollars. They both gained 1.2% after Powell's remarks. Later, the Aussie advanced slightly more while the kiwi weakened. 10:37 (IST) 29 Nov 2018 PSU banks trade mixed; SBI top index gainer The Nifty PSU Bank index traded with over 0.5% gains during the mid-morning trade deals today. However, most PSU banks were trading with losses, including Canara Bank, Oriental Bank of Commerce, Central Bank of India, PNB, Bank of Baroda and Bank of India. SBI was the top gainer on the index. 10:32 (IST) 29 Nov 2018 China stocks extend gains; Hang Seng down China shares rose on Thursday morning on hopes for policy support and as U.S. Federal Reserve Chairman Jerome Powell made comments interpreted as a dovish shift, but investors remain wary ahead of the upcoming G20 meeting in Argentina, said a Reuters report. At the midday break, the Shanghai Composite index was up 7.26 points, or 0.28%, at 2,608.99. China's blue-chip CSI300 index was up 0.31%, with its financial sector sub-index higher by 0.02%, the consumer staples sector up 0.7%, the real estate index down 0.77% and the healthcare sub-index up 0.99%. 10:25 (IST) 29 Nov 2018 Vedanta shares rise nearly 4% Vedanta shares rose 3.88% to a high of Rs 200.45 per share on the BSE. An Indian court-appointed panel said on Wednesday that there were insufficient grounds to permanently close Vedanta's copper smelter and govt decision to shut it amounted to administrative overreach, said a Reuters report. The panel set up by National Green Tribunal said authorities in Tamil Nadu state where the plant is located had failed to comply with procedures before shutting down the smelter and co was not given any notice or opportunity to explain its position. Tamil Nadu ordered permanent closure of the smelter in May after 13 people protesting to demand its shutdown on environmental concerns were killed in a police firing. 10:14 (IST) 29 Nov 2018 Vakrangee shares hits upper circuit after SEBI investigation Vakrangee shares touched the upper circuit, jumping nearly 5% to Rs 30.7, the highest level in a month. Capital markets regulator on Wednesday said there were no findings of any stock manipulation by promoter entities after an investigation. However, during the investigation, it was observed that there was a delay in intimation of hike in shareholding by NJD Capital, Vakrangee Holdings Pvt Ltd, Dinesh Nandwana and Dinesh Nandwana. The Economic Offences Wing had last week given the co a clean chit after a complaint was filed against it and CEO. 10:08 (IST) 29 Nov 2018 Jet Airways shares jump 3% Jet Airways shares jumped nearly 3% to a high of Rs 317.90 per share on the BSE today after the airline clarified that reports of Naresh Goyal's exit and the increase in share price of the company were speculative in nature. In a BSE filing on Wednesday, the airline said: 'Please note that the subject news is speculative in nature and we are committed to make appropriate disclosures in accordance with applicable regulations to avoid any speculative activities.' 10:03 (IST) 29 Nov 2018 Gold gains as dollar sags on cautious Fed remarks Gold prices firmed on Thursday as the dollar faltered following dovish comments from U.S. Federal Reserve Chair Jerome Powell, calming investor concerns over the pace of rate hikes, Reuters reported. Spot gold was up 0.3% at $1,224.13 per ounce at 0410 GMT. Prices climbed about 0.6% on Wednesday, their biggest one-day percentage gain since November 16. U.S. gold futures were little changed at $1,223.2 per ounce. 10:01 (IST) 29 Nov 2018 Rupee past 70 per dollar mark for first time in three months The rupee continued to appreciate in the early morning trade deals on Thursday and gained past the 70/$ mark for the first time since August 27. The rupee currently traded 63 paise higher at 69.9875 against the US dollar. 09:54 (IST) 29 Nov 2018 IT index slips as INR gains strength The Nifty IT index was the only sectoral loser in tody's trade as the rupee appreciated against the dollar. The rupee rose to a three-month high against the dollar on Thursday after most Asian markets rallied following the U.S. Federal Reserve's comments, helping boost appetite for riskier assets, according to a Reuters report. 09:46 (IST) 29 Nov 2018 Yes Bank hits over 2-yr low after ICRA, CARE cut ratings Shares of Yes Bank Ltd plunged to their lowest in more than two years on Thursday after credit rating agencies ICRA and CARE Ratings downgraded ratings on the lender's debt instruments, a Reuters report said. The bank's shares fell 6.1% to Rs 152.15 rupees to their lowest since March 18, 2016, in early trade. ICRA downgraded domestic long-term ratings of the bank's senior debt instruments to 'ICRA AA' from 'ICRA AA+' and its subordinate debt instruments to 'ICRA AA-' from 'ICRA AA', the bank said in a statement late on Wednesday. Meanwhile, CARE Ratings cut domestic ratings of Yes Bank's senior debt instruments to 'CARE AA+' from 'CARE AAA' and subordinate debt instruments to 'CARE AA' from 'CARE AA+'. 09:45 (IST) 29 Nov 2018 Wall Street surges on hints of fewer rate hikes, dollar falls Comments by Federal Reserve Chair Jerome Powell that benchmark U.S. interest rates were “just below” neutral sparked a sharp rally on Wall Street on Wednesday, easing investor worries about the pace of rate hikes by the U.S. central bank next year. Hopes that the United States and China could call a trade war ceasefire at the upcoming G20 summit in Argentina also boosted stocks around the globe. Meanwhile, the dollar retreated with potentially fewer rate increases on the horizon, and sterling rose after the Bank of England said the British economy could shrink by as much as 8 percent in about a year after a no-deal Brexit.",
    "url": "https://www.financialexpress.com/market/share-market-live-updates-bse-sensex-today-nifty-yes-bank-crude-oil-rupee-reliance-capital-ril-29-november-2018-thursday-1397543/",
    "original_url": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxNazlFVlRvQXlFeWFTcWFOWnpYUVZncVE3N3ZmS3dhT001cWM2eUFkdE9IS2lSOXItbEpvVEhBNmtJMjhBdTg5OE5RY2EtVEpVNV9vT1U5OHM1clRybUczSXdmWHlBSVg1alJhSGVfOUNJcmpNQjEzZ0Z1QlpvNEgzVkxDM3VMZ1lERi1HSlU1M2hON3N1azIybFVUTlhLNU1GYkFteS1xblM0ZGxaQXk5S1M2TFJMM2lzMjczZV9kVDI2bG5RYUFMeDc5ZDFxNVF0TjYzZmFMZDREb2FMbTZXUlhNSDJkeXFsWmlkY0NEYTB5blJqeXhVT1cyUmpHUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 14991,
    "word_count": 2534,
    "gnews_title": "Share market HIGHLIGHTS: Terrific Thursday! Sensex surges 453 pts; Nifty ends above 10,850 on F&O expiry day - financialexpress.com",
    "published_date": "29/11/2018",
    "publisher": "financialexpress.com",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Traders’ Diary: Go for wait-and-watch approach",
    "body": "- Nagaraj Shetti, Technical Research Analyst, HDFC Securities - Chandan Taparia, Technical & Derivative Analyst, Motilal Oswal Securities - Mazhar Mohammad, Chartviewindia.in - Nikhil Kamath, Co-Founder, Zerodha - Abhijeet Dey, Senior Fund Manager-Equities, BNP Paribas MF - Jayant Manglik, President, Religare Broking Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/sensex-nifty-live-today-2018-07-02/liveblog/64821308.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQd1Fqckd4bEFNTnBGTlNuWEFKb085SDNSUjhDSDdNNXBURW54M2gwX1pCYVBTdFlIY01WNUt6VnJrTE1HUWE2MXk2NkI5cDU0ZlRpYW8zcWs2NDhnM2hXWlEyamJ4bEk0Z1M0TVhYcWNVUmk4TXRUSHhNcS1Xc19hX1RROXZndmJHaVZZetIBkgFBVV95cUxQM0NuTU5lVzVuZVY0TUM2X2NUOXl6NldwSXF4XzA3STVvRlpyQVJhQkxRbTl0WEI0ZXdDZm1ucG1xamo4RFBXdGhuMkN2WW1qOGNhNmdfbkRYejQ3VHpkLTkxd18ycFRLV1RMNmwtczViX0J4c05iT05BMWNIN2ljclpMQ3owUXgxeTFhWTlQRDkxdw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 632,
    "word_count": 94,
    "gnews_title": "Traders’ Diary: Go for wait-and-watch approach - The Economic Times",
    "published_date": "03/07/2018",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Closing bell: Sensex, Nifty rise over 2% ahead of inflation data led by auto stocks",
    "body": "Excise duty cut on aviation turbine fuel will bring relief for airlines, but hardly a life-changing move, writes@PallaviPengondahttps://t.co/5j7RnUBIAQ The International Monetary Fund's global financial stability report warns of serious risks to emerging market capital flows, by Manas Chakravartyhttps://t.co/VRJ1JClEXP The big question is if growth rates will sustain#TCSQ2#TCShttps://t.co/W2t7m0KOPR Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/Money/ycjxKREiE069fh5ge0QcFK/Markets-LIVE-BSE-Sensex-NSE-Nifty-to-open-higher-TCS-in-f.html",
    "original_url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQNXVBYWtlMjJSYnlVMnVWWkYydi1RdnFaWF9NUUNDc2U1LTQ2ZjRELTdfQnB1SmNHUWcya2RCS0hfR0xRUkdFUHdnR0Z3SjJDemxQM3NqTWhTWXRnNHRicHppdzQ5cW0tUlJnT2VKM1BxWFlPQ0NMbk9lcG4yNndkeDhkaTRHNWlabjdIWkFyWE5tLWVSM05FUnBDc2VVZnlyaDllODJ6al9UVzFaeDdsaWRDTHYtUFk?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 623,
    "word_count": 80,
    "gnews_title": "Closing bell: Sensex, Nifty rise over 2% ahead of inflation data led by auto stocks - Mint",
    "published_date": "12/10/2018",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Traders’ Diary: Accumulate quality stocks on dips",
    "body": "- Nagaraj Shetti, HDFC Securities - Aditya Agarwala, Technical Analyst, YES Securities - Mazhar Mohammad, Chartviewindia.in - Gaurav Ratnaparkhi, Senior Technical Analyst, Sharekhan - Chandan Taparia is Technical & Derivative Analyst at Motilal Oswal Securities - Jayant Manglik, President, Religare Broking - Abhijeet Dey, Senior Fund Manager-Equities, BNP Paribas MF - Sridhar Sivaram, Enam Holdings Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/sensex-nifty-live-today-2018-07-04/liveblog/64849711.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPYmdnVUstVGJSb1RkNjRQNWxXS0ZobFpSNmNQQjFFeGVBVDh6dkVndGRIQ05kT2lCR2JDN3FhWmZyeHBwYzJ3U29UUFhlTjMzemRjcFlqS3hqV2xma1pfYktXbzNmVmFZU2NneGMwdE5aa2t0ZHppOXBWaEJ0T0NIZy1zQUM1NXBZNXdFYtIBkgFBVV95cUxNaU9RRjd4VVlLMFdfd0JqWGd6d21Xal9xNFh0MDdZRDFmakZ1bEZLM1I4anlJclVXS21HVjNKeEwtNDZhUktrRlVGX18tb0xldUxjOGlHcWZ4eEFYY3IxUEZGY0lDR2E1LUNrTGw0N294TWdHR2psRGNKV0RJOGp6VEplQnU2bFRvZW8yUm1zMHZSQQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 715,
    "word_count": 107,
    "gnews_title": "Traders’ Diary: Accumulate quality stocks on dips - The Economic Times",
    "published_date": "05/07/2018",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  }
]