[
  {
    "title": "Market Highlights: Sensex ends 403 points higher, Nifty settles above 16,600-mark",
    "body": "Share Trading at a firm in Kolkata. (Express photo by Partha Paul) Share/Stock Market Highlights: The benchmark equity indices on the BSE and National Stock Exchange (NSE) ended around 0.75 per cent higher on Tuesday led by gains in metals, banking and financial stocks. The S&P BSE Sensex rose 403.19 points (0.73 per cent) to end at 55,958.98 while the Nifty 50 settled at 16,624.60, up 128.15 points (0.78 per cent). Story continues below this ad The gains on the Sensex were led by the shares of Bajaj twins – Bajaj Finserv, and Bajaj Finance , along with Tech Mahindra , Tata Steel , HDFC Bank and State Bank of India (SBI). Among the sectoral indices on the NSE, the Nifty Metal index rose 2.90 per cent on Tuesday led by gains in National Aluminium Company, NMDC and Welspun Corp. The Bank Nifty too rose 1.67 per cent aided by IDFC First Bank and AU Small Finance Bank. The Nifty Financial Services index climbed 1.39 per cent led by Bajaj Finserv, Mahindra & Mahindra Financial Services and Cholamandalam Investment and Finance Company. In the broader market, the S&P BSE MidCap index was trading at 22,809.53, up 334.23 points (1.49 per cent), while the S&P BSE SmallCap was at 25,783.63, up 425.61 points (1.68 per cent). In the broader market, the S&P BSE MidCap index rose 341.05 points (1.52 per cent) to end at 22,816.35, while the S&P BSE SmallCap ended at 25,786.96, up 428.94 points (1.69 per cent). The volatility index or India VIX fell 3.63 per cent to 13.1875. Apart from this, two new IPOs made their debut in today’s trade – Aptus Value Housing Finance India and Chemplast Sanmar. While Aptus Value Housing Finance made a weak listing on the stock exchanges at 6.5 per cent lower than its issue price, Chemplast Sanmar had a mixed listing today. (with inputs from agencies) Live Blog Stocks, BSE Sensex, NSE Nifty, Crude oil prices, gold, silver prices, commodity market and money markets LIVE updates: 16:07 (IST) 24 Aug 2021 MARKET QUOTE | Deepak Jasani, Head of Retail Research, HDFC Securities on Tuesday's market performance \"Nifty bounced up well over the past two days and on Aug 24, it filled the downgap formed on Friday on closing basis. The Advance-decline ratio also improved dramatically to the highest since Aug 12. Nifty is just 76 points away from the all-time high formed on Aug 18. More than the Nifty, focus will remain for some time on the broader markets, as to how much does the broader market recover when the Nifty is near all-time highs.\" 15:55 (IST) 24 Aug 2021 MARKET QUOTE | Vinod Nair, Head of Research, Geojit Financial Services on Tuesday's market performance \"Strong rebound in broader markets along with favourable global cues bolstered optimism in Dalal Street, led by metal, banking and realty stocks. Metal stocks led the rally as value buying was witnessed in the sector after deep sell-off during the past four trading sessions due to weak iron ore futures across the globe. The USFDA granted full approval to the Covid-19 vaccine by Pfizer and BioNTech which pumped in hopes of faster inoculations.\" 15:52 (IST) 24 Aug 2021 Rupee at close Rupee inches up 3 paise to close at 74.19 (provisional) against US dollar. (PTI) 15:33 (IST) 24 Aug 2021 Equity markets at close The S&P BSE Sensex ended at 55,958.98, up 403.19 points or 0.73 per cent, while the Nifty 50 settled at 16,624.60, up 128.15 points or 0.78 per cent. 15:30 (IST) 24 Aug 2021 Crude oil futures rise on spot demand Crude oil prices rose Rs 45 to Rs 4,932 per barrel on Tuesday, as participants widened their positions on a firm spot demand. On the Multi Commodity Exchange, crude oil for the August delivery traded higher by Rs 45, or 0.92 per cent, at Rs 4,932 per barrel in 4,927 lots. Analysts said raising of bets by participants kept crude oil prices higher in the futures trade. Globally, West Texas Intermediate crude oil was up 1.01 per cent to USD 66.30 per barrel, while Brent crude traded 1.15 per cent higher at USD 69.54 per barrel in New York. (PTI) 15:29 (IST) 24 Aug 2021 Silver futures drop on subdued demand Silver futures on Tuesday dropped Rs 90 to Rs 62,837 per kg, as participants reduced their bets on low demand. On the Multi Commodity Exchange, silver contracts for the September delivery tumbled by Rs 90, or 0.14 per cent, to Rs 62,837 per kg in a business turnover of 8,115 lots. Silver traded lower by 0.24 per cent at USD 23.65 per ounce in New York. (PTI) 15:28 (IST) 24 Aug 2021 Gold futures fall on low demand Gold prices fell Rs 98 to Rs 47,486 per 10 gram in the futures trade on Tuesday, as speculators reduced their positions amid low demand. On the Multi Commodity Exchange, gold contracts for the October delivery traded lower by Rs 98, or 0.21 per cent, to Rs 47,486 per 10 gram in a business turnover of 11,947 lots. Analysts attributed the fall in gold prices to trimming of positions by participants. Globally, gold traded 0.18 per cent lower to USD 1,803 an ounce in New York. (PTI) 15:04 (IST) 24 Aug 2021 Soybean futures rise on fresh bets Soybean prices on Tuesday went up by Rs 110 to Rs 8,740 per quintal in futures market as traders created fresh positions tracking positive spot demand. On the National Commodity and Derivatives Exchange, soybean for September delivery rose by Rs 110, or 1.27 per cent, to Rs 8,740 per quintal with an open interest of 20,325 lots. Marketmen said raising of fresh positions by speculators on the back of higher demand mainly led to rise in soybean prices. (PTI) 15:02 (IST) 24 Aug 2021 Nickel futures rise on firm spot demand Nickel prices rose 0.2 per cent to Rs 1,425.60 per kg in the futures trade on Tuesday, as speculators built up fresh positions on rising demand from alloy makers in the spot market. On the Multi Commodity Exchange, nickel contracts for the September delivery gained Rs 2.90, or 0.2 per cent, to Rs 1,425.60 per kg in a business turnover of 914 lots. A rise in demand in the spot market from alloy makers mainly supported the price rise in nickel futures, analysts said. (PTI) 15:01 (IST) 24 Aug 2021 Copper futures fall on weak demand Copper futures on Tuesday slipped 0.18 per cent to Rs 708.35 per kg, as participants cut their positions amid muted demand in the domestic market. On the Multi Commodity Exchange, copper contracts for the August delivery eased by Rs 1.25, or 0.18 per cent, to Rs 708.35 per kg in a business turnover of 2,421 lots. Analysts said trimming of positions by speculators due to muted demand in the spot market mainly led to the fall in copper prices here. (PTI) 14:20 (IST) 24 Aug 2021 Gold eases, hovers above $1,800 on virus fears, easing taper concerns Gold prices eased on Tuesday but hovered above the key psychological level of $1,800, as the rising threat from increasing Delta coronavirus variant cases fanned expectations that the US Federal Reserve might delay easing its accommodative stance. Spot gold eased 0.1% to $1,803.53 per ounce by 0650 GMT, after jumping about 1.4% on Monday. US gold futures were flat at $1,806.30. (Reuters) 14:11 (IST) 24 Aug 2021 Petrol and diesel prices cut Prices of petrol and diesel eased across the country on Tuesday, August 24, 2021, after remaining steady for a day. In the national capital, the petrol price fell 15 paise while that of diesel slipped 15 paise. Following the latest price revision, petrol in Delhi is now retailing at Rs 101.49 a litre while diesel is selling at Rs 88.92. In the financial capital Mumbai, petrol price now stands at Rs 107.52 while diesel costs Rs 96.48, data available on Indian Oil Corporation’s website showed.",
    "url": "https://indianexpress.com/article/business/market/equity-commodity-money-markets-live-updates-stocks-shares-bse-sensex-nse-nifty-rupee-crude-oil-gold-silver-metals-prices-august-24-7467918/",
    "original_url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxNeVppZjFYRldta1NqVTBPbFY3MXRyVk9YaXpUbEp2dmVROWRLUlR3YkVvWXIxMHdzR0x6MWh5NkYzTFpQQ1A2aHFqaDdMTVNzbXF1Qlkxa2dfVnVJUmJWa3U2WGlqTTVLZHBSeWEwb3BmX3gwNWxhaVBuY3BidzZvSkNkMHBJMEpuNzh5Wm5oVzZGYkczYlppZHpmcXhnV3ZXUl9UaFVWakJNNGV2eTQ3QjRqOEx4eGNHS1VFX2ZjYW9pNlBXVm5sNWJTUEE3a1hkZXZBdC1tVzR2dUJUa2x4N3hBVC1oLVVMdms3dXJZYXFmOUVRejhlZ21VWFlxY0F4NkRnbjY0alFYVlgxeVlKTjMwd2tmd2cy0gGfAkFVX3lxTFAzRGRBLVN1ekp0Y2ZYb1N0b3k4WGh6cVM4cExfV05lNGFweWpOU3h0NkN3MUNCMW1tclU0TmFfMDZ6YlRWekpVLUpVWF9qOVVYZ2lBQmxGdWRVRWtRaUhPd3dlSlhGV25mZXNqdEl1Y28wUHVnMERSUWp6XzV5dmt5X1c0NzZjN2FJTm5ObFBMRE5icGVZc29aMjRDT18wNnFHMmtQc2E4NzJOYUZyQ3NxaVl2bkdCaTI3TGozVVcwdWUzSzhlODVGT2E3d25WcTBoZnMwenZtblNxblY5MWxYa2RsTzNaUDFldXhCMHhkZW5kWTUyZ2ZVbUpyS0o3dFJOQjJacjQ5YnhBN1RBbXVadHNzelJ5cVV0cGFxck5r?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7565,
    "word_count": 1325,
    "gnews_title": "Market Highlights: Sensex ends 403 points higher, Nifty settles above 16,600-mark - The Indian Express",
    "published_date": "24/08/2021",
    "publisher": "The Indian Express",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex, Nifty close at record highs: 3 reasons behind stock market optimism",
    "body": "Indian benchmark indices on Mondayclosed at record highsonce again as market sentiment remains high. S&P BSE Sensex rose 1 per cent or 486.81 points to 49,269.32, while NSE Nifty 50 ended at a record closing peak of 14,484.75, up almost one per cent. A good start to the quarterly earnings season, ongoing vaccination developments and hopes of a higher stimulus package in the US boosted domestic markets in India. Higher foreign fund inflows also contributed to domestic market’s performance today. The rally in IT stocks was a major reason behind higher optimism on the trading floors of Dalal Street. IT stocks led from the front today and remained top gainers on the indices. Top gainers on the 30-share Sensex pack included technology firms like HCL Tech, Infosys, TCS, and Tech Mahindra — all of them had gained between 2 to 6 per cent on the BSE. The Nifty IT index also closed 3.3 per cent higher at 27,027.75. The robust earning performance from TCS also helped today’s rally and boosted markets. The technology giant gained after reporting blockbuster third-quarter results. The company’s shares rose by almost three per cent in morning trade before closing almost 1.6 per cent higher. Read |Sensex tops 49,000 as TCS earnings boost IT stocks, Nifty above 14,400 \"The expectations of results from blue-chips are very high. The global markets are good and liquidity is also coming. The sentiment is so solid that markets are not concerned about valuations. This (up)trend is looking difficult to break,\" said Vinod Nair, head of research at Geojit Financial Services. Another factor that contributed to domestic market optimism on Monday was good news regarding the vaccine rollout. It has been confirmed by the government that phase one of themass vaccination against Covid-19 will begin from January 16. Market participants are keenly awaiting the mass vaccination drive to start as it will further lead to further easing of economic activity. It may be noted that India has authorised two Covid-19 vaccines till date — Bharat Biotech’s Covaxin and the Oxford-Astra Zeneca & Serum Institute of India vaccine Covishield for emergency use. Read |India's vaccine cost-effective, vaccination to begin from Jan 16: PM Modi The first phase of the Covid-19 vaccination drive is expected to start by January 16 with health care workers, frontline workers and the elderly. There are a bunch of other factors that have boosted market optimism. Higher foreign fund inflows, the possibility of a bigger US stimulus package and buzzing auto stocks also helped boost market optimism. Market investors are optimistic ahead of the government’s upcoming budget, which will be crucial for India’s economic revival. Although the government is tight on finances due to additional Covid-19 expenditure, it is likely to go for higher spending in its budget to boost growth and demand.",
    "url": "https://www.indiatoday.in/business/story/sensex-nifty-close-at-record-highs-3-reasons-behind-stock-market-optimism-1758019-2021-01-11",
    "original_url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPbkVCN2h3NkdvSVFLdFh2cUxGRE9fdVFhUDBrSnVkcHc2ZFdjbktCN2VhN0d6RzZQUkhfOHhnUUl3UkZRcHc2RVZGX3M0d1pBREh4Q0pYSmo4VldObjhNNXdQOW9jRndDV2g3X1VyaTRKbVAxdHhfc2NaZF92U0RUbDVHdkJWRFFwWmc0ZFliS084NGpqQkFXRVk5TDRwYk5xVFAzNTdWNnNsU0RpbnJnVjFWaUpwQnNhcDdKQWRrM2RXRGl4MGlRd2dEazRHQdIB0wFBVV95cUxPbmJMLVZzY242ZW9kdWFmMUZaMHU0OVBOdF9vYU9jWnNoQnBONk1OQ3ljdHZQQXdyLTR0ZmFYMXBVWFd1YndlQkZzNTd4X1c0MDVsUDFpdnBWOG5XaGpQLTZJM0FtVW04ZTYzNXh3T3pHZ1NhWEd1NUwwTVVPeE5fQS0yYUZwQW5GM25wTU5BSHhTY0VDX210Q094Ul9qQTNHV0ZBRW9pRzNLajVLcmFVRkFnS3lfVjRaTXF4M09wMFJPS3pZRU82QlNjalhwZ3pnVDdn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2873,
    "word_count": 465,
    "gnews_title": "Sensex, Nifty close at record highs: 3 reasons behind stock market optimism - India Today",
    "published_date": "11/01/2021",
    "publisher": "India Today",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50 at 17,500 level! What's next? The road ahead for investors",
    "body": "Nifty 50 at 17,500 level! What's next? The key benchmark Indian stock market index, Nifty 50 is swinging at an unprecedented 17,500 levels (approx.) and the free-float market-weighted stock market index, Sensex breached the elusive 55,000 marks recently. The Indian stock markets witnessed the Bull Run and massive rally for the first time ever, and it may make a record of new levels every day. Keeping all this in mind, it becomes extremely important for an investor to do a fundamental check about whether all these unprecedented runs are being supported by basic data or not, and how much strength do these levels possess? Ravi Singhal, Vice Chairman of GCL Securities Private Limited, suggests that there is no need to worry about a higher level of these stock market indices because the price of any stock or index is always a reflection of its earning base. \"All of us are well aware of the fact that the pandemic has hit the earnings of businesses very badly. Hence, now when businesses are bouncing back into financial action, the earnings of almost every company is improving in their quarterly results,\" he said. While looking at the consolidated earnings of Nifty 50 companies, it was at almost Rs 358 per share, average in August 2020, and has been continuously improving since then. The same figure was at an average of Rs 446 in April 2021 and Rs 607 in August 2021. \"Therefore, if we look at the PE data of this year, it is continuously on a decline, even though the key indices are touching new levels,\" he said. Keeping in mind the above-cited data, now, a big question emerges here - Is it worth buying in Nifty 50 at 26.25 P/E? To answer this, we have to look into some of the key facts here:- 1. Historical P/E:FY 2020-21 was an exception, therefore we cannot take the data of this year into consideration while calculating the average. However, if we look at historical data of the past 5 years before FY'21, the Nifty 50 P/E average was 24.78 from the beginning of FY 2015-16 till the end of FY 2019-20. Therefore, at 26.25 level it is almost 6% higher than last 5 years average. 2. Nifty 50 P/E calculation:As we know, NSE has changed the calculation method for Nifty 50 P/E. Now it is calculated on the basis of consolidated earnings of all the companies instead of standalone P/E. This calculation has changed P/E data significantly. It is important to note here that after that this calculation change came into effect, Nifty 50 P/E immediately came at 33.2 on 31st March 2021 from 40.43. 3. Future growth:If we evaluate the P/E of any company or any of the indices, we must look at the future earnings expectations as well. Current higher P/E may be a result of market expectations of higher earnings in the future. Conclusion:P/E is the most important factor for market strength analysis and it is running higher than its 5 years average. It may be the result of the market expectation of higher earnings growth of Nifty 50 companies but at the same time, we also expect that earnings will improve further as the festive season will perform well and the monsoon is going good all over India. Finally, long-term investors who have 3-5 years of investment horizon should not fear at all from the levels of 16,500 and 55,000 of Nifty 50 and Sensex respectively.",
    "url": "https://www.indiatvnews.com/business/markets-nifty-50-at-17-500-level-what-next-for-investors-indian-stock-market-growth-733040",
    "original_url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOY3FCZzI0Nl94THlvd1ltM3Vlb2duaFVCYmFmUkJaWE9rY240VWRxQmtTdUczNGdkOTlDZms3aTVxMU0taVFxU19pakdXLUV1VGJaNW5UcnpXR01ScVVSTDZVUXR5OHduMDZrekF4bWRDOXFxWENjM0NVbFdETU1lRXRnaG5TdU5xdU81WGVlSEVrSmdubXVrWU0za2hIMFZTN09HTG44bzVYbW9fa1NoUjhnUEpfbDFDalZWNGlDWjBOR3NpY3fSAcsBQVVfeXFMTTh4TEdrVXp1bExFZG1EZFFmbnZzbTF4Q0ZlNE5ubHh4NDVYVEYwNjdoTTFOOE9jd2JGYmFmWENJaFlYQW5KcFZUbHZmODBYRU9XdmNSeG15bkVhRFJxQjM5c0JieENlb0ZhbFlnZkRPUmM4N1Vfc0oxSWZndi02Zk9Xd1htWDcyN1dyY0dLcS15Z3FZaUt2ckd1Z25NQlhqR3gtQ1BVUzBHM21PMHpXZmdfRUM4MXVrU2RkOVpacTBoQjFHeEg1UTlrbFE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3287,
    "word_count": 577,
    "gnews_title": "Nifty 50 at 17,500 level! What's next? The road ahead for investors - India TV News",
    "published_date": "10/09/2021",
    "publisher": "India TV News",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Yahoo Finance",
    "body": "Rs 7 lakh invested in Nifty50 today can make you double crorepati by 2051 Amitabh Tiwari · Columnist 28 July 2021 3 min read by Taboola by Taboola You May Like Sobha Town Park on Hosur Road. Luxury 2 & 3 BHK Near Electronic City Metro. Pay 20% Now! Sobha Townpark • Ad Ad Learn More Undo The Nifty50 turned 25 this year on April 22. It started with a base of 1,000 and is currently trading at 15,867. In its 25-year-long journey, the index has risen almost 16 times its original base. In terms of returns, it has generated returns of around 11.5% per annum for the past 25 years. On the other hand, the BSE Sensex launched in 1979, completed 42 years this year in April. It has generated returns of around 16% per annum for the past 40-plus years. These are no mean achievements. Just Rs 20,000 invested in Sensex in 1979 when it was launched would have made you a crorepati today. Rs 7 lakh invested in NIfty50 in 1996, when it was launched, would have made you a crorepati today. This is the power of compounding, the benefit of staying put and investing with a long term view. Many people who invested similar amounts or higher could have fulfilled their milestone goals like daughter’s marriage, children’s foreign education or retirement. Indian markets, like other global markets, are on a roll since recovering from a crash precipitated by the pandemic last year. Rising cases globally and spread of delta variant, high inflation, and other fears are being ignored by the markets. Indian markets have doubled from levels seen in March last year. In the last one year, Indian markets have generated the 3rd highest returns worldwide. Liquidity, and lack of other profitable investment avenues have made equities most sought after. More than a crore new demat accounts have been opened in the last year. With interest rates on fixed deposits low (around 5.5% for 5 year FD), inflation high 6%+, investors are making negative real returns on term deposits. The real estate market is in a flux. In metros rents have fallen sharply after the lockdown as employees moved back home. Despite the devastation caused by the pandemic, Indian economy has bounced back strongly with GDP growth of 1.6% in Q4 of the financial year (FY) 2020-21. IMF projections for FY 2021-22 suggest India would again become the world's fastest-growing large economy. The growth story for India is intact and we are in a multi-year bull run cycle as projected by many experts like Rakesh Jhunjhunwala, Raamdeo Agarwal and others. The Sensex could touch 200,000 points in the next 10 years, according to Raamdeo Agrawal on account of favourable factors like steady economic growth over the last few years and key indicators such as democracy, demography, digitisation, dollar reserves, and a stable government. This translates to a per annum growth of 15% which is still 1% lower than what Sensex has achieved till date. Story continues According to ace investor Rakesh Jhunjhunwala , India is on a roll and the stock market will continue to boom. He expects Nifty50 to touch 100,000 points by 2030. This translates into a 20% per annum return which is very bullish in my opinion. A Times of India analysis on 30 years of economic reforms projects the Sensex to reach 100,000 points by 2027 and 1,500,000 by 2051! Both these projections are attainable as they assume an annual growth of 12%, which is equal to historical growth returned by Nifty50. This means that Rs 7 lakh invested in the markets today — Nifty50 or Sensex — could fetch you Rs 2 crore by 2051. You could then become a double crorepati in the next thirty years by the time you retire by investing merely Rs 7 lakh. Disclaimer: This is not an investment recommendation and readers are expected to do their own research or consult their investment advisor before making any investment decisions. DON’T MISS: The 5 highest paid private sector bankers in India PPF: Do this and you can become a crorepati Have jewellery in locker? Buy insurance as banks not liable for loss From Ambani to Tendulkar, how educated are these famous people? India is ranked 6th by GDP and 3rd by GDP on PPP basis: How and Why? Retirement fund: how much do you need & how to much to save The Tokyo Games: Detailed Coverage Terms and Privacy Policy Privacy dashboard",
    "url": "https://sg.finance.yahoo.com/news/rs-7-lakh-invested-in-nifty-50-today-can-make-you-double-crorepati-by-2051-032032884.html",
    "original_url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOX0s4bklxajRUQm1mcUk3MGwtd3VSaklKODV0VEZDZ2k2OE9jRDlHNXVRTVp5Mm05TnU0cEdnOWc5VDVhemlsVXhJeFJKbS1Vb1JMeGhyNHBmZ0JvVFJBTW5TaXdJdGJCZTlYcVZCc3B2SW5uRUxRQ0lqTGhSM181WjRJUXZiQ2h2d0E5VHNiY3o1emNYYlVXdXdtYWp5bVVQOTkxWDVpdDZFOHFtb2k5RUNEVjJMZXJzMWN4V2ZrZDg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4284,
    "word_count": 745,
    "gnews_title": "Rs 7 lakh invested in Nifty50 today can make you double crorepati by 2051 - Yahoo",
    "published_date": "27/07/2021",
    "publisher": "Yahoo",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex tanks 3%, Nifty sub-13,350; bears take control of markets on virus scare",
    "body": "Welcome to the Mint live blog. Track this space for the latest stock market updates. Indian benchmark equity indices--Sensex and Nifty--fell 3% each on Monday, snapping six days of gains, as investor appetite soured following reports of a new deadly strain of the coronavirus in the UK. The Sensex slumped 1406.73 points or 3% to close at 45,553.96 while the Nifty ended 432.15 points or 3.1% lower at 13,328.40. About 580 shares advanced, 2,381 declined, and 163 shares were unchanged. All Nifty sectoral indices tanked 2-7% each while broader market indices Nifty Smallcap100 and Nifty Midcap100 fell 5% each. The BSE lost over₹7 trillion in market capitalisation today. The Indian rupee, meanwhile, ended 21 paise lower at 73.78 per dollar amid selling pressure in domestic equities. Oil prices tumbled by $2 on Monday, as a fast-spreading new strain of coronavirus that has shut down much of the UK and led to tighter restrictions in Europe sparked worries about a slower recovery in fuel demand. Brent crude was down $2.06, or 3.9%, to $50.20 a barrel, and U.S. West Texas Intermediate (WTI) crude was down $1.95, or 4%, at $47.15 a barrel. As a measure of abundant precaution, passengers arriving from THE UK in all transit flights (flights that have taken off or flights which are reaching India before 22nd Dec at 23.59 hrs) should be subject to mandatory RT-PCR test on arrival at the airports concerned, the civil aviation ministry said in a tweet. M&M says SsangYong files for commencement of rehabilitation procedure with Seoul Bankruptcy Court. It has also applied for autonomous restructuring support (ARS) programme. Seoul Bankruptcy Court will deliberate and review the application. If the Court approves the ARS, SYMC will continue to function under the supervision of its Board and will negotiate with stakeholders to reach an understanding about a revival package which may include equity and debt financing and other related actions. However, some of its decisions will be subject to Court approval. SpiceJet Ltd and IndiGo promoter InterGlobe Aviation were down over 4% each on Monday on reports of countries banning flights from the UK following the discovery of a new deadly strain of coronavirus. Oil fell toward $47 a barrel -- after posting a seventh weekly gain -- on concern a mutation of Covid-19 discovered in the U.K. could speed transmission of the virus and lead to more lockdowns. Futures in New York dropped around 3% after closing at the highest in almost 10 months on Friday. Housing sales across seven major cities are expected to fall 47% year-on-year to 1.38 lakh units this year on lower demand because of the covid-19 pandemic, according to property consultant Anarock. New housing supply, too, is likely to fall 46 per cent to 1.28 lakh units in 2020 in seven cities -- Delhi-NCR, Mumbai Metropolitan Region (MMR), Pune, Bengaluru, Hyderabad, Chennai and Kolkata. (Read here) Gold surged on Monday as reports of lockdowns in the UK soured appetite for riskier assets and added to the metal's support. AstraZeneca Pharma stock up by 1.3% on receiving Import and market permission for asthma drug in India. Benralizumab (Fasenra™) is indicated as an add-on maintenance treatment for severe asthma with an eosinophilic phenotype in adult patients. The receipt of this permission paves way for the launch of Benralizumab (Fasenra™) in India, subject to the receipt of related statutory approvals and licenses. This is very positive development for the AstraZeneca and this drug launch will help company to increase contribution from domestic business. Indian rupee erased some of early losses but still traded lower at 73.68 per dollar, amid volatility in domestic equities. The unit had opened 18 paise lower at 73.75 per dollar compared with Friday's close of 73.57 per US unit It has been more than a year since India’s banking regulator initiated insolvency proceedings against a broke housing finance company mired in governance controversies. The saga of Dewan Housing Finance Corporation Ltd’s (DHFL) insolvency procedure has been intriguing over the past one year. The task to find bidders had looked challenging initially and bankers having exposure to DHFL felt resigned to large haircuts in the beginning. Lenders have already made sizable provisions against the account assuming haircuts in excess of 50%. The plight of thousands of fixed depositors also hung in balance. (Read here) Cement prices in eastern India continued to suffer in December on rising supply. Even as demand has been showing signs of recovery, it is yet to reach a level where this massive supply can be absorbed without hurting prices. Dealers channel check by Nirmal Bang Securities Ltd showed that prices in the region on an average fell to₹274/bag in December from₹296/bag in November. One cement bag weighs 50 kilograms. At an all-India level, prices fell to₹334/bag from₹344/bag during the period. (Read here) Delhi High Court on Monday dismissed India's Future Retail's plea that sought to restrain its partner Amazon.com Inc from interfering in its $3.4 billion asset sale deal with Reliance Industries, Reuters reported. Amazon is locked in a bitter legal dispute with Future Group, which in August sold its retail assets to Mukesh Ambani-led Reliance Industries. The deal breaches agreements made in 2019 by Future, according to the U.S. online retailer. In October, Amazon had won an injunction to halt Future's deal with Reliance from a Singapore arbitrator both sides had agreed to use in case of disputes. Future later said the order was not binding, prompting Amazon to lodge a complaint with India's market regulator. Amazon cannot be barred from writing to regulators on account of potentially irreparable damage, Justice Mukta Gupta of the Delhi High Court said in the verdict. On Friday, Nifty started the session marginally positive around 13760 but it corrected in the first hour of the trade by more than 100 points from the opening level. However, it found support near the 13650 mark and recovered gradually to end the day near the opening level. Just like the recent past, once again we witnessed upmove in the indices from intraday dip and Nifty managed to end the week at its all time high. However, the banking index has been reluctant to participate during this week and thus has shown some relative underperformance. Although there are no signs of reversal yet on the chart, Nifty is currently trading near an important resistance of 13770 which is the 127% retracement of the previous correction on the weekly charts. Since the momentum readings are in overbought zone and the index is trading near its resistance, there could be some time-wise or a price-wise correction in the near term. As far as levels are concerned, 13650 and 13600 are the important supports whereas 13770-13800 is the important resistance zone. Traders are advised to look to book some profits on their existing longs here and trade with a stock specific approach with a tab on the above mentioned levels. The₹300 crore IPO of Antony Waste Handling Cell opened for subscription today and the issue will close on 21 December. The issue follows the whopping investor response to Burger King and Mrs Bectors Food IPOs earlier this month. Antony Waste Handling Cell is a leading player in solid waste management services in the country. Glenmark Pharmaceuticals Ltd has received tentative approval from the US Food & Drug Administration (US FDA) for Dabigatran Etexilate Capsules, 75 mg, 110 mg, and 150 mg, the generic version of Pradaxa®1 Capsules, 75 mg, 110 mg, and 150 mg, of Boehringer Ingelheim Pharmaceuticals, Inc. According to IQVIATM sales data for the 12 month period ended October, Pradaxa® Capsules, 75 mg, 110 mg, and 150 mg market2 achieved annual sales of approximately $550.9 million. The Nifty is keeping above the crucial 13700 levels. If we can continue doing that, the markets should be headed to 14000. A strong support lies at the 13500-13600 levels and as long as that holds, the trend of the index remains bullish and traders can utilise any dip to accumulate long positions. Oil fell below $48 a barrel in Asian deals -- after posting a seventh weekly gain -- on concern a mutation of Covid-19 discovered in the U.K. could speed transmission of the virus and lead to more lockdowns. Futures in New York dropped 3% after closing at the highest in almost 10 months on Friday. More than 16 million Britons are now required to stay at home as a full lockdown came into force in London and the southeast of England, with some European countries limiting travel with the U.K. A stronger dollar also reduced the appeal of commodities that are priced in the currency. AstraZeneca Pharma India has received import and market permission in Form CT-20 (Marketing Authorization) from the Drugs Controller General of India for Benralizumab 30mg/mL solution for injection (Fasenra), the company said in a filing to the exchanges. Benralizumab is indicated as an add-on maintenance treatment for severe asthma with an eosinophilic phenotype in adult patients. The Centre is likely to invite bids for privatising Shipping Corporation of India this week and buyers will have time till mid February to submit EoIs, an official has said. The government plans to divest its entire 63.75% per cent stake in the entity along with transfer of management control. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/live-blog-sensex-nifty-live-today-21-12-2020-nifty-nse-bse-news-updates-11608517153097.html",
    "original_url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQMnVpb0ZFNFEycFljUEtYcmlzTTBtSEpXSWt5X0pYUkdXVk00M3BhREtlZVpVeGk0eUh0cS1acGtPSmZ6M1I1TkVWYWo3aHNseHljSm5teHpZZTA1ZzRnT2FOOTZhcTQwR2VuYktKZFFqajI2VDBkY3VMUkRxQVl5cWR1c2VGMy1IWGhGcTQxck5qdUVFRU1xdVpnTmpaQzdDVVJKY0FhUi00bE5JVXJXUktNTWNlVlpDc3BHYWVpSV9tTmtlbjcyb3VaQzNTeThMeWU5VlNSWWbSAd4BQVVfeXFMTVMwNy1lNDZIY0RiZFpYM25vX0xrNEJFcnh3SUd5dFJwejFQNjBaVjZ6NmFIa3E1LTd3bUtPQWlGejI2anZsMkVWREw5NkNsbFgxbzl1NVNHd3gwS09iNzFvcWRQaWtHaWpPYk44NXVaYlY5ZFZRUWhvU0VMRC1WQ0ZIblNfMGt5eW1CN3d6akt4bUxOeDgybXE3MUYyaTRZUnQ2c3c4QWxWODRTclMzSFZCd20yOU5OQW1MTzNGM09NQ2liQ3JEal9INHFORUtrLVRjN05YNE1zcG5LRm1R?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 9611,
    "word_count": 1571,
    "gnews_title": "Sensex tanks 3%, Nifty sub-13,350; bears take control of markets on virus scare - Mint",
    "published_date": "21/12/2020",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "India's Nifty 50 hits all-time high; energy, IT stocks jump",
    "body": "Gardeners work outside the National Stock Exchange (NSE) building in Mumbai, India, August 16, 2018. REUTERS/Francis Mascarenhas/File Photo Purchase Licensing Rights , opens new tab BENGALURU, June 3 (Reuters) - India's Nifty 50 hit a record high on Thursday, boosted by energy and information technology stocks, with investors eyeing the central bank's policy meeting outcome later this week where it is expected to keep rates at record lows. The blue-chip NSE Nifty 50 index (.NSEI) , opens new tab rose 0.54% to 15,656.20 by 0404 GMT, while the benchmark S&P BSE Sensex (.BSESN) , opens new tab gained 0.55% to 52,134.62. Get the latest news from India and how it matters to the world with the Reuters India File newsletter. Sign up here. The Reserve Bank of India's (RBI) monetary policy committee (MPC) will likely keep the key lending rate or the repo rate (INREPO=ECI) , opens new tab unchanged at 4% for a sixth straight meeting, holding at record lows. read more Conglomerate Reliance Industries Ltd (RELI.NS) , opens new tab and software services giant Infosys Ltd (INFY.NS) , opens new tab were among the top boosts to the Nifty 50, gaining 1.5% and 1.1%, respectively. Shares of Reliance have risen for six straight sessions. Meanwhile, the country continued to see a decline in daily COVID-19 cases, with data from the health ministry showing 134,154 fresh infections in the last 24 hours. Its total tally now stands at 28.4 million. Advertisement · Scroll to continue In the broader Asian markets, shares were a touch below a recent three-month high, with China a tad weaker as investors weighed inflation concerns ahead of key U.S. economic data. Reporting by Rama Venkat in Bengaluru; editing by Uttaresh.V Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Read Next 4 hours ago India category India central bank holds rates, leaves room for December cut 1 hour ago Sustainability category Spooked by AI, Bollywood stars drag Google into fight for 'personality rights' 5 hours ago India category India's September manufacturing growth cools as price rises soar to 12-year high, PMI shows 30 mins ago India category Indian benchmarks snap losing run on cenbank lending boost 4 hours ago India category India set for $8 billion IPO rush in year-end blitz 6 mins ago India category India says highly unlikely that UN peace forces will be deployed in Ukraine, Gaza",
    "url": "https://www.reuters.com/world/india/indias-nifty-50-hits-all-time-high-energy-it-stocks-jump-2021-06-03/",
    "original_url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxObmNVNHFJdDBoaTlTbWlKTG5PSF9xOEt3UEM2VXQwc05rdTgtVkZpUVRyNm1DVndSbEVienlMNU9OcC1pdEh5VFU3WlpsczltX0dmY25iWFROOFdCTDVKQTUtN1dHUEVQZWJwUzhZZnZsR21yQkVEenRTSGVfR3E5d1JnMW5fUTZIYldHNjk2dkZIbWxzcTZFOXl1eGo4a1J5Y01wX3pNWQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2458,
    "word_count": 406,
    "gnews_title": "India's Nifty 50 hits all-time high; energy, IT stocks jump - Reuters",
    "published_date": "02/06/2021",
    "publisher": "Reuters",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Market Highlights: Sensex rises 69 points, Nifty ends at 17,380; Media stocks rally",
    "body": "Bombay Stock Exchange building. (Express archive photo) Share/Stock Market Highlights: The frontline equity indices on the BSE and National Stock Exchange ended with marginal gains on Tuesday. The S&P BSE Sensex rose 69.33 points (0.12 per cent) to end at 58,247.09, while the Nifty 50 inched up 24.70 points (0.14 per cent) to settle at 17,380.00. Earlier in the day, the Nifty had hit a fresh lifetime high of 17,438.55. Story continues below this ad IndusInd Bank, HCL Technologies , Bajaj Auto , Tech Mahindra , Larsen & Toubro (L&T) and Kotak Mahindra Bank were the top gains on the Sensex pack while Nestle India , Ultratech Cement, Hindustan Unilever (HUL), Housing Development Finance Corporation (HDFC), Tata Steel , Bajaj Finserv were the top laggards. Among the sectoral indices, the Nifty Media index was the top gainer of the day surging 14.40 per cent higher led by a 40 per cent rally in Zee Entertainment Enterprises . This apart, the Nifty Private Bank index gained 1.03 per cent led by Yes Bank, IndusInd Bank and IDFC First Bank. In the broader market, the S&P BSE MidCap ended at 25,053.67, up 270.22 points (1.09 per cent) while the S&P BSE SmallCap settled at 28,042.45, up 176.31 points (0.63 per cent). (with inputs from agencies) Live Blog Stocks, BSE Sensex, NSE Nifty, Crude oil prices, gold, silver prices, commodity market and money markets LIVE updates: 16:21 (IST) 14 Sep 2021 Rupee at close The rupee settled flat at 73.68(provisional) against the US currency on Tuesday in tandem with the muted trend in domestic equities. At the interbank foreign exchange market, the local currency opened at 73.62 and witnessed a low of 73.70 and an intra-day high of 73.57 in the day trade. The domestic unit finally settled at 73.68 against the greenback, unchanged from its previous close. (PTI) 15:45 (IST) 14 Sep 2021 Equity markets at close The S&P BSE Sensex ended at 58,247.09, up 69.33 points or 0.12 per cent, while the Nifty 50 settled at 17,380.00, up 24.70 points or 0.14 per cent. 12:47 (IST) 14 Sep 2021 Indiaâ€™s WPI inflation spikes to 11.39% in August: Govt data The wholesale inflation across the country rose to 11.39 per cent in August, the data released by the Ministry of Commerce & Industry showed. The wholesale price index (WPI) grew 11.16 per cent during the month of July, while the WPI for June was 12.07 per cent, the data showed. The WPI in August 2020 was at 0.41 per cent.",
    "url": "https://indianexpress.com/article/business/market/equity-commodity-money-markets-live-updates-stocks-shares-bse-sensex-nse-nifty-rupee-crude-oil-gold-silver-metals-prices-september-14-7505391/",
    "original_url": "https://news.google.com/rss/articles/CBMinAJBVV95cUxQcFE2WmxQVUE5TV9YRFRYSG5MRHM5YWhDeGVYT1RkaFM4UWlrVjJCQzBGZ29rMF9JdkVEb1BMZlZBN3lidFl6STNMNTlENW9MaUZKZWpMUC1zTUdJMGpaajM2elFra2ZuV1lkODZuaHVYNDNMaUZVRU9qWmZfbXNlUG1BZ1FnR2J2blpTU1FSR0xnYU5UckIzN0Y4bTc1MGQ0ZTRvQmRZQnJFenV1OTlyNG02ZzNYU1ZBMjZjdmpfQnppSkp4QW5Pcm9aYTBuZWJqLU83ZnVLUWRmcnNXREhfZ2xRaUZEZjVDT25tcGd4d25lYWIzdU9NLUVBdWZ2T192cGJjWFMxNU5zV2cteHJEdkhVd2VlTVdMZE41RdIBowJBVV95cUxPb1VqdTEzMVJOX2JXOEhVV2o3bzNaMS1hLTRoRXBkLXZkN2h0OE53N20xRmI3ZXBGd2c1UXRhU2U4dWNwUEZoS0dIbjJuTDVUbkhzeWx1TGxib0FFR1NkcG9mT3Y2dDROSjZaenlBTDI3VTYxVzNzOTlzQnU2MmYtZ0RBczFYVFNRZXpWOHZ1T0p2U0dBM1ltTEF1Mk12TzhhaHV2RF9aWmlkR1B6LW5USEpQcDBPbW1hTmE3WUJNOGhEay1VUWFwQVd1ZzNaejFmaVhaX21mVHlreGlZRVhlOG0tSTBKRFFsdjFnTmUwWVJzMk1Mc0o0SXhIUlVKX0x5LUp5Q1VlbHo1b1pTMjhCMjIxVzlaYW5kMTVaaWxLY3FabEE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2424,
    "word_count": 418,
    "gnews_title": "Market Highlights: Sensex rises 69 points, Nifty ends at 17,380; Media stocks rally - The Indian Express",
    "published_date": "14/09/2021",
    "publisher": "The Indian Express",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty at a high, but only 11 stocks are at record levels: A warning or an opportunity?",
    "body": "The Nifty50 hit the magical 15,000-mark early this month and hit a fresh record high of 15,257 on February 9 but only 11 stocks in the index have reached their record highs, so far, in the month. It should not come as a surprise as most stocks are still playing catch up. The 11 stocks that hit their lifetime highs include Adani Ports, Bajaj Auto, Bajaj Finance, Bajaj Finserv, Cipla, HDFC Bank, SBI and UltraTech Cement, data from AceEquity shows Nine stocks like Tata Motors, M&M, L&T, Sun Pharma, ITC and Power Grid Corp are trading at 52-week highs. The rally, which we saw in 2020 and is continuing in 2021, lifted most of the largecaps names in the index but there is plenty of upside still left in many stocks, experts say. “Many stocks are showing that they can lead from here or take rally further such as in FMCG –ITC. In pharma, Lupin and Sun Pharma. In IT, Infosys can lead from here compared to TCS. In banking, SBI. So, there are plenty of stocks in which upside is left and could well turn out to be leaders,” Ravi Singhal, Vice Chairman, GCL Securities Limited, told Moneycontrol. “In terms of Nifty target, we see the index heading towards 17,600 in the base case scenario in 2021, and in the best case, it could well hit 18,900 while in the worst-case scenario, the index could be around 15,900,” he added. The Nifty that closed above the psychological mark of 15,000 on February 8 has come a long way after it was launched in April 1996, when it traded at 1,107, with the base year of November 1995 set as 1,000. The Nifty50 took nearly 18 years to reach 7,000, the next 8,000 points come in 6.8 years, Motilal Oswal said in a report. The Nifty 50 Index constituents make up roughly 58 percent of the total India market cap. If we look closely, the sprint to 15k from pandemic lows of 7,600 in March 2020 has taken just 220 days. The sharp recovery has been driven by a global liquidity backdrop, better containment of COVID-19, sharp recovery in corporate earnings and a market-friendly Budget, said the Motilal Oswal report. \"There is plenty of upside still left on the Nifty 50 names. We are looking forward towards 16,308-16,848 to 17,200 for the Nifty50,\" Sacchitanand Uttekar, DVP–Technical (Equity), Tradebulls Securities, told Moneycontrol. Jashan Arora, Director at Master Capital Services, told Moneycontrol that if the Nifty50 move above 15,500, the next target will be in the range of 16,200-16,400 in 2021 Multibaggers: What should investors do? There are 16 Nifty50 stocks that have risen 100-400 percent since April or so far in FY21, data from AceEquity showed. Stocks that more than doubled investors’ wealth include names like Tata Motors, M&M, JSW Steel, Bajaj Finance, HCL Technologies, Hero MotoCorp, Bajaj Auto, and Cipla. Data suggests that stocks that have more than doubled investors’ wealth since March belong to economy-linked sectors, finance as well as IT. After the recent run-up, investors can look at booking partial profits but the long-term investment argument still remains intact. “Out of the 16 names, one can book profits in the following stocks as they are close to our revised price targets and also trading closer to their peak valuations: Adani Ports, Bajaj Finance, Bajaj Finserv, Bajaj Auto, Shree Cement and Ultratech Cement,” Rusmik Oza, Executive Vice President, Head of Fundamental Research at Kotak Securities told Moneycontrol. “We are still bullish on the banking stocks like HDFC Bank, ICICI Bank and SBI. We also like Cipla and Bharti Airtel from a one-year perspective,” he said. Uttekar of Tradebulls Securities said that the stock hitting fresh high with volumes is a good sign, which highlights the willingness of participants to buy quality irrespective of the higher pricing. “Investors should continue to hold these stocks & maintain a trailing stop strategy based on larger degree time frames,” he added. The stock market is more about investing in the future prospect of companies and sectors. The Budget 2021 promised capex in sectors such as infrastructure, healthcare, Make in India as well as real estate. Financial services remain the top pick. “Many companies in Nifty50 which have doubled wealth continue to have strong fundamentals and growth prospects. If anyone had invested in these companies in March 2020, they had entered at one of the best times. Despite these companies giving fabulous returns in one year, investors should continue to hold them,” Harshad Chetanwala, Co-Founder- MyWealthGrowth.com told Moneycontrol. “If required one can look at trimming as part of these companies and book profits. At present, it is will be good to hold on with these companies for some more time as a pro-growth Budget after a difficult year, the pace of recovery in economic activities, and reasonable success of COVID vaccination can add more fuel to India’s progress,” he said. Most of the sectors gave positive return in 2020 and with the Budget, which has something or the other for each and every sector, they will not disappoint investors. Hence, picking largecap names which are sectoral leaders will be a safe strategy for investors in 2021, experts say. Given the recent run-up seen in most names, some consolidation cannot be ruled out. But, the long term trend still remains intact. “All the sectors have rallied we can assume that there is not much upside in short term but since the longer-term trend is intact, we may see strong moves post consolidation or corrections in the index,” says Arora of Master Capital Services. Ideally one should focus on booking partial profits in the stocks they hold but it was important to remain invested, he said. \"It is quite probable that India is on the cusp of a multi-year economic expansion cycle. If this pans out, the bull market will sustain and grow stronger. So remain invested in quality stocks in performing sectors,” he said. Disclaimer:The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. Discover the latestBusiness News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated! Festive dhamaka for online sales: Rs 60,700 crore in first week; Govt to ensure consumers benefit from GST cuts | MC Editor's Picks Find the best of Al News in one place, specially curated for you every weekend. Stay on top of the latest tech trends and biggest startup news. You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/nifty-at-a-high-but-only-11-stocks-are-at-record-levels-a-warning-or-an-opportunity-6477801.html",
    "original_url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxNTU13eEtscVBiR1E0TVAwOVhLSVF6aTZ4MU82anhRYnpuYkVfd0wyQkNoekx0NU5Xcm1jM0oxeS1hWWw5dXJEeHhYa0JJTHZSdWRYSGlKa3U4Mjd2UHVoN0o0OGQwWTVNT2MtV3hlQjlEa2otbjIzejlGM2RBT2hBZlBsc3padl9wUldnUGNNR1RsREgyVVBqcXhWbi0wczUwMFR3M0VyRWU4ZWFvQl9Gb05jSDhSY21jSHN0ZW1jVzZuXzlkTUVzUnJkME83SmFCZzZEVXd2TU01b3NwaGRXT9IB5gFBVV95cUxQZDJ3RzZVTEdUMEljQ3ZTSVJOU21XSF9xWmNULVhXOUtJa2trZ2JHQmhsYS1nSzhTZlhpMnFKWlFfUDBTRDgweUw3MjRGSkllUXdmNkRVMDByMFVhVlFxQUw5am1fVUtDcjJKUVdTbGhfVzFLeWYxengtbkVsdmsxN0UyYUwtM2ZfRVR3ckNMQ2FvU1dpOE9QMkpuRzlkWkQ2UVd1V0I0RW11VEN3Qk5KOXJ2eG1JQmhKRnYwcTdVTWV4VDUzcGFhV3F4WEdEQ3hUdkJ5bkpnUk1RaFRUWWlUX3pLU2JYUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6623,
    "word_count": 1099,
    "gnews_title": "Nifty at a high, but only 11 stocks are at record levels: A warning or an opportunity? - Moneycontrol",
    "published_date": "12/02/2021",
    "publisher": "Moneycontrol",
    "topic": "Nifty 50 stock market India"
  }
]