[
  {
    "title": "Financials help Indian shares extend gains to new highs",
    "body": "A general view of the Bombay Stock Exchange (BSE), after Sensex surpassed the 50,000 level for the first time, in Mumbai, India, January 21, 2021. REUTERS/Francis Mascarenhas/File Photo Purchase Licensing Rights , opens new tab BENGALURU, July 4 (Reuters) - India's blue-chip Nifty 50 index advanced for a sixth session in a row on Tuesday, as gains from financials and sustained foreign inflows helped offset a bout of profit-taking. Both the Nifty (.NSEI) , opens new tab and the S&P BSE Sensex (.BSESN) , opens new tab hit record highs for a fourth consecutive session before briefly paring gains as investors booked profits. The Nifty 50 has risen 3.88% in six sessions, while the Sensex has gained 3.98% in five. Make sense of global markets with the Trading Day newsletter. Sign up here. The benchmarks recovered, with the Nifty 50 climbing 0.34% to a record closing high of 19,389, while the Sensex gained 0.42% to settle at its all-time closing high of 65,479.05. \"India remains the preferred destination for investments as reflected by strong foreign inflows in the past few months,\" according to Jahnavi Prabhakar, economist at Bank of Baroda. The concerns over slow post-Covid economic recovery in China have also led to foreign inflows into India and Japan, she added. Advertisement · Scroll to continue Foreign portfolio investors (FPIs) have bought , opens new tab Indian equities worth 1,144.67 billion Indian rupees ($13.96 billion) on a net basis in fiscal 2024 so far. In contrast, FPIs sold equities worth 1,400.10 billion rupees and 376.32 billion rupees in fiscal 2022 and 2023, respectively. Eight of the 13 major sectoral indexes logged gains, with high-weightage financials (.NIFTYFIN) , opens new tab adding 0.79%. Banks (.NSEBANK) , opens new tab gained 0.32% to close at a record high and public sector banks (.NIFTYPSU) , opens new tab rose nearly 2%. Advertisement · Scroll to continue Non-banking finance company Bajaj Finance (BJFN.NS) , opens new tab led the rise in financials, jumping over 7% after reporting a 34% growth in new loans for the June quarter. Analysts also listed growth in GST collections , expansion in June manufacturing activity and easing monsoon deficiency as key factors behind the momentum. Among individual stocks, Hero MotoCorp (HROM.NS) , opens new tab rose 4.52% on the launch of a co-developed Harley Davidson bike. Advertisement · Scroll to continue However, Eicher Motors (EICH.NS) , opens new tab , which makes the Royal Enfield bike, fell 6.31% due to fears that the new Harley X440 would eat into its market share. Bharti Airtel (BRTI.NS) , opens new tab lost 1.59% after Reliance Jio, owned by Reliance Industries (RELI.NS) , opens new tab , announced the launch of a 4G-feature phone priced at 999 rupees. ($1 = 82.0073 Indian rupees) Reporting by Bharath Rajeswaran in Bengaluru; Editing by Dhanya Ann Thoppil, Savio D'Souza and Janane Venkatraman Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Read Next 1 hour ago Asian Markets category Sriwijaya Capital raises over $200 million for debut fund, eyes $300 million cap, sources say 2 hours ago Asian Markets category Kumpulan Wang Persaraan targets 30% private market allocation in 5 years 5 hours ago Wealth category Asia draws $100 billion in capital as investors diversify beyond US, Goldman executive says 5 hours ago India category India's September manufacturing growth cools as price rises soar to 12-year high, PMI shows 1 hour ago Business category Oil pauses as markets assess OPEC+ plans, demand concerns 5 hours ago VIEW India central bank keeps repo rate steady as widely expected",
    "url": "https://www.reuters.com/markets/asia/indias-nifty-50-sensex-set-flat-open-2023-07-04/",
    "original_url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQb083UlJoU0lJNWFDRURza0Zjd28zUi1QQUVmWGthT0I3MHZPMDRGQ216ZVZ2VHFreGF2a192WGRRS0xlTjRnOHNXRG5TWGoyTTZUelNPS0dmRF9Gajh6QlZiNjl6cS0wMXFPSDFCNkFkSi1oaEQwd2pzTDlISnVuUlNfMWNDNnJnN3BVM21R?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3698,
    "word_count": 603,
    "gnews_title": "Financials help Indian shares extend gains to new highs - Reuters",
    "published_date": "04/07/2023",
    "publisher": "Reuters",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Sensex, Nifty 50 end volatile session lower, financials drag",
    "body": "Stock Market Highlights: Sensex, Nifty 50 end volatile session lower, financials drag Share Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty 50 ended lower, after oscillating between the red and the green during the session on Wednesday. The indices opened lower earlier in the session. At the last count, the Sensex ended 200 points lower, and Nifty 50 below 18,300. Losses in the financial and metal shares led the headline indices lower, while FMCG and healthcare stocks ended in the green, limiting the downside. Hindalco and Cummins posted their quarterly numbers during the session. NALCO is due to post its earnings later in the day. The Nifty 50 and Sensex ended flat amid volatility on Tuesday. By Asmita Pant May 24, 2023, 3:56:53 PM IST (Updated) 1 Min Read Share Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty 50 ended lower, after oscillating between the red and the green during the session on Wednesday. The indices opened lower earlier in the session. At the last count, the Sensex ended 200 points lower, and Nifty 50 below 18,300. Losses in the financial and metal shares led the headline indices lower, while FMCG and healthcare stocks ended in the green, limiting the downside. Hindalco and Cummins posted their quarterly numbers during the session. NALCO is due to post its earnings later in the day. The Nifty 50 and Sensex ended flat amid volatility on Tuesday. Catch highlights of the May 24 session here: Continue Reading First Published: May 24, 2023 7:54 AM IST Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags india stock market nifty sensex",
    "url": "https://www.cnbctv18.com/market/stock-market-live-updates-share-nifty-sensex-hindalco-cummins-nalco-ashok-leyland-dixon-tech-biocon-16744841.htm",
    "original_url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNN3ZtLTllOXhZZzRLMHhyRVU0bkl4a2lwSm9ZeGZ1bmtLQkdYUjk2ei1vQjBRVlhlVkNHT0xGQ0lwUFlvWlBPQ0Qyd3NWSFdIZVlRVFhWR09GX3BydUdrNWNtbEMxaFJaaFd4UEphVFJUTGlxN3MxSW95M2lUWF9hSjFSRkZQT3VwdVY1T2thYXVVR1VYdktqU3VvX0Q4ZjBZWnNHM2Y5M3pqekw5azZEcXJFMWJlSHpjaGpOZmtnQ2JtTTg1N0pnUm91NWpYdjE5TGxKcGFfUlFRQ1B20gHiAUFVX3lxTE5Sc2VUYUNUN0NfUHQtVEJvblA2Sm5pbWFJanVOcjEyZVFITzJmVmEzY0dMemVzUk5PVGhVTW5jQ096Tk80bi1FdFJhOTNiQS1rc1FRU0liWERzTUJFdnhQR0g3bUNjY3RyZXhvUXhaMG9BWUYydmh6UEJqQVpHZFJVeVdSZl9SdmJRRUNzM3N5YVFhWnJpOVFYZ3lFNTc0MnZpNXhqUmlDZ0NWOTNnT0lkb05VOXRxNUVNRV91OF9lLXR5NDhRM19sTEVxWm0tWF84VVR2TXlZR0tfVXl6QldUQlE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1752,
    "word_count": 291,
    "gnews_title": "Stock Market Highlights: Sensex, Nifty 50 end volatile session lower, financials drag - CNBC TV18",
    "published_date": "24/05/2023",
    "publisher": "CNBC TV18",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty hits all-time high as markets gain momentum",
    "body": "Benchmarkstock marketindex Nifty 50 opened at an all-time high on Wednesday as domestic markets gained momentum, tracking positive global cues and a strong uptick in Adani Group stocks. In pre-open trade, the Nifty 50 rose 0.48 per cent to 18,908.15, surpassing its previous all-time high of 18,887.30. Today's milestone comes after several sessions where the Niftycame within touching distance of achieving a record high. By 9:55 am, the Nifty 50 was trading 200.70 points higher at 18,891.90, while the S&P BSE Sensex was up 681.94 points at 63,651.94. Swapnil Shah, Director of Research, StoxBox, said, \"Nifty has crossed the previous ATH (all-time high) and moved beyond the crucial 18,900 levels for the first time in history as market sentiment remained buoyed by the progressive news about the HDFC-HDFC Bank merger and strong current account deficit data for the fourth quarter.\" \"Yesterday’s closing in the green of the US markets also supported gains in today’s trading session. We believe that a rapid and widespread progress of the monsoon, albeit with delay, should keep investors interested in the markets in the short term,\" he said. While the Sensex also hit a fresh record high today, it had already achieved the milestone twice last week. In addition, the Nifty Midcap 100 and Nifty Smallcap 100 were also closing in on their record highs. All the sectoral indices were trading in positive territory, reflecting the positive sentiments on Dalal Street. Nifty Metal was leading the pack, with gains of over 1 per cent. The top five gainers on the Nifty 50 were Adani Enterprises, Adani Ports, Titan, JSW Steel and Bajaj Finance. On the other hand, the top losers were HDFC Life, Kotak Mahindra Bank, Axis Bank, Tech Mahindra and ONGC. The record rally in the domestic benchmark indices, including the Nifty 50, has been driven by strong domestic growth, easing inflation, strong foreign inflows, and robust corporate earnings. Analysts remain optimistic about domestic stock markets, both from an economic and technical point of view.",
    "url": "https://www.indiatoday.in/business/story/stock-market-opening-june-28-nifty-opens-record-high-sensex-markets-gain-momentum-2398941-2023-06-28",
    "original_url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPSXZxSEZxYlJYaTY1Y3VHV0t3Rm5WRmU5T1lSeDlDWWVzSWw3YWNDa3NPNVZwNDlzV0xRcXItdnBLbVZCSDZIaTRjMUNXNXg4VkIyZFZxeExrMHRKVHV5cmFOcUpORkFFLXdRbWl0TVVqSG9FcUlyOXBmVnNYTzVZX19tdldtU1VGMm5BR0t4TlVyTEQwVUdSQWl4QUZiR2VZUUxhdzE0YWlfcl9vR2JmR3FHVzRoMXc5SW1qN2RGSlA5MU5CSlk5b2Q4Mnk4Q1pscUE0MVlvMkXSAd4BQVVfeXFMTjYtZWxxODAtRks5V21yeWRnVGdENFJWVFlYTUpxWHM5R0J1Mjhld0tFX25mNG9fM0hySmpYZG1KZTJyeVpqWm9tZnJtR2tJNGtxYzZkdk81QmE1b05CbVB4Nm90S0FkUzRQSWNZc3dTVzNhbXJrWnRFMXRQUFREaE5kNjVPUzZHOTVab2psa1pXcnFHUXp4a2tBUm5GdTByZjFXNFdOQ0o2THo3cm5XakRyZ19za1dIR1ZEX2MtVG5KWUxKd0NYYThCT1dFNUJNSTFja1J3TzBWZFEwX1Z3?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2051,
    "word_count": 331,
    "gnews_title": "Nifty hits all-time high as markets gain momentum - India Today",
    "published_date": "28/06/2023",
    "publisher": "India Today",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex, Nifty touch record high but did they outshine gold in H-1CY23?",
    "body": "Nifty vs Sensex vs gold:After giving zero return in first two months of the current year (CY) 2023, key benchmark indices of theIndian stock market— NSE Nifty andBSESensex — witnessed strong rally in last four months that helped both indices to touch record high on the last session of CY2023. In first six months of CY23, Nifty has delivered 5.83 per cent return whereas 30-stock index Sensex surged to the tune of 6.32 per cent in this time. However, gold is not a laggard in terms of giving return to its long term investors. In January to June 2023 time, gold has given 5.73 per cent return to its investors. Speaking on the return given by Sensex, Nifty and gold in first six months of 2023, Anuj Gupta, Vice President — research atIIFL Securitiessaid, \"BothNiftyand Sensex ended lower in first two months due to concerns of economic slowdown in the US and other strong economies. In this period, we saw gold emerging as a haven for investors as they were relocating their money from equity and other asset class to gold and bonds. But, ease in pressure on the US economy and US Fed's interest rate pause led to trend reversal in Indian markets. However, gold remained investors' favorite till end of May 2023. However, profit booking had triggered in mid of May.\" On how gold remained in reckoning despite stock market rally in India, Sugandha Sachdeva, Executive Director & Chief Strategist at Acme Investment Advisors said, \"Even though Nifty and Sensex touched record high during last session of H1-CY23, gold has also been a strong performer in the first half of 2023, with prices up around 5.73 per cent year-to-date. Gold prices have remained buoyant amid the concerns surrounding the banking crisis in the US, hopes of an interest rate cut by the US Fed towards the end of the year, weakness in the greenback, robust central banks buying in the Q1 CY23, concerns of a slowdown in growth momentum and positive globalgold ETFflows of around $1bln till May 2023. However, prices have corrected since the second half of May amid a slew of headwinds-concerns of US debt ceiling subsiding, receding inflationary pressures, sizeable net selling by central banks’ in April, and the rebound in the dollar index from multi-month lows at the expense of gold.\" \"The major turnaround in Nifty and Sensex took place in the month of April as both DIIs and FIIs became net buyers had helped Nifty register around 4.1 per cent rise. This rise in key benchmark indices in the month of April triggered buying interest in broad markets as small-cap and mid-cap indices were the first to touch life-time highs. After the robust rebound, Nifty and Sensex extended this rally in May and June as well. Nifty logged 2.60 per cent return in the month of May while in June 2023, 50-stock index registered 3.50 per cent rise,\" said Anuj Gupta of IIFL Securities. On factors that led to trend reversal on Dalal Street, Sugandha Sachdeva said, \"The Nifty 50 index and Sensex witnessed a scorching rally and surged to new all-time highs in the first half of 2023. This rally has been driven by a number of factors, including robust foreign investor flows, upbeat US economic data, receding inflationary pressures, subdued crude oil prices, steady corporate earnings, and a revival of the monsoon. FIIs have pumped around $11 billion into the Indian stock market in the past four months. Further, broad-based participation from almost all sectors has contributed to the Nifty's roaring upsurge.\" Giving credit toHDFC BankHDFC merger for the last minute push in Indian markets ahead of the end of first half of 2023, Sugandha Sachdeva said, \"Markets also received a nudge from the optimism surrounding the HDFC-HDFC Bank merger. This merger would create the world's fourth-largest bank bymarket capitalization. The merger is seen as a positive sign for the Indian economy, as it would create a stronger and more efficient financial institution,\" adding, \"Furthermore, Prime Minister Narendra Modi's recent visit to the US has also brought about exuberance in the markets. His visit is likely to strengthen bilateral ties between the two countries, and as a slew of strategic deals were signed, investor sentiment improved back home.\" On which asset class may outperform others in the next half of 2023, Sugandha Sachdeva said, \"It would be difficult to assess, which asset class will outperform in the second half of the year. Ultimately, the performance of both asset classes will depend on several factors, including the global economic outlook, interest rates trajectory, and geopolitical developments.\" Disclaimer:The views and recommendations given in this article are those of individual analysts. These do not represent the views of Mint. We advise investors to check with certified experts before taking any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-nifty-touch-record-high-but-did-they-outshined-gold-in-h1cy23-11688176389803.html",
    "original_url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOTjIzd2FwYVhldExDeFZHZkVHWFJpblJQd2g0WHJsRmlWLXo4Vk5zY1ZqSlVEVUlLYzJoSDVSUFNkMlQwMzExVDNlRGc4UFMyY0VnaUZ1NklMNVRsZTNsamNDcjN0YVp6b2MyRlRDNHJFY1ByVFdVRXRobkRqdXVCY0lZc1htREZWUkJnZHBqRlhkV3NuVE1xTVJfUkZsekVqUzVuZFpMNEE4U3lScTRvMFJoUzhVN3hOUDdFYnZnM09Jd09fVW9QWXZrS3R3cklrZlY5UtIB2gFBVV95cUxOdjlQOHQxYzJETk5lXzFIRXZzSGNVVFNXelk2RUNMeGFMSlZqeS1FVFJsaGF4aUItcHpaenVzaVJzWGl4RXM3b0pROTZPTnJfNml4aEhGbXJfRFpZOFUwT1RxRGV5WC1JeS1FRXJYWjZrVjhaMDJXWVJWdWNQMU1PRmw4WEhkOU92SmhCeThfdjlXT3RKaFhfYUprNTlVNHUyWVZyQWIzNWtYRmlkY1R6SjR2VUFFTUthRnZ1SGcwRWc2NFRmLTYyXzBKMUFGeEVtbXV4Nm9OVFZIdw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5038,
    "word_count": 831,
    "gnews_title": "Sensex, Nifty touch record high but did they outshine gold in H-1CY23? - Mint",
    "published_date": "01/07/2023",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex, Nifty at a lifetime high: What's behind the share markets rally?",
    "body": "Sensex, Nifty rise:Indian stock market indices surged to new highs, with the Nifty 50 reaching a record level of 19,201.70 and the S&P BSE Sensex settling at a fresh peak of 64,718.56. Due to the rally in equities, the market capitalisation (mcap) of BSE-listed companies jumped to₹295.72 lakh crore, setting a lifetime high. (Sensex, Nifty all updates) The benchmark had its strongest week in over 11 months, and advances extended for the fourth month in a row. But what is fuelling the share markets' rise? Here are some reasons: One of the major reasons for India's benchmark indices reaching new record highs is due to the boost in the performance of information technology (IT) stocks. Twelve of the 13 major sector indices logged gains, with the IT index rising over 2% each. Infosys jumped over 3%. The IT industry heavily relies on clients from the United States, so the positive release of strong economic data from the world's largest economy has eased concerns about a slowdown and improved the overall market sentiment. US' favourable economic indicators like increased first-quarter GDP, decreased jobless claims, and successful stress tests conducted by the Federal Reserve have reduced economy slowdown worries, boosting the markets. The automotive sector reached new record highs, with a rise of over 2%. Auto stocks such as Mahindra & Mahindra, Hero MotoCorp, and Maruti Suzuki emerged as top gainers among the Nifty 50 companies, ahead of the release of June sales data. Strong foreign inflows, controlled inflation, and consistent growth in corporate earnings have further boosted confidence in the Indian equities market. Positive macroeconomic fundamentals have attracted inflows totalling more than $3.5 billion. This has also helped the rupee strengthen, the strongest since January, as it closed the day at 82.0375 per dollar, up from 82.0550 the previous session.",
    "url": "https://www.hindustantimes.com/business/sensex-nifty-record-rise-nse-bse-indian-stock-markets-alltime-high-reasons-of-share-markets-rally-101688120505597.html",
    "original_url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxOcXNOX2RXODYweTYxdGxCNjhWOFBERWh4M1FQYmZtYWh5T2Zsam9xTW1CNnZpbTFsaVlIeGNrYkZWRlVXcWdEc3BqcXd6eUZDYW56S28xWmtyaUtDdmN0U2xkeldiVU40ZE1OVmpqbXMtTHZGN3praW9Ua3RsM1ZQUVBsUFpIdGZOUjRMSmI2ak9JWHU0ZVZPM09SUkxjT1c5OVdLajFXWlFXOWU1NHBoNmYyX2lHbUoyRXV2UXBnbEw5clNvVklMcllQa2dVZVh4UDFvMndzbWZEbkdXMU1mOU56NWJvbF9fNm02WjdTd9IB9AFBVV95cUxOWm5iajJFRkZiWTJKS0RLSlV3YVNOM3VRQU8tc2hZYUkxLVVlZjVSYmpYV2RzRjhtYjFMX25XdTZyUi1NeGxFZ3NfVFNsb1FiWHl2d3hGTi1VcTI2N1lHbE1pQ1ZHZWFkNWR5Y3N2bDdldEJ6bWw0Tl9ZWlVxeU94ZVc2Wng2VWFqem8wZHpaeTF1Umt4MzVBbzZFN1d4MEx1czNQWEF1Q0lLenlsdTNRLU5nc1ozUWptU3NnZmZ0U2NZZG93OGxVTENFZE1XUmFmdDJFUkY4c25NSEpuMXBjOEpnSENZSGNfSG5LSFc5S3J3ejdX?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1888,
    "word_count": 299,
    "gnews_title": "Sensex, Nifty at a lifetime high: What's behind the share markets rally? | Hindustan Times - Hindustan Times",
    "published_date": "30/06/2023",
    "publisher": "Hindustan Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Share Market Highlights: Nifty ends in red, below 17650, Sensex settles in green, up 200 pts; Bank Nifty gains 150 pts",
    "body": "Share Market News Today | Sensex, Nifty , Share Prices Highlights: Domestic indices colncluded Thursday’s volatile session on a mixed note. The BSE Sensex closed in green above 59,900 while NSE Nifty 50 ended in red below 17,650. The NSE Nifty 50 fell 5.90 points or 0.03% to 17,610.40 and NSE Nifty 50 rose 224.16 pts or 0.38% to 59,932.24. Britannia , ITC , IndusInd Bank , Hindustan Unilever and Infosys were the top gainers while Adani Enterprises , Adani Ports , UPL, HDFC Life nd Eicher Motors were the laggards. Live Updates Share Market Today | Sensex, Nifty, BSE, NSE, Share Prices, Stock Market News Live Updates Thursday February 2 Live Updates",
    "url": "https://www.financialexpress.com/market/share-market-today-live-updates-sensex-nifty-rupee-vs-dollar-adani-shares-us-fed-rate-hike-fo-expiry-february-2-thursday-2968831/",
    "original_url": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxPZzBRRWhqeENTOTF6VEVMYWgzWUFHektDR096QVEtb0dfdEJqVlhFTTcxS0FwTm5meU9wWEtQQkJrckJTaFlyWWpTRGhIS3hyZXlNS1QyUWdha011OVNvNFhmM0dlblNZT1ZnN2pQcm1lYnpVemlkOUJjamhBdHpLRzVSTjhTMWhrUjl5akdNZ0FhSzlZeV95b3JicExWaEpRLTBsWXR5V1FjVkFKZWVncWhSTW1FRnVFSjNRRXNvS3RpdTZFUXY2WGk1UmZmdWNUSUxDMENVNGJwV2pUMzdKdTBUVUJoX2lzeGZMWGVwdVlmOWd4b0JudE0yTnZ5Zw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 655,
    "word_count": 113,
    "gnews_title": "Share Market Highlights: Nifty ends in red, below 17650, Sensex settles in green, up 200 pts; Bank Nifty gains 150 pts - financialexpress.com",
    "published_date": "02/02/2023",
    "publisher": "financialexpress.com",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Sensex, Nifty 50 end volatile session off day's low led by financials, auto",
    "body": "Stock Market Highlights: Sensex, Nifty 50 end volatile session off day's low led by financials, auto Share Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty 50 recovered from lows, and ended the last trading session of the week higher, making third straight weekly gains. The indices opened with minor cuts earlier in the session. Gains in financial and auto shares led the headline indices higher, while, metal and power shares ended in the red. Investors await more of financial results from India Inc for domestic cues, with Tata Motors due to post its earnings later in the day. The indices ended marginally lower on Thursday following a volatile session. By Asmita Pant May 12, 2023, 4:02:27 PM IST (Updated) 1 Min Read Share Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty 50 recovered from lows, and ended the last trading session of the week higher, making third straight weekly gains. The indices opened with minor cuts earlier in the session. Gains in financial and auto shares led the headline indices higher, while, metal and power shares ended in the red. Investors await more of financial results from India Inc for domestic cues, with Tata Motors due to post its earnings later in the day. The indices ended marginally lower on Thursday following a volatile session. Catch highlights of the May 12 session here: Continue Reading First Published: May 12, 2023 8:14 AM IST Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags india stock market nifty sensex",
    "url": "https://www.cnbctv18.com/market/stock-market-live-updates-today-share-market-nifty-sensex-max-healthcare-tata-motors-cipla-adani-16638431.htm",
    "original_url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPQlFnRzdmeGN2eUhManZoY0ZHM0RfbWlaOWxFZkpaLUlXVEZzSTc0Z2tHU1JaQ2MyTExEUkRldG5nQmpDV2xzam9hU1N0VlB6QkoyLUszTmx6dGxfRjFyWk9qN0QzR2xxUGNPa2FjOW93TUpmQjcxWlZVTHNycVpYYV96RlFGUnNURUhkWXlnYzd0b1lpOWVMOWRjbGtWY3ROQ0NnTFFLUmk5VDl1eXB4ZmFxSlprZmZuaTVjVnhmOGJyMlNOSDU4T3MycHRpSDBHdWJjOHRVUnrSAd4BQVVfeXFMTnp4UTRSRFlld1BPUGszbjBNY2RUbXBEOWtnendGVTEtOVY4MkctalA1a0wxTWtsVTROM1FwRkVBcDJEbmFBN1J6cjM5NnBRUjVVMnZSQ0loSGFoeVFsSFoyb0JJSy0yTzRSZ2ptc1Joc1NCUVZCdzN4dDhJS0h2akVyWHJxUGFuT2Q0ejFxU1VmckhEXzIySGoyM0hIM1lYN2hWSVRQbDcxc3F5VUxhLVkzN3hhaTdqYWQtLUpqb2VlM0dwOXkwN1BEWVVTYnNxWGhiNFZHNHR3VkhBRTlB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1647,
    "word_count": 273,
    "gnews_title": "Stock Market Highlights: Sensex, Nifty 50 end volatile session off day's low led by financials, auto - CNBC TV18",
    "published_date": "12/05/2023",
    "publisher": "CNBC TV18",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "India's Sensex hits all-time high; Nifty settles at a record close",
    "body": "A man walks past the Bombay Stock Exchange (BSE) building in Mumbai, India, January 31, 2020. REUTERS/Francis Mascarenhas/FILE PHOTO Purchase Licensing Rights , opens new tab BENGALURU, June 21 (Reuters) - India's benchmark Sensex stock index hit a record on Wednesday, while the Nifty 50 logged a new closing high amid sustained foreign inflows into Indian equities backed by the country's strong growth prospects. The S&P BSE Sensex (.BSESN) , opens new tab hit an all-time high at 63,588.31, before giving up some gains to close at 63,523.15. Get the latest news from India and how it matters to the world with the Reuters India File newsletter. Sign up here. The Sensex, though up by over 4% so far this year, has still underperformed indexes of countries like Japan, Taiwan, South Korea, Vietnam and Sri Lanka. But, Sensex was the first index to hit a record high this year. Reuters Graphics The blue-chip Nifty (.NSEI) , opens new tab index rose 0.21% to 18,856.85, a record close. \"After an almost eight-month consolidation, the Sensex has hit an all-time high,\" said Amar Ambani, head of institutional equities at YES Securities. \"If monsoons do not play spoilsport, 2023 will be a strong year for Indian equities. FPI money should keep flowing into India.\" Foreign investors have poured in 738.12 billion rupees ($8.99 billion) so far in this financial year. They were net sellers in the two previous financial years, with a record outflow of 1,400.10 billion rupees in FY 2022. Advertisement · Scroll to continue India's economic growth has accelerated in the March quarter, while inflation has cooled, showing that the country remains one of the fastest-growing emerging economies. On Wednesday, nine of the 13 major sectoral indexes advanced, with high-weightage financials (.NIFTYFIN) , opens new tab adding 0.68%. Broader indexes extended gains with midcaps (.NIFMDCP100) , opens new tab rising 0.81% and hitting a fresh high and smallcap index (.NIFSMCP100) , opens new tab advancing to a new 52-week high. Advertisement · Scroll to continue Among individual stocks, Shriram Finance (SHMF.NS) , opens new tab jumped over 11% and hit a record after Piramal Enterprises (PIRA.NS) , opens new tab sold its entire 8.34% stake in the company. Markets, meanwhile, waited for U.S. Federal Reserve Chief Jerome Powell's testimony before the financial affairs committee of the U.S. House of Representatives. ($1 = 82.0780 Indian rupees) Reporting by Bharath Rajeswaran and Gaurav Dogra in Bengaluru; Editing by Sonia Cheema, Varun H K and Sohini Goswami Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Read Next 6 mins ago India category India says highly unlikely that UN peace forces will be deployed in Ukraine, Gaza 4 hours ago India category India central bank holds rates, leaves room for December cut 1 hour ago Sustainability category Spooked by AI, Bollywood stars drag Google into fight for 'personality rights' 5 hours ago India category India's September manufacturing growth cools as price rises soar to 12-year high, PMI shows 24 mins ago India category Indian benchmarks snap losing run on cenbank lending boost 4 hours ago India category India set for $8 billion IPO rush in year-end blitz",
    "url": "https://www.reuters.com/world/india/indian-shares-set-open-lower-weak-global-cues-2023-06-21/",
    "original_url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQTENtSWJ3OGlEdDBRT05hSmtYdF83WERTM2k0TUVIX1U1eGRNUVREZkJFVktkT216eVk3RzI4dlVFeVMxVkM2VlZmM18tRTRjNUJFQm54SU43dlh4cTVqWDlvdUlSbllIMTY2TlpsLUxVVXBPckVsVEdXYWZwVFJPN25BUENNR0hCZUlGRVMxdnREaVBXN2ZUWA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3295,
    "word_count": 534,
    "gnews_title": "India's Sensex hits all-time high; Nifty settles at a record close - Reuters",
    "published_date": "21/06/2023",
    "publisher": "Reuters",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Dalal Street at record highs: Sensex crosses 64,000, Nifty tops 19,000",
    "body": "The day just keeps getting better for investors on Dalal Street as the benchmark stock market indices have not only registered fresh record highs, but have also scaled fresh peaks. The S&P BSE Sensex crossed 64,000 after rising over 1,000 points, while the NSE Nifty 50 hit a fresh all-time high of over 19,000. Broader markets also gained sharply despite the rising volatility. The mood on Dalal Street was lifted by strong deals, including the one involving GQG Partners and other investors buying additional stake worth $1 billion in Adani Group companies. Also Read |Sensex, Nifty hit record highs: Can bulls on Dalal Street keep the rally going? The benchmark indices were supported by gains in metals, banks, financials, consumer products, auto, pharma and energy stocks. Nifty Pharma was the top gainer among Nifty sectoral indices. The strong rally has boosted the Bombay Stock Exchange’s market capitalisation by more than Rs 1.84 lakh crore, reflecting the gains made by investors during the trading session. The top five gainers on the Nifty 50 were Adani Enterprises, Adani Ports, JSW Steel, NTPC and Tata Motors. On the other hand, the top losers were HDFC Life, Hero MotoCorp, Wipro, Tech Mahindra and Kotak Mahindra Bank.",
    "url": "https://www.indiatoday.in/business/story/stock-market-update-june-28-sensex-nifty-record-highs-new-peaks-2399099-2023-06-28",
    "original_url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPRklVUlBURlNjZW9WaFVYRWNkbENyajhTLTNSUU1Ud2tNM2xTdHNGV3hfemhnX2cxdFlMV2hsdGNRcjIzdGRBQU5QcE9sSlVvMmVzQllNc0dRaHRKWWI3ZUNYb3N0XzlHNXJmY0NYa0lGaExtdUdFazVLcVRUSWRSbjVFVHlXTDVma2hxUTJTcDVDdWgyVkhsVkRGbm1pRUVsVWpkWFV3akxXNmdYLU9TVGlzZVA5c0VDWkZDNFNjVlbSAcYBQVVfeXFMT005SnBtT005dE13TGFITnFYTi1ZdFVRSUpfT0loTWp3LVAxZ0J0U3JUb19yQmk1LV85NDRfYXc4SkhKUzJSSnhfOWpVd2FXbEZkTmVnalc4eV9jSmk4blNzamlsU0o2Z1lrLUd6UlFtTkVjUF92VWktMjlFMTFJbEFqbVg5VjFOQjBwNElHRVZVY2xqZVJxWFllb1pHbXBPSFRDelEtckdaVnRwV2w4Q2swRzNOT1dvMXA3OHVNcXQwUUo0X2lB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1236,
    "word_count": 202,
    "gnews_title": "Dalal Street at record highs: Sensex crosses 64,000, Nifty tops 19,000 - India Today",
    "published_date": "28/06/2023",
    "publisher": "India Today",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Sensex, Nifty 50 end higher for second straight session, Adani Enterprises top gainer",
    "body": "Stock Market Highlights: Sensex, Nifty 50 end higher for second straight session, Adani Enterprises top gainer Share Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty 50 ended higher on the first trading day of the week, ending in the green for second session in a row, after opening lower earlier in the session. The Sensex ended 234 points higher, and Nifty 50 above 18,300. Gains in IT and metal shares led the headline indices higher, however, financial and telecommunication shares ended in the red, limiting the upside. Investors await more of financial results from India Inc for domestic cues, with BPCL and Indiabulls Housing Finance, among others due to post its earnings later in the day. AB Fashion and Retail announced its March quarter earning during the trading session. The benchmark indices, Nifty 50 and Sensex ended higher on Friday. By Asmita Pant May 22, 2023, 3:52:27 PM IST (Updated) 1 Min Read Share Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty 50 ended higher on the first trading day of the week, ending in the green for second session in a row, after opening lower earlier in the session. The Sensex ended 234 points higher, and Nifty 50 above 18,300. Gains in IT and metal shares led the headline indices higher, however, financial and telecommunication shares ended in the red, limiting the upside. Investors await more of financial results from India Inc for domestic cues, with BPCL and Indiabulls Housing Finance, among others due to post its earnings later in the day. AB Fashion and Retail announced its March quarter earning during the trading session. The benchmark indices, Nifty 50 and Sensex ended higher on Friday . Catch highlights of the May 22 session here: Continue Reading First Published: May 22, 2023 7:58 AM IST Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags india stock market nifty sensex",
    "url": "https://www.cnbctv18.com/market/stock-market-live-updates-today-share-market-nifty-sensex-jsw-steel-ab-fashion-bpcl-indiabulls-housing-finance-16721551.htm",
    "original_url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxOeXpIbnZPWlp0MWVQaWVHOFpoNVdLTzhqUjNETWo5cm5zV0VBbWJHaHZnOGtoZkp1b0lQcHlhMFQ0bVlsZXduSHluZ1FsS2w5eDk1dk8zaVJpZzRVN014VFpsT3dTejFUNmVySHkydTBFVi1DOERnQjRFYmZLekdfOWVjNGtBQkdqTFRuR2dwU0JMQ1MyMVVFUTFTQ1ltU2FhT2dPWXloSHB3OVVWTU1pN2JZcjhIb2FoUTRrQ1J3Rko1bUFTNkh1dW44Rlo0SjFzaDRRbDRPZlVEWHZHRjNxRlZKUi1WUGQ1ZUN30gHwAUFVX3lxTE8wUnB1NXotLVBMQkQxdlRHanNCNHQyaHhRbGdJQXh0dTRTN3hnSThrNXRRRUx2eDRMTjhBNUpXN0o1Qlp6cklmSGpscC1VRXZNMmlBWUxEdDJRRFV6ams0MmNpS3JQTkJjMXpzLWduVnV2QnFHNnVpRlkxN3h6X0t4SUU3RjFzTENjcnpRbnk2YU5feE5XaHJWWFNGa2xlU1hsQjRPdjNwNktEUVN4blE2QklMdUZmcFA5Y0t5b1JtVVhobFRmRERrVW1FeTFrRDBGX2dVMDlwbEVZNTYyWTRpTjl2cVV4b2hBQURwYm1iQg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2024,
    "word_count": 336,
    "gnews_title": "Stock Market Highlights: Sensex, Nifty 50 end higher for second straight session, Adani Enterprises top gainer - CNBC TV18",
    "published_date": "22/05/2023",
    "publisher": "CNBC TV18",
    "topic": "Nifty 50 stock market India"
  }
]