[
  {
    "title": "Stock market crash today: BSE Sensex ends over 1,200 points down; Nifty50 near 23,050 - top reasons for bear attack",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More South actresses' best pictures of the week Palak Tiwari to Shraddha Kapoor: Trending pastel sarees for summers Manasi Parekh exudes elegance in a mesmerizing emerald draped gown 10 gentle exercises for women to reduce arm fat in few days Nora Fatehi's breathtaking pictures How to handle conflict in a relationship Nora Fatehi’s midnight glam: A bold fusion of elegance & drama 9 reasons why one should keep a Snake plant in their home 10 types of samosa enjoyed across the country A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns...",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-21-2025-dalal-street-indian-equities-global-markets/articleshow/117412522.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxQSGF0RzJyNGFkaGZ0enNpajRMODZOWXZQVEtLcWRUakxyaGRvS0ltaG1BMGVBbFZxbUFZNk51SU10WlZBMFZiclRsOENrX2pXT0RGV1YwSUNIMDl1bTJZZlpab2pUMXFvV2VzXzdiOVhveTNEU09VTXNhTlY1dE5kb0ItdGVQNFcyOTBFaFloQVRwZllZN3llOVhBeEZuRTZYQnVYdjF6SmlCamVVeG15VHpoYXFjRFFEZGZoVkc3N2R1ZW9IOW9WTTZlU3ZiRmlNZHBCOURjUnU5WHZyMno4WmQxRmZsU2hrOUpZWWw2aVNqRVJ5TElva1VMcXpCRDExMkdDMTU4YVgwcWhzN1ctTNIBlgJBVV95cUxPdnZLbGJEZWRZSWZ3b3J4R0dCYlNDODZQUmtNcmRPb0FzWF9ISUxsM2V4S1l5ckROME1LV2NDRGZ1LUl6VkJmOFBmTlpicWFGVk9mWUJGRGt1dGNxY0J1blczU2RSSGp6YmR4aVFnMUZKTjRBRjc1NkVwQzBDeTZ3OFlmVnVqblVzeEZDcDQ0OXVXbVdFUXVlTlRON0pCRzFJeFJ2d2xLOXhNNUJYV1hVSl94TTl6OVlrWDJ1ZDkwSC01MUpKT1EzeHRLX1U5VzFXVWVrTzFKeDRLc0FqakxnNTRWTEVCbjJDR2NxQlotdTc4eF9iMG9jOVdHcGhUbG5sLW4xT0NNWkpiWjZyR25TWklGOWhzZw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1652,
    "word_count": 269,
    "gnews_title": "Stock market crash today: BSE Sensex ends over 1,200 points down; Nifty50 near 23,050 - top reasons for b - The Times of India",
    "published_date": "21/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 24",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open higher on Friday tracking positive global market cues. The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 23,303 level, a premium of nearly 40 points from the Nifty futures’ previous close. On Thursday, the domestic equity market ended higher, with the benchmark Nifty 50 closing above 23,200 level. TheSensexrose 115.39 points, or 0.15%, to close at 76,520.38, while the Nifty 50 settled 50.00 points, or 0.22%, higher at 23,205.35. Nifty 50 formed a small positive candle on the daily chart with minor upper shadow. “Technically, this market action signals a gradual follow-through upmove in the market amidst range movement. The bearish lower tops and bottoms is intact and the current pullback rally could possibly open another lower top formation in the short term. The broader high low range remains intact around 23,400 - 23,000 levels. Having bounced back from the lower range, the Nifty could move up gradually towards the upper range of 23,400 levels in the near term,’ said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities. According to him, a decisive move above 23,400 levels could open renewed buying enthusiasm in the market and immediate support is placed at 23,000 levels. Here’s what to expect from Sensex, Nifty 50 and Bank Nifty today: Nifty Open Interest (OI) data indicates the highest OI on the call side at the 23,300 and 23,500 strike prices, highlighting strong resistance levels. On the put side, OI is concentrated at the 23,000 and 22,800 strike prices, marking these as key support levels, said Hardik Matalia, Derivative Analyst at Choice Broking. Sensex continued its positive momentum on Thursday and ended up by 115 points above the 76,500 level. “Technically, after a muted open, the market held positive momentum throughout the day. It also formed a reversal formation on the daily charts, which supports a further uptrend from the current levels. We are of the view that as long asSensexis trading above 76,200, the pullback formation is likely to continue,” said Shrikant Chouhan, Head Equity Research, Kotak Securities. On the higher side, the Sensex could bounce back to the 77,000 - 77,100 range. On the other hand, if it falls below 76,200, the sentiment could change, and the Sensex may retest levels of 76,000 - 75,700. Nifty 50 continued with minor upmove with range bound action on January 23 and closed the day higher by 50 points. “Nifty 50 failed to break above the 50 EMA (Exponential Moving Average) on the hourly chart, indicating selling pressure at higher levels. The bearish trend is likely to persist as long as the index stays below 23,400. On the downside, support levels are observed at 23,150 and 23,000,” said Rupak De, Senior Technical Analyst at LKP Securities. According to Om Mehra, Technical analyst, SAMCO Securities, Nifty’s recovery follows the Hammer candlestick formation at the critical support zone near 23,000, reflecting a potential reversal signal. “This recovery inNifty 50was further supported by a double-bottom formation on the hourly chart, highlighting an emerging bullish setup. However, a decisive breakout and sustained move above 23,400 would be pivotal to confirm a shift in trend from bearish to bullish. The index is currently hovering near its 9 EMA. The daily RSI is recovering from lower levels, though it remains tilted to the downside,” Mehra said. The advance-decline ratio is gradually improving, indicating an emerging balance. The support remains at the 23,000 level. The India VIX, the fear gauge, settled at 16.69, and a dip below the 16 mark could provide the much-needed tailwind for bullish momentum to strengthen, he added. VLA Ambala, Co-Founder of Stock Market Today, expects the market to remain sideways to bearish in the short term, with heightened volatility anticipated ahead of the budget, as indicated by a potential surge in the India VIX. “In this situation, I suggest investors hedge their portfolios and set a long-term view of 2 to 3 years. The Nifty 50 could expect a support level between 23,200 and 23,120 and resistance near 23,405 and 23,520,” Ambala said. Bank Nifty index closed Thursday’s session at 48,589, slipping 135.40 points, or 0.28%, as the index failed to capitalize on the previous session’s Dragonfly Doji formation. “Bank Niftyis hovering near its 9 EMA, with the daily RSI showing some recovery from lower levels but still leaning toward the downside. On the hourly chart, Nifty Bank is positioned near the middle Bollinger Band, reflecting its non-directional stance. A breakout above 48,750 could open the door for further upside, while a fall below 48,250 may indicate a bearish shift,” said Om Mehra. The index appears poised for range-bound movement in the near term, with the potential for volatility on both sides as it awaits clear directional cues, he added. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-january-24-11737659798295.html",
    "original_url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxPWXg0SU1NWU9uWV9KcnQtMkN5WjFDOFJNaC1Bb0lGV1p2WGNGQ0xfYXUyMWpTcWpmOE93ajdWRHFubzlOUmtGdnJZdWFLUkl5dGt2NXRkS0ZHSXNsaVk1VkFvaXI2Z1N6TjZ6UFRDWWVfakF0ajNvT2s3ZUJiVlV0NDZaV2hyUk9pMlNWcV9yY0lUS0tVUVp4Vkh5ZDFJcXR5cjRHQzh2V3FSU0I1ZVAyTG9nVUlfaG9NX0VsMndWM1E4ODM1akxBNEcxbTlmSi1odkFERG1HZWl0TGlTLVp5enJLaWZidHFMb0HSAe8BQVVfeXFMTTNXeHd3UC1wdFEzZW9WZlBJaHlZdmxzZFZQamV4dUtGYm04VXVYRnhSQ2tjU3QzZVl0eFdKY1VieW1tRVkwYjJoRGdfeF9yQ19RVXNiRzZYUmJ1LTVGdlFmQ0tQc3NXMFhBZ09uSGJxM05DZ2FGcmlHejlyRHpLTmM5R29HVk5TamtrR0RhMGcwemgtZjN6a0pjM3l1QWJKQVU3eDZmWGViQmM2TDVyWU55Q1kyR3pHaThmU3lYNG9pZDdJRzJ6S2dnaGpadDFMakszS21lTzM3TXcxWHpTUlFFTTFyUEVoSExvVXJWQVU?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5418,
    "word_count": 873,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 24 - Mint",
    "published_date": "24/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights : Nifty closes above 23,100; hammer pattern signals bullish momentum ahead. How to trade on Thursday",
    "body": "Tech View: Indian equity markets ended positively, with the Nifty closing above 23,100 despite intraday volatility. The index rebounded strongly, forming a hammer candlestick pattern, indicating strong buying at lower levels and potential bullish momentum. Holding its 23,100 support, the Nifty faces immediate resistance at 23,300, with potential targets of 23,600 and 23,800, said Mandar Bhojane of Choice Broking. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-22-january-2025/liveblog/117441279.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOQUtyZE9nUzFoa1NnYmt1cF9yYVNXSV9jRUVsUDl2ZDUyMVcxNXFzOV8xMUpCMjFrS2VvX2VQZHBGcHBTT1NaSEIweXJpMlN6SE5xOUowc3RnMnJwNWFGN3h5bnE5R3N1ZXdWX1k0Z0psWHpBaGtRdHkxbWNLVkg3endUS2NFbmRLYXZwdlBVX09mWTZkVGVFdXVHaFBkcDJSWWNTVFk1T1NrMjF5TEtoQVpTRURVMFBSQkdVbDNwcW5CQlVtcVpBcnVJV3RVRFhXcm5rLS1mQdIB3AFBVV95cUxOWnNSQVdfYmhnWGU3NmxPa3NqOEZacC1idFpJTUFoUWhnN19BcWZ5N3YxdzJzUWZrOFJuaDdiQjlMV3F5d25Ud3I5azBwUUxqcWl0TWwyOXNxSTVjR3lERWNSaEZSUmpYTTNUTE9HcGMxTktmWWJIYUVYOGRYbWxMNWFWaTBad0xyWEl5V0pRcWxCeEI2ZUozNVAwODh2c3hscVdBU1NoRXFXM2hwMWV1dWhnU2djclAyVXM3am5pTjZzcFhuNGtJd0otMkVsM3NCS1MxaFZPMU9oUHM2?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 730,
    "word_count": 111,
    "gnews_title": "Stock Market Highlights : Nifty closes above 23,100; hammer pattern signals bullish momentum ahead. How t... - The Economic Times",
    "published_date": "22/01/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex, Nifty 50 today: Stock market opens red as FMCG, PSU Banks, energy fall",
    "body": "Sensex, Nifty 50 Today:The stock market opened in the red as trading began on Thursday, January 23, with FMCG, PSU bank, and energy stocks falling the most. At 9:20am, the benchmark BSE Sensex was down by 139.03 points or 0.18%, reaching 76,265.96. The broader NSE Nifty was down by 51.05 points or 0.22%, reaching 23,104.30. Also Read:Samsung launches Galaxy S25 with Qualcomm chips and AI features Among the 30 Sensex stocks, Hindustan Unilever Ltd fell the most by 3.25%, trading at₹2,266.70. This was followed by Nestle India Ltd, which fell 1.66%, trading at₹2,171.25, and State Bnk of India, which fell 1.00%, trading at₹745.75. Only 6 out of the 30 Sensex stocks were in the green. Also Read:Netflix shares soar to record high after ‘biggest ever’ subscriber gain in Q4 2024-25 Among the Nifty sectoral indices, the Nifty FMCG Index fell the most by 1.07%, reaching 55,002, followed by Nifty PSU Bank, which fell 0.56%, reaching 6,209.65, and Nifty Oil & Gas, which fell 0.54%, reaching 10,699.30. In contrast, the FMCG index had risen the most upon yesterday's open. The Oil & Gas index falling comes at a time when oil prices have also declined. Brent Crude was down 0.34% or by $0.27, trading at $78.73 per barrel for March 2025 contracts, while WTI Crude Oil was down 0.32% or by $0.24, trading at $75.20 per barrel for March 2025 contracts, according to Bloomberg data. Also Read:Union Budget 2025: When was the budget printed in Hindi for the first time? The stock market rallied towards the end of the trading session on Wednesday, January 22, 2025, in sharp contrast to the huge crash seen the day before. There was another rally on Monday as well. The Sensex rose by 566.63 points, or 0.75%, reaching 76,404.99, while the Nifty rose by 130.70 points or 0.57%, reaching 23,155.35. In comparison, the Sensex tanked by 1,235.08 points, or 1.60%, reaching 75,838.36, while the Nifty fell by 320.10 points or 1.37%, reaching 23,024.65 during the crash towards the end of Tuesday's trading session. During yesterday's close, Infosys Ltd rose the most among the Sensex stocks by 3.16%, closing at₹1856.60. This was followed by Tata Consultancy Services Ltd which rose 2.97%, closing at₹4154, and Tech Mahindra Ltd, which rose 2.64%, close at₹1,683.50. Among the Nifty Sectoral Indices, Nifty IT rose the most by 2.14%, reaching₹42,590.70. This was followed by Nifty Pharma which rose 0.69%, reaching 22,034.95, and Nifty Healthcare, which was up 0.53%, reaching 14,113.50.",
    "url": "https://www.hindustantimes.com/business/sensex-nifty-50-today-stock-market-opens-red-as-fmcg-psu-banks-energy-fall-101737604007876.html",
    "original_url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPMmJ0WC12VDh3Tzk2VUFreEFXNnNZdnZRb2w3bVhMSXRETWF5TmFsSkNMTDQ1b0YxbmV1bERMS05hbmdyQ3NaZFpkSnNQVlFoeDFSY0pTTnBkNnJnenMxYUl2cjNKYlBLQUhEcFdfZGRNNzRyYUxVYUJzTlRGbnZDUUZOQUtKV3JPSnV0bFZPZTZscjdJLVNmUmRsMHBpTVJFekZGSmlUNVotblE4cE9PY09ESlFHRXFfekZOcWRRdGxLbWkxeHFoX3RmV0dVZ0xp?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2481,
    "word_count": 409,
    "gnews_title": "Sensex, Nifty 50 today: Stock market opens red as FMCG, PSU Banks, energy fall - Hindustan Times",
    "published_date": "23/01/2025",
    "publisher": "Hindustan Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market slide: 12% crash in 4 months leaves investors shaken",
    "body": "The Indian stock market has witnessed a drastic fall since the Sensex touched an all-time high of Rs 85,978.84 on September 27 last year with large-cap stocks leading the downslide. The benchmark index has plummeted by a whopping 10,000 points, or 11.79 per cent, over the past four months, marking a stark reversal of fortunes and leaving investors shaken and grappling with substantial losses. The NSE Nifty Index has also taken a hit, falling by 12.38 per cent during the same period. Large cap stocks took the maximum hit as foreign investors sold heavily, leading to a 13.27 per cent fall in NSE large-cap index in four months. The sell-off has been widespread, affecting large, medium, and small capital companies across the board — the NSE Mid-cap index has dropped by 12.85 per cent, while the small-cap index has tanked by 9.87 per cent. While IT shares remained largely unaffected, capital intensive sectors like automobile and oil & gas suffered badly. The reasons for thisbloodbathare not far to seek. The economic landscape has undergone significant changes, with India’s GDP growth slowing down and high-frequency indicators moderating throughout 2024. Although these indicators show signs of bottoming out, the market faces additional headwinds. Foodinflationremains high and sticky, while high US bond yields have strengthened the dollar against most currencies, including the rupee. Commodity prices have also started to rise, diminishing the prospects of a rate cut by the Reserve Bank of India. The aftermath of the US presidential election has further exacerbated the situation, with investors increasingly favouring dollar assets. Foreign Portfolio Investors (FPIs) have sold off most emerging market equities, including those in India. Mutual fund holdings of investors have suffered badly with net asset values of schemes plunging across the board. “XIRR (extended internal rate of return) of my investments in a mid- and small-cap scheme has fallen by 21 per cent in the last couple of months. Still experts advise me to keep on investing through SIPs (systematic investment plan) despite the sell-off in the market. I’m a little worried but hopeful of a recovery as the past track record of recoveries in the market,” said Jacob Cyriac, a software engineer now based in the US. XIRR is a parameter used to calculate the returns on a mutual fund investment. It’s useful for investments with irregular cash flows, such as those made through an SIP. Despite the sell-off, equity funds saw a 14.5 per cent rise in inflows to Rs 41,156 crore in December. When valuations are very high, some unexpected negative triggers can cause sharp corrections. In September, valuations were very high and the economy was in a sweet spot because the GDP growth was high and corporate earnings were robust. “Suddenly the situation changed with the Q2 GDP numbers, which came worse-than-expected. It was the beginning. The decline in the GDP growth was reinforced by the Q2 corporate results which were also lower-than-expected,” said V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services. The country’s GDP growth slumped to a seven-quarter low of 5.4 per cent in the second quarter of FY2025. Key high-frequency indicators such as banking credit growth, personal loans growth, GST collections and rail and port traffic have slowed over the last one year, which is reflecting in the slowing GDP growth, global investment bank BNP Paribas said. TheTrump factorthen contributed to the havoc. “We sawDonald Trump’s victory which led to a rise in the US dollar. The 10-year US bond yield also rose by 100 basis points (bps) even after Trump’s victory. When the 10-year US bond is yielding 4.7 percent, there is no logic for foreign investors to invest in emerging markets, particularly when the valuations are high. This led to a relentless selling by FPIs,” Vijaykumar said. FPIs sold Rs 94,017 crore of equities in October and Rs 21,612 crore in November. After buying Rs 15,446 crore worth of equities in December, they resumed selling in the first month of 2025, offloading Rs 51,748 crore till January 21, according to the National Securities Depository Ltd (NSDL) data. Mid and small-cap correction may not be over In the large cap, corrections are almost done but that may not be the case for mid- and small-cap stocks. “However, we can see another 3-4 per cent correction in adverse circumstances. In mid and small caps, there is more room for correction,” Vijaykumar said. “The market has corrected from high. It is down 13-14 per cent from the peak. Nifty was around 26,000 and now it is at 23,000. If it (the fall) is more than 20 per cent, we can say that we are crashing. In the past also whenever we have seen corrections it was to the tune of around 15 per cent,” said Shrikant Chouhan, Head Equity Research, Kotak Securities. Over the last four years, the rally in Indian equities has been supported by strong earnings growth besides domestic flows. However, the situation has changed now in the industrial sector. “TheNifty 50EPS more than doubled over FY20-24, recovering from a low base. However, in the last six months, we have seen broad-based earnings estimate cuts. Initial trends for the December 2024 quarter, as highlighted in business updates by the companies, do not seem very encouraging,” said Kunal Vora, Head of India Equity Research, BNP Paribas. Market capitalisation, or the total value of all listed shares, of the BSE-listed firms declined by Rs 53.86 lakh crore since September 27, 2024 to Rs 438.79 lakh crore on January 21, 2025. The loss is across the board with mutual funds and retail investors taking the hit. The unique registered investor base on the NSE crossed the 11-crore mark this week, NSE said on Wednesday. Many high performing sectors fared badly in the last four months. Automobile shares were hit hard with the NSE Auto Index plunging 19.22 per cent and oil & gas plunging 17.47 per cent. Metal shares also lost ground with sector index falling 15.23 per cent. However, IT shares managed to stay afloat despite the immense selling pressure but lost only 1.45 per cent. What’s the way ahead? “We expect 2025 to be another year of single-digit returns for the markets. Indian GDP growth has slowed and high-frequency indicators have moderated through the course of 2024 and while these are showing signs of bottoming out,” Vora said. In the interim, strong domestic inflows continue to support the Indian equity market and we do not see any major risk to this. Overall, we see low likelihood of valuation multiples rerating in 2025 and expect market returns to track or slightly lag earnings growth, he said. Further, Trump’s policies in the US are expected to influence the direction of the global markets and economy in the coming months. FPI holdings have reduced to 16 per cent in 2024 after peaking at 20 per cent during FY14-20. While India’s dependence on FPI inflows has reduced due to its strong domestic flows, FIIs continue to hold $800 billion in Indian equities and their continued selling remains a risk for the market, BNP Paribas said. Nine young men from the Dimasa tribe, working at a construction site in Tamil Nadu, were killed when a concrete arch they were working on collapsed. The brothers Provit and Sorbojit Thaosen were among the victims, along with four others from their village. The incident highlights the lack of employment opportunities and low wages that force many from their villages to work as migrant workers.",
    "url": "https://indianexpress.com/article/business/market/stock-market-crash-sensex-nifty-50-9794376/",
    "original_url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPUHJ1aHlNZFlvV04wTndQUGVSSV9ma29oOUJfVE5Bb0lqTHdxQW53YU9rXzZ5RUFsQzlBaDlKNkExMFJhWlZWWG51WWRObGs2cjl2YldfcklkbzVwTjlKQ2NPNWIyTGZ1Q0FoU1NmV2tLMkFfX0tFR2pUTUxBRlJDRjFvUkZYSG5Qd25WMjRSbTBIdFkwVDJwV9IBnwFBVV95cUxQZlFsb1hkTHk2U3gyamhwUm1TTzhMX3RsMEV6SDdVdXdJak1ZQVgweVZhVy15U2o2SjhMbWxmTnNRRG1BVllzVlpTd1FMcVdVYnU1Mi0tcjQ3a3EyYmZpV3hJVHJWei03MHo0TGJqSmc3ZnhRT3dvMnRXQmlOSmRJUzhWSFNYZ2tZblZSQklsTEl2OURYcWg2clRlRzZNTVE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7522,
    "word_count": 1243,
    "gnews_title": "Stock market slide: 12% crash in 4 months leaves investors shaken - The Indian Express",
    "published_date": "24/01/2025",
    "publisher": "The Indian Express",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 22",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open higher on Wednesday, tracking upbeat global market cues. The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 23,161 level, a premium of nearly 60 points from the Nifty futures’ previous close. On Tuesday, the domestic equity market crashed, with the benchmark Nifty 50 falling near 23,000 level. TheSensexcracked 1,235.08 points, or 1.60%, to close at 75,838.36, while the Nifty 50 settled 320.10 points, or 1.37%, lower at 23,024.65. Nifty 50 formed a long bear candle on the daily chart that has engulfed the narrow range movement of the last six sessions on the downside. “The broader high low range of 23,400 - 23,050 is now on the verge of downside breakout. The previous opening downside gap of 13 January has weighed high on the market and that resulted in a sharp weakness,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities. According to him, the underlying trend has turned down sharply after a small upside bounce. The next lower support to be watched around 22,800 levels and any pullback rally could find strong resistance around 23,200 levels. Here’s what to expect from Sensex, Nifty 50 and Bank Nifty today: Nifty Open Interest (OI) data indicates the highest OI on the call side at the 23,200 and 23,300 strike prices, highlighting strong resistance levels. On the put side, OI is concentrated at the 23,000 and 22,800 strike prices, marking these as key support levels, said Hardik Matalia, Derivative Analyst at Choice Broking. Sensex plunged 1,235.08 points, or 1.60%, to close at 75,838.36 on Tuesday, with the BSE-listed companies erasing market capitalisation of₹7 lakh crore. “Technically, after a gap-up open, the market consistently faced selling pressure at higher levels. This led to the formation of a long bearish candle on the daily charts, and theSensexindex closed below the 76,000 support zone, which is largely negative. We are of the view that, as long as the market trades below 76,000, the weak sentiment is likely to continue,” said Shrikant Chouhan, Head Equity Research, Kotak Securities. On the downside, the market could slip as low as 75,500. Further weakness is likely to continue, which could drag the market till 75,300. However, above 76,000, the market could bounce back, moving towards 76,400 - 76,500. The current market texture is volatile, and thus level-based trading would be the ideal strategy for day traders, he added. Nifty 50 witnessed heavy selloff on January 21 and closed the day lower by 320 points. “Nifty 50opened on a positive note but faced selling pressure near its 14-day EMA (Exponential Moving Average), closing with a long bearish candlestick just above the key support of 23,000 and below its consolidation range. The RSI, currently at 36 and in bearish crossover, indicates a bearish trend, suggesting room for further downside before entering the oversold zone and solidifying bearish dominance. Selling pressure continues to limit recoveries, and the follow-up move will be key to confirming further downside,” said Vatsal Bhuva, Technical Analyst at LKP Securities. According to him, a close below 23,000 could push the index toward pre-election levels of 22,500, with immediate resistance at 23,300. Until Nifty 50 closes above 23,500, he recommends a sell-on-rise strategy. Om Mehra, Technical Analyst, SAMCO Securities, noted that the broader structure of lower highs and lower lows remains intact, indicating the continuation of the downtrend. “Nifty 50 also slipped below its 9-day EMA, suggesting weakening short-term momentum. The index’s falling intensity was highlighted by a sharp rise in volatility, as the India VIX surged 3.90% intraday, closing at the 17.06 level. Notably, the VIX spiked nearly 18% in January, signaling heightened market uncertainty. The daily RSI tilted further downward now hovering near the 35 level, reflecting diminishing strength. The support is positioned at 22,800 and the primary trend remains decisively bearish,” Mehra said. At this juncture, bottom fishing should be avoided as the market remains vulnerable. It is prudent to wait for clear signs of stabilization or reversal, he added. VLA Ambala, Co-Founder of Stock Market Today, said that unless the Nifty 50 index crosses the 23,472 level, the bearish sentiment could prevail, especially as we approach the budget session. “On the technical charts, Nifty 50 can expect support near 23,090 and 23,000, and resistance levels can be found near 23,310 and 23,380 in the next session. Considering the current volatility and continued global uncertainty, market participants should remain cautious in the coming weeks and stick with a sell-on-rise approach,” Ambala said. Bank Nifty ended Tuesday’s session at 48,570.90, registering a decline of 779.90 points, or 1.58%, and formed a bearish engulfing pattern on the daily chart, highlighting a mounting bearish outlook. “Although theBank Niftyindex attempted to move higher, the previous resistance levels proved to be stronger, and the index lost momentum. The broader structure of lower highs and lower lows remains intact, signaling the continuation of the downtrend. The index remains below key moving averages, suggesting persistent weakness in the short term,” said Om Mehra. The swing low remains at 47,898, and a break below this level could trigger further declines in the index. The immediate resistance remains at 49,500, which could limit any potential upward movement, he added. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-january-22-11737479996662.html",
    "original_url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxOQzJTZF94aTBNb050MUlPMEZmY09ULTdFdGJxM1hoZUhHT05KTjhpazA1bm9nR1NmVnR5cXRaN1J6LUhXS0Y5N0xfU2NiVXJCTXhGSl9YQUotXzVkNVNxQ0pFSDlPeng1eV9rMi01T2xVOXFsYlplWVMyam9Oa1VnUDNZSzg2YnI5bUpUWWd0VmZEaDVNZ3drT1pYWlU2bXBZaTBIQ0VrVFZSLVh3MUNSQW1PMFpGbTl5QWx3RGtLbUQtSVQ3WnN0U0tqNHRMamtQbGcxaElBMzktS1o3MjhMSU5ROVVqT1RROFHSAe8BQVVfeXFMT1FWTmhpbFU3VFZPZDh6bWRxZDh4Z1dDZDJ3amRIZXhUQnRmRFpZMUtub3hkNlRuQzlkOG1lUjNlTkNxVU5SejRaNWhUZnJyc0t5NGVNS05tS3MwWDB1WE56ODdRN0VqSmQ2MHZ3R3hwQ3ZsZmV1TVBidWRpQjg5eUxYQU5IYndCbmhiNVUtM2JDaUhPNWh6a3FEaHAwaktNSDZyNXpyYUk3R3I1bF9Lc3BuRVEwWWFDWUcySFZRVUFab3JpeGZURHRYUHZhOWN3NGFWYXBwTTdMT013UmV1OVMtc29FYVItQW9xNlJBSXc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6029,
    "word_count": 946,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 22 - Mint",
    "published_date": "22/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market today: BSE Sensex ends over 560 points up; Nifty50 above 23,150",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 9 Biggest Time Wasters Students Should Avoid ​8 proven tips for writing high-scoring answers in exam 8 Essential Skills Students Need for Employability 8 effective revision strategies to excel in your exams 8 things to do a day before your exam to score better 8 Clever Mind Hacks to Boost Your Academic Smarts 9 tricks to study smarter not harder during exams 9 good habits that successful students follow ​10 proven strategies to combat stage fear and speak with confidence 9 motivational quotes to help students battle anxiety A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-22-2025-dalal-street-indian-equities-global-markets/articleshow/117441909.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxPeFAwX3NEZ2lqakg2LWVkenJkRDYxbkdzbVRwTEd6dkJyQm9JYVNGZlg1VXlXekFDWUktZzl2RGtMQTF2bl80aExXM0tKdEtzc3p6TnZYU2hJS29VcVB3QnlQNGVQa2NSNXVLcWJvOEE2N1pRZWpTWjg3QkNRRGp5UGVVVlF2U1Bfc18waDFXc08xeEFpLUZ4a3VNc1FNRU1ZMXFHd196NGFyVUlMcVNFaW5DTFh2NGI1cTU4dW14b1phbEhKMHY1Z09Ya1BmVkdZbzA2UExyUE5XZFM4aU1xNTdnUGdVTUhLOU4xLUJaa1g2MndUM2VMQ1ZtZnFKUFJPdHlXWjVzcVdpb2VVeWJtVdIBlgJBVV95cUxQS3VfbEw4UFZvcElOVzFNSHIydDF5LTAxNEhoUzhBN1dpcWs5WmptMklQb2hXZXRSaXRqamNvdVUtNGUzV2R4dkFzUmRoRVhFLUhKVk9NN2VhTmlZQzF5b1FGZXJ4d25oRFpMMDZyQlRMSm9tY2puMWFuZWR6R0UzUk5oYkR1a21CWVZnbnJva1dQWS05WFh6QTJoNzRqd0c4R2dVYXhTVW9KMHdTX0VGUGs5UVVsV3UwaDljbmlhYmhWR3ZYM0x1M19IWWVxejhEUTdKMFFEZWhTRmlyYkR5VlpGV1dkbW0xa01OdEwxWGRnZVlFU2JRQXVNZ2Ztbm44UG9qMVpxTXZyU29neU1mMTBidEp0Zw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3690,
    "word_count": 628,
    "gnews_title": "Stock market today: BSE Sensex ends over 560 points up; Nifty50 above 23,150 - The Times of India",
    "published_date": "22/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: 23,400 breach needed for Nifty's bullish turn. How to trade on Monday",
    "body": "Stock Market Highlights: Nifty on the weekly chart formed a small bullish candle with minor upper and lower shadows. Technically, this weekly market action signals the formation of a type of candle pattern. Normally a doji pattern after a reasonable weakness could be an impending reversal signal post-confirmation. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-17-january-2025/liveblog/117316081.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPYnhpNXcxMW91eUVZZnk5R3V0cGliR1lkdG50OGdDSmpVdWxqNktILTNXd2lacW9rWlZRdE1URU0tbURVSFRYdWhyS3dveUk5ZUc4dHpNU3ZUQ1dtdGNIMzZTdVgxSWNKdHpqdGFFMnJST1N0WDNmbUwtbDZlS0tMWDZhcncwdTN0QkpfNGJ2bWpsOThGRHlOMkZUTHdNQWQxT0hXT08zSXdQbElrVHV5VzgxczZwYzNKSzJKa01fYWFmSGNSd0FVZk03bk1uRjZFUE1BNjNCVdIB3AFBVV95cUxOejExVFhuSXdnTndxWXJzM3JMRXI2NlUwV2N5MTR3dFBPNVRZM0VCaXlaZWJ3cGJLYkkzUm8tRWZCSTZwZHJVNkpobGYyLXJSX1lLX1pzR2xWaGUtTlJURXJKN0ZuQXVCeTRMVnMyLVNDdTduUlVrZW82MTItSVczUjIzRDdvOTlKVGNTWlBrNGFuQ3NXWW1qeUQ2UjVvMEJaQlhNS0trcEZObVR2My03SGJFOXdFVlVpZ0NUQnR2TUZfUzNhV3dWNWR5dlM0MnVWSG1xbEZ5UjhqRVRl?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 629,
    "word_count": 100,
    "gnews_title": "Stock Market Highlights: 23,400 breach needed for Nifty's bullish turn. How to trade on Monday - The Economic Times",
    "published_date": "17/01/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 23",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open lower on Thursday tracking mixed global market cues. The trends on Gift Nifty also indicate a negative start for the Indian benchmark index. The Gift Nifty was trading around 23,137 level, a discount of nearly 60 points from the Nifty futures’ previous close. On Wednesday, the domestic equity market ended higher amid short covering, with the Nifty 50 closing above 23,150 level. TheSensexrallied 566.63 points, or 0.75%, to close at 76,404.99, while the Nifty 50 settled 130.70 points, or 0.57%, higher at 23,155.35. Nifty 50 formed a small positive candle on the daily chart with lower shadow. “Technically, this market action indicates an upside bounce from the lows. Though Nifty 50 closed higher on Wednesday, the overall market breadth deteriorated and the broad market indices have closed sharply lower. The negative chart pattern like lower tops and bottoms is still intact,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities. According to him, the underlying trend of Nifty 50 remains weak and the market seems to have shifted into a broader range of 23,000 - 23,400 levels. “A decisive move above the hurdle of 23,400 could open renewed buying participation in the market. However, a slide below 22,975 could open more weakness down to 22,800 ahead,” Shetti said. Derivatives data indicated the highest call open interest at the 23,300 and 23,500 levels, while the highest put open interest was at 23,000, highlighting a tightly contested trading range. Overall, the market sentiment remains positive as long as the Nifty sustains above its key support level of 23,100. A decisive breakout above 23,300 could trigger further upside momentum, said Mandar Bhojane, Research Analyst at Choice Broking. Here’s what to expect from Sensex, Nifty 50 and Bank Nifty today: Sensex witnessed a recovery from lower levels, and ended higher by 567 points on January 22. “For day traders, 75,850 would act as a crucial support zone. If theSensexstays above this level, the pullback formation is likely to continue. On the higher side, the market could bounce back to the range of 76,700 - 76,900. Conversely, if it falls below 75,850 the sentiment could change below the same it could decline to 75,600 - 75,500,” said Shrikant Chouhan, Head Equity Research, Kotak Securities. Nifty 50 showed high volatility with positive bias on January 22 and closed the day higher by 130 points. “Nifty 50index took support from the lower Bollinger band and bounced, owing to the HDFC results. The index also took support from the 23,000 level, which is the immediate support for the index. The index has formed an inverted hammer candle, indicating mild bullishness in the index, however, any bounce can be used to sell the index until the 23,800 level is not taken off. The momentum indicators are well below the oversold region, which can act as a reason for a bounce in the index from the current level,” said Dr. Praveen Dwarakanath, Vice President of Hedged.in. Options writer’s data for the January monthly expiry showed increased writing of the calls at the 23,000 and above levels, indicating a weakness still to continue in the index, he added. VLA Ambala, Co-Founder of Stock Market Today, is of the view that the Nifty 50 can expect support near 23,050 and 22,950 with resistance at 23,370 and 23,410. Bank Nifty index gained 153.50 points, 0.32%, to close Wednesday’s session at 48,724.40, forming a Dragonfly Doji-like candlestick pattern on the daily timeframe. “Bank Niftytested its support at the 48,000 level, however, it bounced owing to the HDFC results today during the markets. The index has formed an inverted hammer candle, indicating mild bullishness in the index, however, one can sell the index on a bounce until the index manages to break the 49,600 level. The momentum indicators are in the oversold region, which can be a possible reason for a bounce in the index from the current level,” said Dwarakanath. Options writer’s data for the monthly expiry showed increased writing of the calls at the 49,000 level, suggesting a weakness in the index, he added. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-january-23-11737571678179.html",
    "original_url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxNY1g3czBTcl94WUN1MnJEUnBGZVU2YUg1NzhDcTQ0OW0xRzlQZHIzM0pJWHJUa0lELWxUcV94NnpUTmFwc3h3OGQzd1pjNGtvUGVfNlVVYkZneXZvWlhEOEhuQTFYX3p3YnU1TVJXamE0LUgxWmdveVhRSE9wTGpNSFlFb0V6eVdmR25nVnI4clQzbGxXYzcwVUxSSWhqdUhnVDY1RDh6SHlVdWwySjAyZmdmS1BuWVNNMGZwM2oxN3p4b0ZlX0I0LVFUUUJ1U0JEWlVrM0VpM0FyTFByaDM1M3lhclB2VWF0dnfSAe8BQVVfeXFMTmhOSVIwWENOeHlwOFRYZ1MwQzdzdzZrU0lBaGQ2TGI3a2JTaWRnN2RUankzaDY2TFpCVDVzTWRON1hCMzFzXzd2TllTNlZwSGttdzYwOHhFckdScXZyV19LR0ZiQU56WklzVHIzX0ZtMGNnRnJQRm5INTVNWkVpVjI3YzJnU204WVUxSEJuaFdJVHVXTEFMVzBFNEl4S3k1aE1nZVVuZ2k4SUlLS1VCVnZWemZISjVWb2RqTGg4NFB0X2NLZjItcU9TSHFtc3QyOS1hWU40dTV0aWIwdlBHbHJxUm1udXQtMUQwN0VwVVE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4616,
    "word_count": 751,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 23 - Mint",
    "published_date": "23/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market today: BSE Sensex ends over 400 points down; Nifty50 above 23,200",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 8 unique study breaks that help you learn better and focus more 8 unique strategies to learn to speak English fluently 8 Revision Tips to Cover More in Less Time for Board Exams 8 interesting tricks to master grammar rules effortlessly 8 creative strategies to stay focused and motivated while studying Get Better Marks with These 9 Study Habits 8 non-STEM jobs that could make you super rich 8 Effective Ways to Enhance Your Memory and Boost Brain Power Top 10 highest-selling motorcycles in December 2024: Hero Splendor, Honda Shine and more 8 proven strategies to score 90+ in Board exams A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-17-2025-dalal-street-indian-equities-global-markets/articleshow/117317439.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxNVHpiWmdvX0NRUXVUd21oY1dMMEhXalFIdmhqdUptVDVmSXQzTHo5Uk5EWm1VVzhYaGhMWUZSVzAzTW5HYjRTNEllM3FyS09KYTM3a3hXc0Z1LWdWZFZsS0JlZFhlWjFtSHI1UFl0OFdUb3pnUFdqRVJwSGFTRWdMS1ZhMy14a3BiazdoUmpwdnJXNHNVR01TZlRCcTl3WVhENHAzYTN6Wm9LVXR2TFQ3YUtramZQVWRNMXktLVhadHRlNzVNSlNhYWlPUk4tUkNXd21hSHlnaG9FVkxkX3ZnR0cySE9kNm5lUllvWVNpOXI3b05tX1lFMUl5d2h3OWlETWRDbnNzZjRZR25fSV9HadIBlgJBVV95cUxPX2dvbjFIeGU1YUhBN0t2clp3QVNOSjhoTzhIM0JsNzR5OVU5VVloUGM0eUpyeFEyaEg0TGJ3clVCNmk4djZkZGx3WEluUVlwcExXcTdpR0Z3aEI2a1dVVG41QzFXTkNSbFlUcmVWSll2Xy1nNjFfaFZkczh6M1hJdkxhU29iU2FMc0JxdnNmLW82eldQYy1hSWRKczh6Wml4bHQ2bmhYaXI2QTJfY0g5aE9HdGhrQlI2YUZKVGNlY1dDZF9SbWdYdTdGWmVNSldMNk9FLU1zeXM2RDltSUFLZFItYmE1M1JMZkw5OXBMbzI5N21fLUpycW1MenUxOE1iOVVkUGdJSjR3WXNNZGFMUVRDOWsyZw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3752,
    "word_count": 641,
    "gnews_title": "Stock market today: BSE Sensex ends over 400 points down; Nifty50 above 23,200 - The Times of India",
    "published_date": "17/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  }
]