[
  {
    "title": "Stock market crash today: BSE Sensex ends 857 points down; Nifty50 below 22,550 - top reasons bears growled",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Chitrangda Singh wows in beautifully crafted salwar suits Top Samantha Ruth Prabhu movies to watch 9 reasons to have black coffee in the morning 10 animals with a bone crushing bite How to say 'No' to kids without saying 'No' Hansika Motwani exudes grace in stunning ethnic wear Madhuri Dixit proves less is more in this exquisite saree look 10 times Shweta Tiwari beat daughter Palak Tiwari in the game of saree How Varun Chakravarthy worked on his physical and mental fitness for ICC Champions Trophy A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns...",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-february-24-2025-dalal-street-indian-equities-global-markets/articleshow/118518878.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikgJBVV95cUxPbmtFREtRZEFBSnhXcUd3cmRwMXdqdjV3WmJNbllYUmZnSmE2bkRQcEpDMkV3VkZBYXdFbDREVEZKMnBnRjRNYUlTUHFtcHFkaVpYS0tyNDlDd0JRNFdPNVdTMUM0X0EybXFPWEpnTG91eVUyTkE1cFQtSC1uUjBOanF2NUE0bnBmTXJNUHJvQVBYVkpUS2ZoREVxQXg5MHZ0OWV5WGNBQWlaYVM0bkg2TW9oSllOTE5mak1zVE5jUjFmRWs3bXJWSXN3SnNNM0NPWDRpYTZTR2Z3NHVMRG1OUS12TXpQaXhTVmwtU1hJbHlDdVhaTnBWRzJXX3ZNNlVrRUhSZWRlc1lPVm1PNFNvTlFn0gGXAkFVX3lxTFBIQ1c2WEVoS2EtdFBzbGk2aU5UQzVBYjJTbXlIYkFHcldOTDFwYVlTalhnUTRfQXBIeUpSSUppbjFxQ3YyWlZTNTJ1MWlpazltOEFYRVU0UnE3NW5vODBMOS1MNUw2V1J4anZlZHhpb0h4cFA3VTk3SXlXNy1rTmc0SGZsLUo3Y3BBTkpWX1AtSmVJMG4yc1haR2xCTDRNT3Z5WXh1MHNYU2RtVVduelhxRWxleFpkMmlmRmtzUW9SdzVfLUNseXRvNWVDTFc0RTc4eFduTUNNQmxkZllHWTFjOEFzb2R5VE9MUXltUW9fV2pVb04tXzlfRDNPSGk3azZmcVVzRnpCU1NBZjNab0M3S0NtcF84VQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1673,
    "word_count": 274,
    "gnews_title": "Stock market crash today: BSE Sensex ends 857 points down; Nifty50 below 22,550 - top reasons bears growl - The Times of India",
    "published_date": "24/02/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex, Nifty 50 end lower— 10 key highlights from Indian stock market today",
    "body": "Indian stock market ended slightly lower on Friday, May 30, tracking mixed global cues. The Sensex closed 182 points, or 0.22 per cent, lower at 81,451.01, while the Nifty 50 settled 24,750.70, 83 points, or 0.33 per cent, down on the first day of the June futures and options (F&O) series. Thus, the key indices extended losses to the second consecutive week. The mid and small-cap segments ended mixed. The BSE Midcap index fell 0.39 per cent, while theSmallcapindex rose 0.17 per cent. The Nifty extended the gains to the third consecutive month, rising nearly 2 per cent in May. However, the index has been consolidating in the recent past due to stretched valuations and the lack of fresh positive triggers. \"Participants are now awaiting a fresh trigger to break the consolidation and resume the broader trend. In the meantime, one should align their trades with sectoral trends and themes that are attracting noticeable interest,\" said Ajit Mishra, SVP of research at Religare Broking. \"We recommend maintaining a 'buy on dips' approach, unless the Nifty decisively breaks below its first line of defence—the 20-day exponential moving average (DEMA), currently around the 24,600 level. A breach of this level could increase pressure and extend the current consolidation phase,\" said Mishra. Investors remain cautious amid a lack of fresh triggers and due to the uncertainty surrounding Trump's tariffs. A federal appeals court on Thursday temporarily allowed US President Donald Trump to proceed with his tariffs, a day after a US trade court had blocked them. Meanwhile, reports suggest India and the US are aiming to close a trade deal by the last week of June. However, the shape of the deal is still unclear. \"A rangebound movement continued in the market, with the temporary reinstatement of US tariffs by the appeal court influencing investors to stay sidelined,\" said Vinod Nair, Head of Research, Geojit Investments. \"The global market may contend with macroeconomic concerns as the global trade landscape has yet to see stability, which may navigate a short-term consolidation,\" Nair said. India's Q4 GDP prints are due today, which could influence market sentiment. Next week, the RBI MPC will announce its policy decision. Moreover, the progress of monsoon will also be on the radar of the market. Only seven stocks managed to end higher in the Nifty 50 index. Shares of Eternal (up 4.98 per cent), SBI (up 2.09 per cent) andHDFC Bank(up 0.73 per cent) ended as the top gainers. Bajaj Auto (down 3.10 per cent),Hindalco Industries(down 2.51 per cent) and HCL Technologies (down 2 per cent) closed as the top losers in the index. Most sectoral indices ended with losses. However, the Nifty PSU Bank index soared 2.88 per cent, ending as the top gainer among them. Nifty Bank rose 0.37 per cent, while the Financial Services inched up 0.08 per cent. Nifty Metal dropped 1.69 per cent, while the IT index declined 1.15 per cent. Nifty Auto fell by a per cent. Vodafone Idea(70.12 crore shares), Suzlon (54.76 crore shares), andReliance Power(53.4 crore shares) were the most active stocks in terms of volume on the NSE. Reliance Power, Rallis India,Lords Chloro Alkali,Manugraph IndiaandAro Granite Industries, were among the 17 stocks that jumped over 10 per cent on the NSE. Innovana Thinklabs,Kiri Industries, SKM Egg Products Export (India), Prakash Pipes, Signpost India and Welspun Living were the six stocks that plunged more than 10 per cent on the NSE. As many as 100 stocks, includingReliance Communications,Godfrey Phillips India, Senco Gold, International Gemmological Institute (India) and Wockhardt, hit their upper circuits in intraday trade on the NSE. On the other hand, 71 stocks, including Orchid Pharma, ITI,Indo Tech Transformers, Kitex Garments andCoffee Day Enterprises, hit lower circuits during the session. As many as 1,299 stocks advanced, while 1,581 declined and 75 remained unchanged on the NSE. As many as 109 stocks, includingSolar Industries India, Max Financial Services, Indian Bank and Indian Bank, hit their 52-week highs in intraday trade on the BSE. On the flip side, Signpost India, CP Capital, Dr. Agarwals Health Care,NIIT Learning Systemsand Orchid Pharma were among the 43 stocks that hit their 52-week lows on the BSE. Read all market-related newshere Read more stories byNishant Kumar Disclaimer:This story is for educational purposes only. The views and recommendations above are those of individual analysts or broking companies, not Mint. We advise investors to check with certified experts before making any investment decisions, as market conditions can change rapidly, and circumstances may vary. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-nifty-50-end-lower-10-key-highlights-from-indian-stock-market-today-11748599068888.html",
    "original_url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxQLTZUUGFudDBwNWR3bXBXUWNCYXRiYlJrNEFFa1A1UFBjVl9sdUdRV3h3LS1oekhxLXE4Um9HQ01QU2xRcDRLVkxHSmJEVmhwV1VqbWJId1BZWUNmWjRUQmVHQkd3VDVaWkVGMEFuUGY3dEpGR2REYnlzajBGMjF4VERveEIxcVpVeUVrYXpHbkktZTB6Y1EzcFdWbFFINDJLbUxESmVyOVBrYjFhMUFaaVFNQVVfNE5zOHpiRGotOWZNRHdIUFQ4ZEN4WjliTEE5NjZXdWUxQXQ5U0FP0gHiAUFVX3lxTE55NWJSbFVpVFl3UUE3TUdMNmhjb3UtX1dJQTFNNUxwQUlUTE5jN084dW5HRXRlYW9uX0NsZVdQSmU5bEp0NTRDcjJiRldkWnZLMnp6aWJIVTZwZE1ILVFjZHFqdHhBeDNuTGVnS053LTdpRW13UXRDMVNyRXNId3RjTS1LSHFvckdCSlRQSGh6TE5vWnpZMVQ3dE5waDVSX2c4Vy15cnFQY3p1QmZzdkFBa3B6TzBuOEw1NzRWcmprMmZDZFJ0TTNZdDA5VlYyNTh3UjBKOHNRc2M3WGlwLVZ4NlE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4884,
    "word_count": 777,
    "gnews_title": "Sensex, Nifty 50 end lower— 10 key highlights from Indian stock market today - Mint",
    "published_date": "30/05/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market crash today: Nifty50 ends below 24,750; BSE Sensex tanks over 570 points - top reasons for fall",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 8 daily habits that boost student mental wellness 9 unique animals from the monkey and the Great ape family Rashmika Mandanna Reinvents Elegance with Effortless Simplicity Top 7 crystals for attracting money, wealth, and abundance Palak Tiwari's unmissable sarees and trendy blouse designs 8 unusual quotes from astronauts to intrigue students about life in space 8 winning habits that help students crack competitive exams without burnout 8 real-life skills that matter more than grades for students’ success Deepika Padukone to Shraddha Kapoor: Skincare secrets Bollywood celebs swear by Isha Malviya’s Top 10 Glamorous Looks Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-june-13-2025-dalal-street-indian-equities-global-markets-israel-iran-strike-us-china-trade-deal/articleshow/121816971.cms",
    "original_url": "https://news.google.com/rss/articles/CBMiwAJBVV95cUxObDBCNjNGbGNnX0lCRjV1NlNEOWV1eGlLd0tCLWtJUEhfbmNoeHFJLVlUWlEtd3d0R2Y3VXpVUE1EWlNCVlVtZlEyUnVpdUpUeUY5UWpkN3o4dmhLdHdjNklKeGthalBMZjVPdW5jYV9jNmJCazN3M0pvUWYweDluWi0xWXJHd0xJWjlMRjY3WWFGV3NWQi1ZNThjc054Tk1vS2lSbTFOS3FobkRPNFdiSVB5Z2FjeENLTWR1X181Y3hCZXJHNWtzRFgxYWdyWDEyVXBTQmRwcHhEVVBTN1NubXR2MDNReW5XSW1KcTMzeGdBRi1sUkFoeXpsN09QZ3JsTEhxNFlXVUY0UDBFNU9TbmktMEJTN01jNHNHWDY0bVotclludUhEa250ZlJFYXh4ZVBSZG8tRGNTLUJvNXFXOdIBxgJBVV95cUxNVkxKMjNZa2N6ekVRRDBWZThkYk4yejFJYTI4b3ZmenJFOXhUbmdocHlraUNvVGE3clpsb0JFNWJBM3AxR1ROMURzMFNSbGF5MU1JbHBVREs3Z2NKazNYWWdBQWhLVXNCbXVMTnc4bms4WnJrVHIySlBfU2VPWXhOWDJWdkJoVkpsWTlGcDY2NDBkOVN4QndmVFNZYlpZcVpYSHFHVkVmQ0h6M0s3ZnJnWmZrT3BJOVBOVWd0eUVLV3R5djAzYWdPNW1nUndKSEhxUEVDM21Qb0RmMWtHV3pJNnFLbFk0M0RVZG1SSnhWLWJlYUNxeVRsdkNVVGRfRF9ZVFFfMjB1eXQwbmJJZlZ1M0NRZ2I2NkhSSTBNaHZ4cDktMjc3VENiRVF4dzhZWnJuSm1ibEZWRGQyR0JTT21OdGJPVTNDUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1656,
    "word_count": 256,
    "gnews_title": "Stock market crash today: Nifty50 ends below 24,750; BSE Sensex tanks over 570 points - top reasons for f - The Times of India",
    "published_date": "13/06/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex, Nifty 50 end in the red— 10 key highlights from Indian stock market today",
    "body": "Indian stock market benchmarks- the Sensex and the Nifty 50- ended lower on Tuesday, June 17, on profit booking in select heavyweights, includingHDFC Bank, Reliance Industries andBajaj Financeamid weak global cues. The Sensex ended the day with a loss of 213 points, or 0.26 per cent, at 81,583.30, while the Nifty 50 closed at 24,853.40, down 93 points, or 0.37 per cent. Mid-caps and small-caps segments underperformed. The BSE Midcap index fell 0.56 per cent and theSmallcapindex declined 0.67 per cent. The overall market capitalisation of BSE-listed firms dropped to nearly₹448 lakh crore from nearly₹450.5 lakh crore in the previous session, making investors poorer by over₹2.5 lakh crore in a single session. The domestic market ended in negative territory amid heightened concerns over tensions between Israel and Iran. Investors also restricted their bets ahead of the US Federal Reserve's policy decision on June 18. \"The benchmark equity index experienced moderate losses amid rising risk of an escalation of conflicts in the Middle East ahead of the FOMC meeting. This uncertainty pushed Brent crude prices higher—an unfavourable development for India, given its heavy reliance on oil imports, thereby dampening earnings growth,\" Vinod Nair, Head of Research, Geojit Investments Limited, observed. Only 11 stocks managed to end in the green in the Nifty 50 index, among which Tech Mahindra (up 1.66 per cent), Infosys (up 0.87 per cent) and Asian Paints (up 0.86 per cent) ended as the top gainers. One stock- Wipro- ended flat. Shares ofAdani Enterprises(down 2.31 per cent), Eternal (down 2.06 per cent) and Dr. Reddy's Laboratories (down 2 per cent) ended as the top losers in the Nifty index. Barring Nifty IT (up 0.72 per cent), all sectoral indices ended lower. Nifty Pharma (down 1.89 per cent), Healthcare (down 1.79 per cent) and Metal (down 1.43 per cent) ended with significant losses. Nifty Bank (down 0.41 per cent) and Financial Services (down 0.39 per cent) also ended lower. Vishal Mega Mart (116.13 crore shares),Vodafone Idea(26.42 crore shares) andKBC Global(22.70 crore shares) were the most active stocks in terms of volume on the NSE. Eight stocks, including Cinevista, KBC Global,Kshitij Polyline, Birla Cable andSterlite Technologies, jumped over 10 per cent on the NSE. As many as 91 stocks, including TechEra Engineering (India), Cinevista, MMTC, JNK India and KBC Global, hit their upper circuits in intraday trade on the NSE. On the other hand, 70 stocks, includingSuven Life Sciences, Sky Gold and Diamonds andReliance Power, hit their lower circuits in intraday trade on the NSE. The advance-decline ratio tilted towards the decliners. While 939 stocks advanced, as many as 1,946 declined, and 76 remained unchanged on the NSE. Some 79 stocks, including Bharat Electronics (BEL), Aditya Birla Capital, Max Healthcare Institute, Muthoot Finance and Solar Industries India, hit their 52-week highs in intraday trade on the BSE. On the other hand, 48 stocks, including Aditya Vision, Ganesh Benzoplast, Navkar Urbanstructure and Protean eGov Technologies, hit their 52-week lows. According to Shrikant Chouhan, the head of equity research at Kotak Securities, a reversal formation on intraday charts and a bearish candle on daily charts indicate temporary weakness. \"We believe that as long as the market is trading below 24,900, the weak sentiment is likely to continue. On the downside, 24,775 would be the immediate support zones for traders. Below this, the market could slip to 24,675-24,625. On the flip side, above 24,900, the sentiment could change. If it moves above this level, it could rally up to 25,000-25,100,\" said Chouhan. Read all market-related newshere Read more stories byNishant Kumar Disclaimer:This story is for educational purposes only. The views and recommendations above are those of individual analysts or broking companies, not Mint. We advise investors to check with certified experts before making any investment decisions, as market conditions can change rapidly, and circumstances may vary. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-nifty-50-end-in-the-red-10-key-highlights-from-indian-stock-market-today-11750153895338.html",
    "original_url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQeEM3d2t0Vl9aa0k1bTdMcFBrSXVjMzN5ZlVVWUJYYzZ2NjRzTHFvcDNtcmprT3M2ZFFlVzJGRTMzV3pUMzNEa3VPUHNRLW5NMHVkSTF5emd1TTNmM0x4T0hWZENuRGpaUGJOVzQtSFBNTXh1OGxQcVZBTDgtMTFWQ1VSaWFLT20tZW1NZUw5dXhZY0pnVlU0S09xUlMxaDJrSGdlRXdDUWVaZ1JKY1FSTnI5ajBobFpNUVBrQkItMUNJbGpFY2JteXpzN21MVmR6ankydmExY0MyamVTeFFTNGJBONIB6AFBVV95cUxNQUMwcWtPQmJjbUJuc3V3SmtUQUhQYXdLUWhZdXF2d19RRXg3ZWswRUl6VzItamFtbE5LeFNqdGFhOTV2Q01uYXhIOTd4Ulg1cWZvSUpwdGFZbmFvYzhodW9HSzk3bEV4bDFNTUh4T1VXOXVBTDluUU90dVNYTWY4U2d2M3Y0MlhVUTZBRkFVME10YVdRUWJaTmx4V19mMkE1QjNWQ1ZWaUxhU2ZoYTdxLUN4Uy1yQmFqZnc1QUFwSlBjWnFzSEM4S1ZERkZmOXFVZWJnb05fZ1phM1FRemUxcjV6Q0QzTWtZ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4283,
    "word_count": 666,
    "gnews_title": "Sensex, Nifty 50 end in the red— 10 key highlights from Indian stock market today - Mint",
    "published_date": "17/06/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Why did the stock market rally today? Nifty50 ends above 25,000; Sensex 1,200 points up - top 5 reasons investors are richer by Rs 9 lakh crore",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 10 animals that can live for days without water 10 ways to add baigan (eggplant) to lunch/dinner The White Edit: Celeb Looks That Redefine Chic Samantha Ruth Prabhu slays in stunning saree looks 8 places in India perfect for Astro tourism Alia Bhatt's skin care routine, simple steps to beauty for every diva Underrated skincare hacks to steal from your mom’s beauty regime 9 lesser-known hill stations to explore in South India this summer Shivangi Joshi's trendy picks for Summer Radiant snaps of Aishwarya Lekshmi Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/why-did-the-stock-market-rally-today-donald-trump-india-us-trade-deal-nifty50-ends-above-25000-sensex-1200-points-up-top-5-reasons-for-bulls-party/articleshow/121186778.cms",
    "original_url": "https://news.google.com/rss/articles/CBMi0gJBVV95cUxOcGZfcDZFQVlYcU1jSWNuWWVZZmtWbzhmSWpkQWU0a19vblJEM3BVVEc1LUp0UDdjaFZLbzAwSnpkLWVmMDV2aWVncmRQdmJhNXFQSW1vYThlOXZqSHJVN0pZNjI3cU1DM2RUNVRQeXZ6MW5sOXVPM3RSN0N3LXdLUFd0RmtoM0tLdEI1RG9EYXkycW50UmtVSi0yaFNMUGg5ZjVWNlBDTVN5c2pLVVlJODJqQXhRZXNsejFnN29TNGgwd3MzT21jaXo4MkJpZ2xLR2FVQV9QM2hNZEhKZU4zZE83NHFVZWxYaVFHT2RIbW5Gbk9UZDl4YWRtS2hpcUdPVjU2SnlBdjJyalJ3akh6Z3dKNG9uazlOODNXTjJGSDF0NFhCTmxaSlpqZ045SGE5RmJoOFpXRDlUcXlxdERnZjJpbk9JMmtJb0g5THpBRk1FUdIB1wJBVV95cUxPSVpsNzNnQkxMcVF1VVVvS2xweW5Gc3FFbHdubnFaLUFaT2hPb2Q5bW9hb3I0TlhiQ2xYXzUyR2E1dEEtU0RzQUpKX1lSN2duVmk2UGZ1aDRaQi10cVZFZjlTMDlhMmh0OEZ5cGVFVC11ZElhNWJqM0UxeEpqT3NIbnY2WHZhSkNOUU1ScEk0dUZaNTlpLUJYbzJhRmhJdXozbHIwRFB6TElpLU50OTAxaDlYNGxYRU5DZGhFQnZTcURXemtRcjNZOFZjVkhoMUdPR1JudUtYM3d6U3dpSVFjWThURWFnQXB5cFBaODBFb2R2enU5OVgyQzZmZXRJbldNcWFXbzR5eEZwUC1QVDFnTTZzcS1RX0V1dlF0QmtlRXpwODBoQnFZRDk0eTJDcVh3TmNSNEhOQTZ2T01RZ1JHZm5qZHQ3UWZNclpCSmhnTVRnUlpKZmdZ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1545,
    "word_count": 247,
    "gnews_title": "Why did the stock market rally today? Nifty50 ends above 25,000; Sensex 1,200 points up - top 5 reasons i - The Times of India",
    "published_date": "15/05/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Indian stock market: 5 key triggers that could drive Nifty 50 to 26,000 in the short term",
    "body": "The Nifty 50, the benchmark of the Indian stock market, is hovering near 25,600, eyeing a reclaim of the 26,000 mark. The index is now about 3 per cent down from its all-time high of 26,277.35, which it scaled on September 27 last year. Amid global turmoil, tariff-related concerns and weak earnings, the domestic market has performed well in the first half of the calendar year 2025 (H1CY25). On a monthly scale, the Nifty 50 has been in the green since March this year. \"Nifty has managed to absorb most of the negative news in the last two months, from wars and geopolitics to the tariffs. While that was happening, global liquidity was rising. Whether you consider US M2 (measure of the money supply) going higher or the rate cuts in Europe and India. This has kept markets elevated and hopeful that the earnings slowdown will revive into the year-end,\" Rohit Srivastava, the founder and market strategist at Indiacharts.com, observed. The index is expected to scale fresh record highs in the second half of the year, as the medium-term outlook for the market remains positive, supported by the country’s healthy macroeconomic fundamentals and expectations that tariff-related uncertainties will recede. Let's take a look at five key factors that could drive the Nifty 50 to 26,000 or even to uncharted territories in the short term: Investors are focusing on the India-US trade negotiations as the 9 July deadline approaches. So far, only two countries—China and the UK—have signedtrade deals with the US. India and Japan are expected to be the next countries that could strike trade deals with the US. On Friday, Trump said that the White House was looking into anagreement with Indiathat would give it the “right to go in and trade” with the country. Meanwhile, a PTI report, quoting sources, suggested that India-US trade negotiations for an interim trade agreement are progressing well. A favourable trade deal could boost market sentiment, propelling the Nifty 50 to fresh highs. \"One big kicker for the market is the long-awaited US-India trade deal. A lot is expected, and more than anything else, expect the uncertainty to die. Business will be back to normal,\" said Arun Kejriwal, Founder of Kejriwal Research and Investment Services. Q1FY26 earnings are expected to be better due to lower inflation, three successive rate cuts by the RBI and healthy macroeconomic growth. \"The larger section of companies is expected to benefit from three successive rate cuts by the RBI. The impact of the first two cuts will be felt on corporations' bottom lines, which should help in better earnings,\" said Kejriwal. Healthy earnings of Indian corporates will ease the concerns over elevated valuations and drive the market to the 26,000 mark or even beyond. The IMD has predicted an above-normal monsoon this year, which is expected to keep food inflation under control. Lower inflation would raise the prospects of further rate cuts by the RBI and reduce input costs for corporates, thereby augmenting their profitability. A healthy and evenly spread monsoon will also underpin market sentiment. G Chokkalingam, the founder and head of research of Equinomics Research Private Limited, pointed out that cumulative rainfall is also in surplus so far. \"As of this morning, cumulative rainfall as of yesterday in June is 8 per cent above the long-term average rainfall. This is a highly positive development for the markets. It can help the output of the agricultural sector to grow significantly and thereby help the overall GDP to grow faster,\" said Chokkalingam. \"A successful monsoon helps in moderating or keeping in check crop prices, and therefore inflation rates tend to remain modest. Already, bothretailand wholesale inflation rates are at record low levels. Therefore, a good monsoon would help in the continuation of the reversal of the interest rate cycle in the economy. The same would help both the economy and corporate world to gain from improvements in aggregate demand in the system,\" said Chokkalingam. The dollar index is hovering near its 52-week low. If it remains in this lower range for an extended period, it could potentially trigger healthy foreign capital inflows into the Indian market, driving it to new highs. \"We are looking at 28,000 by the year-end with the potential of upward revisions as markets price in a move to a dovish Fed in 2026. The falling dollar will drive better inflows into emerging markets, and India stands out as a winner there as well. A good monsoon and lower interest rates should create the growthmomentumfor this year,\" said Srivastava. Experts say if the index holds above 25,700 decisively, it may reclaim the 26,000 mark soon. According to Jigar S. Patel, Senior Manager of Equity Research atAnand Rathi Share and Stock Brokers, the 25,700–25,900 zone is likely to act as immediate resistance. \"A convincing breakout above this range could pave the way for a new leg higher. However, any close below 25,300 would signal a failed breakout,\" said Patel. Kejriwal said that the Nifty 50 index won't climb to the 26,000 mark quickly without supportive news flow. On the support side, Kejriwal said the 25,200 mark would act as strong support. Read all market-related newshere Read more stories byNishant Kumar Disclaimer:This story is for educational purposes only. The views and recommendations above are those of individual analysts or broking companies, not Mint. We advise investors to check with certified experts before making any investment decisions, as market conditions can change rapidly, and circumstances may vary. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-5-key-triggers-that-could-drive-nifty-50-to-26-000-in-the-short-term-11751266111542.html",
    "original_url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxQTHQzZGhpWGhROWlHY01KSGNVQ3VUckIyU0FUa0YwUnB1VkNKV2E2X29GWlNKU1M5M05hMFhvTXpZeHhEbXBOblJ6QVpLYVNhLWFSS2JsaEMwRm9NYmM0VFBESnl6Q1B5VEJBXzZTOEhTQXMxSWk0cVJmbXJZUl9KTElrbWpCMGQ0QnE3VFNSeldpNmo3V1JxMzNseENadE1FUWRRZVlYSkNSYWhOcTRQaWVGV0RaN0Y4X1dmU2k5dGttR29yV01qbEJaMkQ1SFRKOXozRTNrYTV1V0JVLWRsVDV2bXEtR1BnWDBlNkM2Z9IB9AFBVV95cUxNV3JCYzRoUXZzZGhKdkVyQ1Y4NVRiTUtVcXhaZXZVd2NHbnlEdjN6amNZSTVzc1hvMWl1MjBnTkxLdldlMGRfVGp3R0hNbURzbldNcEF2MFJyazBqRmVuVTZzbElWeHV6SmhxQ0M2VHZna1I3VXBjNEFsbmJvRzRCbmU2bmtEZk01R3pULWhNR3lwdTFFSTlaZXNpSEIxWU9ZR21nYmtkVmhreFMtdE5hZ2l6c2MzWGhaZldkeHNxQTRSRDBXSzZiYks3b0RLUEVUS085NFNFT0NrN0NjSmNXN2pBOTQ2YlBhYTB2TVlibjNVZ1Fs?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 5805,
    "word_count": 942,
    "gnews_title": "Indian stock market: 5 key triggers that could drive Nifty 50 to 26,000 in the short term - Mint",
    "published_date": "30/06/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Will Nifty50 cross 23,000 next week? Key market factors to watch as recovery picks up steam",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 9 reasons to add makhana to evening snacks Alia Bhatt’s golden glam: A mesmerizing blend of elegance & shimmer Traditional yellow-hued sarees approved by Bollywood queens for Ugadi 2025 How to support your partner through a personal loss 6 zodiac signs that are ready to face every challenges in life Baby names inspired by classic tales and fables Deadliest scorpions lurking in the world India’s top 10 pilgrimage cities for spirituality seekers 10 quotes by Japanese author Haruki Murakami that can change one's perception of life Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-outlook-will-nifty-50-cross-23000-next-week-key-stock-market-factors-to-watch-as-recovery-picks-up-steam/articleshow/118821525.cms",
    "original_url": "https://news.google.com/rss/articles/CBMiqwJBVV95cUxQNHcxczJuUm9UODQtV0laUmUzd2JLdldCOEdWaU4wbERNdk9VQVdTUDFKUk03QmkwcXpHSmhjX2dlUklWcm1uQW9kc2otV0ZnRFF6YmQxRDNpdHhWOEZMMU1pSk9neEhQU2kwcmtKYWlBN3A2Yk1Wc1Y5QlBoNTc4Z1FsNVZfTm9JVEh5cVcxQmd0Q2cyNGNTZG1ZeHhmOGUwYWhyNm9yN2pKVGc3Q1JvT3lwVDhJc0tHY3dvWk5oang1ZjdvVXgwVEpEMnZJbDM0bGpCby1KQldUUGEzbURnX0MyVk15dkJVMEdWZ2NOT3ZScTFVcGlOSXhUOHFjWlFqclJIRlpESjdnTVBQQUpjSGlnUFdxSi1zSXJsNm9XT24yT2NaMXBESl8tUdIBsAJBVV95cUxOeHFwenJIbTNCUXc4UjJRQlNNazNRQ0tqelNMQ0xZSk9DMHpsRXdhVm9aMkptbWxIQXZpZFFVeEJMWk5SaWhjZDcyUVRIbEctU0U0QXZfaE5mWFIxb0hGTnpGSnQyc2FUWEs3bFpReUN1UWdOVnlNQUlaMmhNME9JekV3cnpXSS1uenlxT0lFVnI5ZlUzM0Z0bGo5UDJCb1hhS2hXQy1KdXJ4OEF5RnpRQWtqODlpQnFLNzlIYmtNSWtfTTZ4WkhSbzdzb3JXMzE3UHczN0dlTHh0V1hqQXJTTWkwN1VHYUlZQ0dVWHg1cmlobVhvampORklZUG1ycnV6V3ZWcnAtczdZT2hDS284T1hxejFpckw5cWRuWkk2TUJnWFgxcUYtQnNCUjFqVEpX?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1562,
    "word_count": 248,
    "gnews_title": "Will Nifty50 cross 23,000 next week? Key market factors to watch as recovery picks up steam - The Times of India",
    "published_date": "09/03/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  }
]