[
  {
    "title": "Nearly 50% of Nifty companies trading at a discount; should you buy or stay put?",
    "body": "Despite being a fair distance away from record-high levels, Nifty's slow but steady rise toward 12,000 is good news for the Indian markets especially as more than 50 percent of the stocks in the index are available at attractive valuations. About 23 companies, or nearly 50%, of the Nifty50 universe is trading at a discount to their 10-year P/E multiple, data from Motilal Oswal and AceEquity showed. These includeTata Steel,ONGC,Coal India,NTPC,JSW Steel,IOC,Gail India,Axis Bank,Power Grid, among others. Even though the valuations appear mouthwatering, the questions remains– should you buy around these levels or one should stay put or avoid getting into these stocks altogether? Investors must note that even though these stock appear attractive based on numbers, the fundamentals may present a different story. Most experts we spoke to opined that investors should tread cautiously when it comes to these stocks. A Price-to-Earnings ratio or PE value the company is a ratio of current market price to its earnings per share. It also referred to as multiple. This measure of valuing the company is used by investors to filter out stocks for investment. The golden rule of investment is to pour money in stocks that are trading at attractive levels compared to their intrinsic value, thus allowing investors to create wealth over a period of time. “We would advise not to go by only the price decline from average price as average can shift further below. Key is to look at what are the business ecosystem that can drift the positives turn profitable for the company and how it reflects on share price,” Pritam Deuskar, Fund Manager, Bonanza Portfolio Ltd told Moneycontrol. “Today, it looks like as if the pharma sector has bottomed out but when it will start working nobody knows. The kind of infra spending, smart cities, airports, and construction budget till 2030 will come out, for sure some of these companies will benefit,” he said. Well, markets are built on hope and everything gets priced well in advance. Fundamentally speaking, individual stock fundamentals and business developments matter more than just the price of the stock. Should investors bottom fish in some of these names? “One has to carry out stock-specific analysis while bottom fishing stocks which are trading at a discount to their historical averages,” Dinesh Rohira, CEO & Founder 5nance.com told Moneycontrol. “Many of these stocks are cyclical, like Tata Steel, JSW Steel, ONGC and Coal India. These stocks are driven by their commodity-related specifics. Sustainable growth plays an important role while ascertaining a stock’s fundamentals. Sun Pharma and Zee have been in the news for corporate governance reasons, one of them might be out of the woods,” he said. How relevant are long term averages? Long term moving averages define the price action of a security. It is a good tool to use while analyzing market movements as valuations are key while analyzing indexes, suggest experts. The golden rule is that if the index is trading at a significant premium above the moving average then it might be a good time to sell, and vice-versa. But, it should be used with other parameters such as price to book value, as well as moving averages. “Buying stocks that are trading at deep discounts to long term moving average works better when this happens in cyclical industries. Moving averages like 200 DMA & 30 DMA acts as a general indicator of long term and short term trends,” Romesh Tiwari, Head of Research, CapitalAim told Moneycontrol. “It must be used with other parameters like PE ratio and Price to book value to make long term buying and selling decisions in quality stocks,” he said. Disclaimer:The views and investment tips expressed by investment expert on Moneycontrol.com are his own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. Discover the latestBusiness News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated! Find the best of Al News in one place, specially curated for you every weekend. Stay on top of the latest tech trends and biggest startup news. You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/nearly-50-of-nifty-companies-trading-at-a-discount-should-you-buy-or-stay-put-4424241.html",
    "original_url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNeTNraGJZckp6OVNRc0NsTkNISURqdHdBSXhBVWlHUnZyMWg1OU95RVc2b2ZGS3JRblZKT2Z6S1JrNXhUTnUtMFV0R0x3Vks1QzF6OHlha0RYT21CSU1LR3Zxb1VGVHM2XzMwWEZQTTE0ODB3RkhMQlJQNkZCc0UtbmxyOGRpVXRKejY5WkNwaEczdFpKQkt1RURRc1lpS3J4VWdjTTJYQzVyRXJiUno4d2Q4eXNHZ0ZSUnBtWjcyLUFxQ0ctY0tfWi1LNFp6dHBLazNJN2ZZaUbSAd4BQVVfeXFMTm80bV96YXFvMzZxS1loNWF5SmNKWFVpaG9NYXAtdkdJVGlnN3pNWXZueHFmS2YxTVh4eWhUTE9iYUUtb2NkcjhOTW80RWcxM1l5VUVRRjVHaTRfRWgtMWZRMnFRRGVaZ2x0MG0wamYyTG1vb3c1cDRiV0NTbWxPdElxWmJCOHNHWHV0elhfMkpfcy1qOXFGTkhueEQ1LUFUOHpjbkVCa3J6dzVYN0pkX0dsVDk3N0Z6RlZ1QjRpb0xIRE1yd3k4emtjUF8ydXdKek1lVUxOM2ZIaFlTQTVn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4307,
    "word_count": 694,
    "gnews_title": "Nearly 50% of Nifty companies trading at a discount; should you buy or stay put? - Moneycontrol",
    "published_date": "12/09/2019",
    "publisher": "Moneycontrol",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "An international dispute about a popular investment product could shape India’s market",
    "body": "A dispute between stock exchanges inIndiaandSingaporehas cast doubts on a popular investment product, and it has raised questions about the future of India’s more than $2 trillion equity market. While the problem — a disagreement about the planned listing of a derivative product — may appear to be a niche one, it potentially affects a large swath of international investors with an interest in India. The contract at the heart of the dispute is the Nifty 50 index futures contract currently traded on the Singapore Exchange. According to industry players, that’s one of the primary ways that investors around the world have been able to play the Indian market. The derivative product in Singapore is “the incumbent, the largest and most liquid” of futures contracts on offer, Ross Finlayson, on the iShares capital markets team at BlackRock, told CNBC. The National Stock Exchange of India has been providing data to the Singapore Exchange for the derivative product, which is used by offshore investors looking to hedge exposure to the Indian stock market. At present, many regard Indian equities as difficult to access because of the country’s tax rules and other roadblocks. Now, that contract in Singapore is set to go away following an announcement from the NSE and two other Indian exchanges that they would be ending agreements to provide market data to overseas exchanges. That would affect the trading of offshore derivatives, including the SGX’s Nifty 50 Index Futures. The NSE said the move was needed as derivative trading based on Indian securities had resulted in capital migrating offshore. That was “not in the best interest of Indian markets,” the NSE said in arelease. Following the announcement, the SGX said it would list newly created Indian derivative products, but its plans were dealt a blow by the NSE, which took the dispute to court. That was because the proposal was seen as identical to the incumbent SGX Nifty futures, local media outletThe Times of Indiasaid, citing sources. For now, the issue remains in a holding patter. An Indian court last monthorderedthe NSE toextendthe existing license for SGX Nifty futures for at least two successive contract months after arbitration — which the Indian stock exchange said is expected in February 2019 — is completed. Both the SGX and NSE told CNBC they had no additional updates on the matter beyond statements released last month. Investors have been left with plenty of uncertainty in the wake of those developments. Interest in Nifty futures on the SGX has tapered: Volumes of the derivative traded on the SGX have slipped from above the 2 million mark per month to consistently coming in below that level from March onward. The dispute makes things difficult for investors trying to get exposure to Indian equities, thus potentially increasing costs for those looking to access the Indian market, said Zhikai Chen, a Hong Kong-based portfolio director at Lombard Odier. And even though the NSE’s existing license has been prolonged for now, investors are unlikely to wait until the last moment before scrambling for alternatives in the scenario the arbitrator rules in the Indian stock exchange’s favor. That’s because India has a roughly 8.5 percent weighting in the MSCI Emerging Markets Index and those tracking that benchmark need to ensure they have exposure to the Indian market. “From one day to the next, it’s very difficult for these managers to be sitting in a limbo as to whether they know they can access that exposure,” Finlayson said. There aren’t too many alternatives that investors caught in the middle can turn to for now, Finlayson said, citing other smaller futures contracts and less liquid derivatives as examples of options. He added that interest in one of BlackRock’s recently launched exchange-traded funds focusing on Indian equities had spiked since the two exchanges began legal proceedings. “Because of this turbulence in the market, no one’s really too sure as to the viability of this new product and the overhanging court proceedings obviously bring it a little more into disrepute as well,” Finlayson said of the new India stock futures the SGX plans to launch. Another potential casualty could be the onshore Indian equity market as liquidity could take a knock if arbitrage trading between the two stock exchanges is affected by SGX Nifty futures being halted, said Dbritto Ronald Michael, senior development manager at brokerage Phillip Futures. All of that also comes against the backdrop of the development of the Gujarat International Finance-Tec (GIFT) City, a district in Gujarat state positioned by the Indian government as a high-tech hub for financial services. Concessions, such as exemptions from short-term capital gains taxes on derivative trades made in GIFT City for foreigners, are being made to encourage offshore trading volumes to return onshore. This Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information. WHAT ARE COOKIES AND HOW ARE THEY USED? Like many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits. First-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities. Certain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services. The Services use the following types of first and third-party Cookies for these purposes: Strictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly. Information Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers. Measurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes. Personalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices). These Cookies also allow your device to receive and send information, so you can see and interact with ads and content. Content Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos. Ad Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you. Social Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit. We and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you. Depending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below. Browser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions: Google ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer If the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services. Analytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms: Google’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out The above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms. Flash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager. Interest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit: Digital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance You can also opt out of some of the advertising providers we use by visiting their opt-out pages: Google’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page These are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms. After you opt out, you will still see advertisements, but they may not be as relevant to you. Mobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings. Connected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking. Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”. These settings vary by device type. Cross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above. You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics. Consequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences. For inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US. For inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK CHANGES TO THIS NOTICE This Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies. These Cookies and SDKs are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these tracking technologies, but some parts of the site may not function properly.",
    "url": "https://www.cnbc.com/2018/06/29/nse-and-sgx-nifty-dispute-uncertainty-for-investors-in-india-markets.html",
    "original_url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOMUJLSDZNRS1aZEV1amJseXh1OXIyUEJQM0tiODUyVFc2Wjg5MGdLSjFfV25ydDc5SDViQ0Y5YmRzZGFpcnlaY2JXelNSVUJtWVF3cjdwa0IydFVON3JGVGRoT0QwbEtYZEs1a0ZKaDlPTkZVQ3d2NWtwSFhINkJGajA4R216dDVZenFKeXYzNV82Y2l2cXpOcl9YVmMtczA2MUhwUERhc0nSAa4BQVVfeXFMT21INll1TnNNNm9NWGFqNVZxeFNNV2FDR3ByUHFBX0dqc1JvbG9TOE52Sm42LW5qYUtJMllVc0dBNHVKcjlpMkh5OWN6QTBzTWViTW1MTUl2dWJDUjF3TmJfVmJNWUZqQ25RblZmUnNheFlfT1I5cmM3RG5qd2liZEdzSkd0ZmRlZGxDbFBNU21vUHBGbmFOMTFSQzk3Z19MYU9vS3ZsV21EZDVWbXdn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 15077,
    "word_count": 2299,
    "gnews_title": "An international dispute about a popular investment product could shape India's market - CNBC",
    "published_date": "04/07/2018",
    "publisher": "CNBC",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Market Highlights: Sensex plunges 770 points, Nifty settles below 10,800-level",
    "body": "The Indian equity market on Tuesday closed amid macroeconomic data, auto sales number and global cues. Sensex closed 769.88 points, or 2.06%, at 36,562.91 while the broader Nifty settled at 10,797.90 tumbling 225.35 points, or 2.04%. Investors were worried on economy slowdown, GDP data and merger of the the PSU Banks announced late on Friday. Also, the auto sales data which was released over the weekend likely to increase the nervousness of the Dalal Street. \"Market slid as deceleration in economic growth due to fall in consumption and subdued manufacturing activity diminished the scope for a turnaround in the near-term. The consolidation of PSU banks is a step in right direction however, they may take more time before earning benefits from synergy. Additionally, weak monthly auto sales and outflow from foreign investors added volatility to rupee,\" said Vinod Nair, Head of Research, Geojit Financial Services. In the broader market, both the BSE Midcap and Smallcap indices slipped 1.65% and 1.32% respectively. ICICI Bank, Tata Motors, Tata Steel, IndusInd Bank and Vedanta were the worst performing stocks, crashing as much as 4.45%. On NSE, 48 out of 50 stocks ended in the red zone with Tata Steel and UltraTech Cement taking the top position among the losers. Only Tech Mahindra and HCL Technologies were the gainers on the 50-share index. “The sharp fall in the Q1 GDP growth to 5% and the weak core sector growth are the key factors that have caused a fall in the markets as it opened after a long weekend. The continuing negative global cues, the raging tariff war between the US and China, and the likely sluggishness in the economic fortunes of economies around the world have also been behind the rot in the markets here as well as elsewhere. Weak domestic consumption especially rural consumption has resulted mainly from low employment levels and non-availability of finance, which are issues that call for immediate measures to salvage the situation,” said Joseph Thomas, Head of Research- Emkay Wealth Management. Among sectors, Nifty PSU Banks was the biggest loser, falling 4.87%, followed by Metal (-3.10%), Media (-2.59%), Private Banks (-2.34%) and Financial Services (-2.28%). Globally, MSCI's broadest index of Asia-Pacific shares outside Japan shed 0.2% in early trade while Japan's Nikkei was flat. The US bond yields were little changed in early Tuesday trade after a market holiday in the United States on Monday. The 10-year US Treasuries yield was flat at 1.506%. Global shares faced headwinds from tariffs Washington and Beijing slapped on each other. Sensex closed 769.88 points, or 2.06%, at 36,562.91 while the broader Nifty settled at 10,797.90 tumbling 225.35 points, or 2.04%. The 30-share index plunged 802 points, or 2.15%, to 36,529.83. Nifty PSU Bank sector is down 4.73% with Indian Bank (-10.88%) taking the pole position among top losers followed by Canara Bank (-10.29%), Union Bank (-8.33%), Punjab National Bank (-8.24%) and Oriental Bank of Commerce (7.07%). Midcap stocks continue to decline. BSE Midcap index is trading 1.55% lower with Indian Bank (10.84%) being the top loser. “Cabinet clears recapitalization of IDBI Bank with one-time infusion of funds by both Government and LIC. Will help both IDBI and LIC, and shows government's commitment to take banking to a sound level,” the government said in a tweet. Shares of IDBI Bank on BSE is up 9.16% at₹29.20. 40 out of 50 stocks on Nifty slipped today with UltraTech Cement, ICICI Bank, HDFC, Vedanta and Indian Oil being the top losers, falling as much as 3.83%. However, 10 stocks trades in green with Tech Mahindra taking the lead. Sensex tanks 600 points, or 1.60%, to 36,733.61. Shares of Infosys and Tata Consultancy Services (TCS) touched 52-week high today at₹822.30 and₹2,296 respectively. Infosys is trading 0.11% higher on BSE while TCS gained 0.78%. Gold has historically been a favoured asset class for Indians but billionaire banker Uday Kotak believes there should be a new policy that will reset investor priority to equity, a more productive asset than the precious metal. Kotak said in a series of tweets on Monday why pouring Indians’ savings into gold was not good for the health of India’s economy. Gold has historically been a favoured asset class for Indians but billionaire banker Uday Kotak believes there should be a new policy that will reset investor priority to equity, a more productive asset than the precious metal. Kotak said in a series of tweets on Monday why pouring Indians’ savings into gold was not good for the health of India’s economy. He said net gold and precious stone imports between 2011 and 2019 scaled₹24,500 crore, while net inflows from FPIs in debt and equity was only $145 billion during the period.",
    "url": "https://www.livemint.com/market/stock-market-news/sensex-nifty-live-today-03-09-2019-share-market-updates-1567479421817.html",
    "original_url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOWUV0VThjV19FYllzX3dMa0N2X05acXl2UnEzUnR3Qmswdk9ZQkR3ZnBpS0xsRmc3RG9qbUxIRzZ4TXhBZmpieVhkRExHel9mT09fX2l1c1lvRXI0czREd2ViRS1jd3V6YkdVVHRiSV9IVjMwZkxQRV9GaFJYdUdILXNCOXFxS3BmTWtsNVlXVzYzWG93cTNqbWNoWTNWYUJlZTRVTHN4LUlhQU5ZU0F2WkVsb0o4NTRidUdoajB0VmdJd9IBxwFBVV95cUxQVlpHVkhsay1FWU8zVHYxWXJ2aVBhUnF1WGlSZjZ4RFRMb3FHV2M4X0JkQUtBcnhlNEhmYm5iTGg2Q3RPQlQ2bjlxUjE1ZEVOcldTeXBjRDZyV1pBMVpERkZvdXFEN3h3RHE2akNnQ050eE4yR2s0a1p3VkRXc3k4LXIwRE8xRWIyOGRVTHVCNmZsV2trRGNqOTRCQ3BXTWU5Q21KdmptSlRwRE1oOFE0Rmc2c0hZR2JrQi1qN0ZrVzl4cS13MlhR?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4768,
    "word_count": 780,
    "gnews_title": "Market Highlights: Sensex plunges 770 points, Nifty settles below 10,800-level - Mint",
    "published_date": "03/09/2019",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Traders' diary: Minor stock bounceback likely next week",
    "body": "You read books, Buffett, graham, what not. Buy when there&#39;s blood on the street and sell when there&#39;s euphoria. Yet… https://t.co/wrGY2uq3ts - Prashant Jain, HDFC AMC Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/sensex-nifty-live-today-2018-09-28/liveblog/65988848.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOSk5IRVYyNFNpYVYzZHJhQzNvN25LaVlPa3RrYzUtdzdseVR4UmRHRGtVdFdfbEpPUFpoMmdwVTNYRTFvc0haQ3R4akVBR3ZfOHdaemhxb1VZd3g4b1lmTlRrS0tyTF9KZE5QTGlubzQ2WEFKdHFxMkp1by1LNWJqSENxTFlfVFIxY0otNtIBkgFBVV95cUxPTWNSZnNpbUJHQ2dWOWEyLU9IMVFKSjlKRzNPdU4wLXQtZ0cteGtKbnRQeTFCN01Udk1YN3g1UWhycjB3ampQR3g3X2l6V0RxbkM3a1loaVZPWmJQVGxTV0dJajdYS3VvTmQ1SS1JcjhtU2ZFOFpNaXl3eFZHbmZXLXpMR2M2WlhiYWRoZTlBSndBQQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 488,
    "word_count": 78,
    "gnews_title": "Traders' diary: Minor stock bounceback likely next week - The Economic Times",
    "published_date": "29/09/2018",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "What is the stock market in India?",
    "body": "10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/faqs/market-faqs/what-is-stock-market-in-india/articleshow/59803321.cms",
    "original_url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQck1jRDYtM1RKLWlnSGhtTGYyemxwcjh3eTVKaXdJcjNVV0dZc0VXeFVWb1lfdjdwR0dsRk53eU1NNkFnazdKbHR6SkhrVEhvOWUzZnhFalVSMmFFeWFPSU9pNXhoYldaVEdoTHBIdlVXWDkyeTREbUZwR0hQTXVHNGtBNXFxV3hUQXRjVjZqSXZrdDBmcDJrUjJzTGJPOFVYc0VOUTA4SWt5Y0M5Mk5BZTY5LUw3QnPSAbwBQVVfeXFMTTd3Z2RqaDdPNGluYWl1R2YybDRaSWp2Y2ZmWTY5TUhmZ1hCdXo5amtISWtrUkFGbXM2dDBDQlFrVUlXcmFJc2IyMS1rYk9pLThJY2hQWW9kMHRwdlAtMHJYVmJEMlU4cVRreUxSNnY3TWRKZ3hhZE9BVWNwdVpsdm16V3lRY0RYQ0pyZjVzbGs4QnNQbjNRYXBtVG44MFFBTkt1YkhnUzZzdzdMTjQ4WFNlRHpkVHBNYTNqc3o?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2995,
    "word_count": 519,
    "gnews_title": "What is the stock market in India? - The Times of India",
    "published_date": "25/01/2019",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Market Wrap, Sept 20: Here's all that happened in the markets today",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Sep 20 2019 | 4:38 PM IST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/podcast/markets/market-wrap-sept-20-here-s-all-that-happened-in-the-markets-today-119092000783_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPM0pQVlRQeTNVaWNyal9JVzQzMm9kdjdibURPU1d5TU5oRVgxaEhLdkN0MlEwaDJjUEltT0Z6T24zR09NaFpMRTA0aVBvbmxTRi1JQVAwZEY0aHJhbnBUYm1PNVZHcDk4NHg3dm5mN2VTcEVLVjdaam5qZnJfVHJMYkNKclNIblFGaXhyTXdVTzNnbElXNlBoRFhVcVBSNVdCT0dZcEF5WERaRnYxenVaM0RCaGZUcW1lRS13VXhVUXNzUVdiOHFnaHpYLU9FRnlj0gHWAUFVX3lxTE1UdS1BUzV0TWFoLUVoMTZqLWJ3aGRSNGxxQUVHeU9YS2otRWpvRklDRzZudVRVYnZMS3hSXzlNczJmZmg3QldqLWhncnpkRkxwNTFic3BvWEduSmN5LVpRVzNVU2JvbjExNEY0bHlMNlNDaVpLSlBubWk3V0xDdzJTX2lXTHJDQi01T1BaLTRZSXNUWkNTVWU0ZUlZMHp2TEpnSUZ0cW1zTElvUDZIV0NBSUJsZmNDVXJTTHhlczl4b0l0ekRtZnUzTTFBTDhoSm9nMVhUV3c?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 491,
    "word_count": 83,
    "gnews_title": "Market Wrap, Sept 20: Here's all that happened in the markets today - Business Standard",
    "published_date": "20/09/2019",
    "publisher": "Business Standard",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "India Election Results 2019, market highlights: After hitting record high, Sensex falls 1,314 points; investors book profit",
    "body": "The stock markets pared their intraday gains to end in the negative territory amid heavy profit booking even as trends suggested BJP-led NDA government returning to power. (Express photo by Partha Paul) India Election Results 2019 and Share/Stock Market Highlishts: The frontline indices on the BSE and the National Stock Exchange (NSE) settled lower on Thursday after a sharp selloff in the afternoon trade, particularly in the final hour of the session as traders booked profits. Earlier in the day, the indices had scaled new record highs with the S&P BSE Sensex breaching 40,000-mark and the Nifty50 going past the 12,000-mark for the first time as trends of the election results indicated the BJP -led NDA government was returning to power with a big majority. Story continues below this ad The S&P BSE Sensex settled at 38,811, down 299 points or 0.77 per cent. The index crashed by 1,314 points after hitting a record high of 40,125 level in the intra-day trade. On the other hand, the broader Nifty 50 index ended at 11,657, down 81 points or 0.69 per cent. The index had breached the 12,000-mark to hit 12,041 levels during the day. In the broader markets, the S&P BSE MidCap index ended the day at 14,650, down 21 points or 0.15 per cent, while the S&P BSE SmallCap index slipped 16 points or 0.11 per cent to settle at 14,353. Among the sectoral indices on the NSE, the Nifty FMCG index was the worst performer of the day, slipping 1.73 per cent followed by Nifty Metal index which fell 1.48 per cent. The Nifty Bank index, which had hit 31,000-level mark during the day’s trade, ended up slipping 118 points to 30,409 weighed by heavyweight HDFC Bank which slipped 2.32 per cent to settle at Rs 2,350 per share. Also read: Lok Sabha Election results 2019 LIVE Updates: BJP set for second term with full majority as Congress falters The rupee pared its morning gains and was trading on a weak note against the US dollar in the late afternoon trade. It had breached the 70-mark per dollar and was last seen at 70.02 against the US currency. During the morning trade, the domestic currency had risen to 69.37 against the greenback after settling at 69.66 per dollar on Wednesday. Live Blog 16:01 (IST) 23 May 2019 Nifty sectoral indices: Gainers and losers Among the sectoral indices on the National Stock Exchange (NSE), the Nifty FMCG index and the Nifty Bank index were the among the biggest losers of the day. 15:57 (IST) 23 May 2019 S&P BSE Sensex: Gainers and losers of the day IndusInd Bank was the leader among the gainers on the S&P BSE Sensex, rising 5.2 per cent to settle at Rs 1,596.85. However, HDFC Bank was the biggest contributor to the index's fall today, the stock slipped 2.94 per cent to end the day at Rs 2334.35 15:34 (IST) 23 May 2019 Market at close The S&P BSE Sensex ended at 38,811, down 299 points or 0.77 per cent, while the broader Nifty50 index settled at 11,657, down 81 points or 0.69 per cent. 15:31 (IST) 23 May 2019 Deepthi Mathew, Economist at Geojit Financial Services on election results: \" Unlike in 2014, NDA-II has to deal with a much weaker economy. Rural distress and slowing investment in the country are two major issues that need to be addressed in an urgent manner. The developments in the global economy are also not favourable, especially with regard to the rising crude oil prices. The low crude oil prices benefited NDA-I in a bigger way. \" 15:26 (IST) 23 May 2019 Prime Minister Narendra Modi on Lok Sabha 2019 election results In a tweet, Prime Minister Narendra Modi said \"Together we grow. Together we prosper. Together we will build a strong and inclusive India. India wins yet again! #VijayiBharat\" ???? ??? + ???? ????? + ???? ??????? = ????? ???? Together we grow. Together we prosper. Together we will build a strong and inclusive India. India wins yet again! #VijayiBharat — Chowkidar Narendra Modi (@narendramodi) May 23, 2019 15:16 (IST) 23 May 2019 Market Check Market situation at 03:13 pm 15:04 (IST) 23 May 2019 Romesh Tiwari, Head of Research, CapitalAim on election results \"As expected and predicted by exit polls the BJP is going to form the government again. Markets already had rallied on Monday and today after the trends started confirming BJP's win Sensex and Nifty hit their new highs. But now the market will have to catch up with ground realities of the economy and global factors. Global markets are showing weakness due to US-China trade worries and so our market may settle down or even turn negative in the short term. Traders must stay cautious now. Looking at technicals, Nifty has support around 11,730 levels, breaching it on downside might result in more downside towards 11,600, On the upside, any close above 11,800 may take the Nifty above 12,000. Infra and Banking sector may give good returns on the upside. We are positive on DLF, Yes Bank, IndusInd Bank.\" 14:59 (IST) 23 May 2019 B Gopkumar, ED and CEO, Reliance Securities on election results: \"Markets were looking for stability, continuity and strong leadership rather than a fractured mandate - this has led to the new high. We believe India allocation from global funds will increase and more ETF flows are likely over the short term that could drive the markets even higher.\" 14:47 (IST) 23 May 2019 Ajay Suresh Kedia, MD of Kedia Commodity on impact of Lok Sabha 2019 election results on markets: \"BIG day for Indian today as Nifty hits 12,000, Sensex 40,000, both for first time ever after Verdict 2019. Lok Sabha 2019 election results which are indicating that BJP-led NDA government will return in the centre. The BJP’s return would signal stability for the markets. This could lead to Rupee strengthening and benchmark yields coming down over the short term. Consistency in leadership is a positive for the economy. Overall and should shore up sentiment amongst foreign investors. Going forward we see Nifty going towards 13,500 soon.\" 14:19 (IST) 23 May 2019 Jimmy Patel - MD and CEO, Quantum Mutual Fund on expectations from new government: \"With the probability of last government retaining its power the kind of euphoria markets are creating I would first like to caution investors to stay calm. Rising markets make the stocks expensive, and hence it would be not the right time to jump in. Nevertheless, it is also recommended that investors hold on to their investments and wait for their financial goals to achieve. My expectations from the new government for the Mutual Fund Industry are – Scheme portability – The option to switch from one AMC scheme to another AMC scheme within the same asset class should be made available to investors without any extra cost & tax incidence. FOF as Equity Scheme – Revise the definition of “Equity Oriented Funds” (EOF) by including Fund of Funds (FOF) schemes which invest predominantly i.e., 65% or more, in units of Equity Oriented Mutual Fund Schemes. Taxation – Taxation of Fixed Income products and bonds if transacted in the capital market to be similar. Pension Funds – Mutual Funds to be permitted along with tax benefit, management of pension funds. Economy – Fiscal deficit to be controlled and financial discipline to be instilled without falling prey to populist measures.\" 14:03 (IST) 23 May 2019 Nifty PSU Bank index up over 1.5 per cent, top gainers and losers among the PSU banks The Nifty PSU Bank index on the National Stock Exchange is up over 1.5 per cent. Here are the top gainers and losers among the public-sector banks. 13:17 (IST) 23 May 2019 Kotak Mahindra Bank head Uday Kotak congratulates Prime Minister Narendra Modi In a tweet, Kotak Mahindra Bank CEO said, \"Time for transformation of India. Time for deep reform. I dream of us as a global superpower in my lifetime. Heartiest congratulations to @narendramodi , the BJP, and the NDA.\" Time for transformation of India. Time for deep reform. I dream of us as a global superpower in my lifetime. Heartiest congratulations to @narendramodi , the BJP, and the NDA. — Uday Kotak (@udaykotak) May 23, 2019 13:02 (IST) 23 May 2019 Director of Reliance Nippon Life Asset Management Reliance Nippon Life Asset Management has informed that Jai Anmol Ambani resigned as the company's director with effect from today. (Source: Comapny release to BSE) 12:51 (IST) 23 May 2019 Surendra Hiranandani, Founder and Director, House of Hiranandani on real estate sector: The real estate sector was in the news in the last couple of years, with the government announcing several major policy initiatives like demonetization, RERA, GST etc which changed the entire landscape of the industry and made it buyer friendly. Housing remains the top priority for every Indian regardless of their income levels, education or any other possible factor and we believe that a stable government at the centre in 2019 will further boost the growth in the sector. We hope that the new government demonstrates concrete action to push investments, increase growth and generate employment. We expect that the new government can do away with unnecessary documentation which will help real estate players immensely. It is important that single window clearance is soon put into practice which will not only resolve operational issues prevalent in the industry but would improve the productivity of the real estate industry. Currently, the permissions are coming at a snail’s pace. Private sector participation in housing is necessary to bridge the gap between demand and supply and for that it is desirable to create a policy framework to minimise and simplify approvals required for the development of a real estate project. Real Estate sector stands amongst the critical sectors in terms of investments and employment and we look forward to initiatives that would further aid to the growth of the sector in the near future. 12:43 (IST) 23 May 2019 Japan's Nippon Life Insurance to raise stake in Reliance Capital-owned asset manager to 75 per cent Reliance Nippon Life Asset Management said on Thursday its Japanese investor would increase its stake in the Mumbai-based asset manager to 75 per cent. Reliance Capital and Nippon Life Insurance both own 42.88 per cent stake each in Reliance Nippon. Nippon Life will buy out most of Reliance Capital's stake with this deal, the asset manager said. (Source: Reuters) 12:22 (IST) 23 May 2019 Nilkhil Kamath, Co-founder and Chief Investment Officer, Zerodha: \"The elections have played out in line with consensus opinion, BJP looks like they will have a majority even outside the alliances that form the NDA. Consistency in leadership is a positive for the economy overall and should shore up sentiment amongst foreign investors. This could lead to Rupee strengthening and benchmark yields coming down over the short term. Specific to the Indian stock market; we believe they might have run up ahead of fundamentals buoyed by sentiment over the short term. It might be prudent to wait for the inherent fundamentals to catch up before waging big directional bets on the market right now.\" 12:16 (IST) 23 May 2019 NEWS FLASH | Government has to improve ease of doing business: Rakesh Jhunjhunwala to CNBC TV18 Ace investor Rakesh Jhunjhunwala in an interview with CNBC TV18 has said that the new government has to improve ease of doing business. 12:09 (IST) 23 May 2019 Market Check Market situation at 12:06 pm 11:33 (IST) 23 May 2019 NEWS FLASH| 7.26 per cent 2029 Government Bond Yield at lowest level since April 2018: CNBC TV18 The 7.26 per cent 2029 Government Bond Yield is at the lowest level since April 2018 (Source: CNBC TV18) 11:21 (IST) 23 May 2019 S&P BSE SmallCap index up nearly 1 per cent The S&P BSE SmallCap index was at 14,493, up 124 points or 0.9 per cent. Bharat Financial Inclusion and Indiabulls Ventures are the top contributors in this index. 11:15 (IST) 23 May 2019 S&P BSE MidCap index up 1.5 per cent In the broader markets, the S&P BSE MidCap index was at 14,891, up 219 points or 1.5 per cent. LIC Housing Finance and Shriram Transport Finance are the top index contributors. 11:03 (IST) 23 May 2019 Volatility index India VIX falls 27 per cent India's volatility index - India VIX, has fallen sharply by over 27 per cent to 20.0225 on Lok Sabha 2019 election results which are indicating that BJP-led NDA government will return in the centre. 10:39 (IST) 23 May 2019 SunTV jumps 5 per cent as trends indicate DMK leading Shares of SunTV rose over 5 per cent in the morning trade after early trends showed that the DMK is leading in 31 of Tamil Nadu's 39 Lok Sabha seats. Sun TV is owned by Kalanithi Maran, who is the grandnephew of the former DMK Leader M Karunanidhi. The stock has gained for the second consecutive session and has touched its all-time high of Rs 597. 09:44 (IST) 23 May 2019 Top gainers and losers in Nifty50 09:36 (IST) 23 May 2019 Nifty Bank index up over 2 per cent led by Bank of Baroda, IndusInd Bank and State Bank of India (SBI) 09:29 (IST) 23 May 2019 BSE Sensex Heatmap 09:26 (IST) 23 May 2019 Sectoral trend on the National Stock Exchange 09:22 (IST) 23 May 2019 Market Check 09:20 (IST) 23 May 2019 Markets at open At 09:15 am, The S&P BSE Sensex was trading at 39,655, up 544 points or 1.4 per cent, while the broader Nifty 50 index was at 11,900, up 162 points or 1.4 per cent. 09:07 (IST) 23 May 2019 Rupee opening The rupee opened at 69.49 per US dollar vs 69.66 against the greenback on Wednesday 09:04 (IST) 23 May 2019 Markets at pre-open 08:57 (IST) 23 May 2019 Markets on Wednesday 08:53 (IST) 23 May 2019 Market to trade volatile on account of election results: Karvy Research Nifty is currently trading with bullish bias on the daily charts and has closed well above the major support zone of 11650-11700 levels. For the day, the index will take its direction from the outcome of the general election trends which will be available during the market hours. We expect the volatility is to spike in the today’s trade amid the big political event. The index has support around 11650 followed by 11500 while resistance is pegged around 11880 and 12000 levels. On the flip side, BANKNIFTY is having support around 30250 and 30000 levels while resistance is pegged around 30700 and 30950 levels. Sectors to watch for the day: We remain bullish on select private sector banks followed by Auto and FMCG counters for the day. While any bounce in the Pharma and IT stocks may be used to exit the existing long positions. (Source: Karvy Stock Broking - Morning Moves) 08:44 (IST) 23 May 2019 Good morning and welcome to Indian Express live markets coverage Very good morning and welcome to Indian Express live markets coverage on the day of Lok Sabha Election 2019 results day. The stock markets will be tracking the election results closely today and we will be providing you with the latest updates.",
    "url": "https://indianexpress.com/article/business/market/india-election-results-2019-and-market-today-live-updates-bse-nse-sensex-nifty-rupee-bonds-5743411/",
    "original_url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQNVJFSDgyb3hpMFVpbUhITzZyRW82eWpsX3hteDhDOFR4TTI5ejJ4eVJOX3U4eHctdlQxRXg0dXdmZUtPV3VvbDI1eWluTjVleURPekdhZ0d0OFl1N2pkRlYtSWpBUEVTOUFTV2FaMDZxeG0wSVdNQ1FmYVR4d2hFOG5DSmdMUHVhTXAxcWZGMktmUnFRSG1CbnAzSUItV3ZOanVZYnZJM25zSW9OcjE1R3AxcmxNaGdIbXRZN00ydlpWTkE3QWF0OXRZaHFuQ3lwWGx0dG1ybm9WeU5yclFOQzhnSdIB6gFBVV95cUxNQU1FVXJjWWkzUEJxTDlibm5WXzNGbW9oRU1COXJtQUd6UVRQM0ZUNGJRNlpQTjJud0lvUExCdnEzYzJrcGs2V3R4Mjcyam12SnVSMnlvd0FLLThPSjVKb3RaYnctSnNlcFgydFg4VUJycWFvQnpSZG1PNVJuOXZxQnRNeDJZZFBDTm83Qm1Xd2F0RFhzQ2EtejkwLVpTUG9XbllsRU40RmdrYkpMQl9ITHFUM25wdllDTTNkTWdxN0d0eXBCU250ZXdacHQ1WDRXRzVhM1J6UGc4RHN0aS00WnZmc2hiMmI0Q3c?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 14765,
    "word_count": 2540,
    "gnews_title": "India Election Results 2019, market highlights: After hitting record high, Sensex falls 1,314 points; investors book profit - The Indian Express",
    "published_date": "23/05/2019",
    "publisher": "The Indian Express",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Closing bell: Sensex closes 180 points up after 700-point swing led by HDFC twins",
    "body": "Auto component makers have drawn up ambitious capital expenditure plans because of the need to upgrade their technologies and other regulations in the automobile sector@VatsalaKamathttps://t.co/MIE1gskq15 A global slowdown can weigh on Indian companies' earnings, since a number of them depend on exports and have large overseas subsidiaries as wellhttps://t.co/eyEmzzjV3Z Asia's worst performing currency in 2018 is expected to redeem itself next year, considering that global factors may be more conducive to a stronger Indian rupee, writes@aparnaviyer02https://t.co/NoUMb3DTDs Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/Money/ePRx740Qou69mV3PFENKPO/Sensex-Nifty-live-updates-BSE-NSE-stock-market-Rupee-oil-pri.html",
    "original_url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPNWRvQmhyWUFaTFFvVUdmNS1na3BqcEcwcUtmY3lZaXMtaU1waFNJX0NKZHZtWmJ6Y04tenVkQTh0QlJZRTg5SmlBNXRiY3FxREZXTlFEcjV0ZUExQ2hrVzcyWlppN3c3Rm1ET21fU0dmWnpYVlU2WTZNZ3h3cEMycGZXVUxkMWdGNWZTM2l3Y3d5UGVZWHRxaF96WXFSTGppdlpFcllHbE5WRjZCcVl4a1pfSjNuRGFBZ0xv?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 800,
    "word_count": 109,
    "gnews_title": "Closing bell: Sensex closes 180 points up after 700-point swing led by HDFC twins - Mint",
    "published_date": "26/12/2018",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Traders’ Diary: Nifty needs to hold 10,550 level",
    "body": "- Vaishali Parekh, Senior Technical Analyst, Prabhudas Lilladher - Arun Kumar, Market Strategist, Reliance Securities - Chandan Taparia, Technical & Derivative Analyst, MOFSL - Jimeet Modi, Founder & CEO at SAMCO Securities and StockNote - Abhijeet Dey, Senior Fund Manager-Equities, BNP Paribas MF - Vinod Nair, Head of Research, Geojit Financial Services - Mazhar Mohammad, Chief Strategist – Technical Research & Trading Advisory, Chartviewindia.in Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/sensex-nifty-live-today-2018-12-07/liveblog/66980608.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOVFhaQW5JWDNSN2pWSERpMmdhUktaXzA2azNTejJIWFJZSlhoVW9NSERibXVoRFBBVU51MGlrS3VvRGNtUGhvSzVIUnl4SW5DSmRsV3FfN3dGYzEwb2Ria2E0OU9jOWR1bU10U0hPSHA4ekItUkEtdmJ4c0dJbi1LeFNjc1lLZUJQc2IxTdIBkgFBVV95cUxNbzlMSm14TjZRc3kyaWVaYkRndzJfbmVKcnZjZDVZMDVKbHE1U21Kb1RKQ2NMaWplc2tDQzBOYTNLejdPUVRjRC1Yb3J0Z25oM255MmltSXlQSW9rT3k3bDhQUVZ3Y3Zqb2N2UkFkX1M1SVF3cUxTX092eUxjR09WZTZrRW5iUjhBYlJDRmxoMDJKUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 765,
    "word_count": 116,
    "gnews_title": "Traders’ Diary: Nifty needs to hold 10,550 level - The Economic Times",
    "published_date": "07/12/2018",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Closing Bell: Sensex ends 2018 on a flat note, Nifty below 10,900; midcaps outperform",
    "body": "It’s a rather somber end to the market on the last trading session of 2018. Mixed Asian and European cues kept the market in check. The Nifty ended 2018 below 10,900. Weakness was visible among index heavyweights, which dragged the indices. Meanwhile, among sectors, auto, metals and pharmaceuticals were all trading in the green. At the close of market hours, the Sensex was down 8.39 points or 0.02% at 36068.33, and the Nifty up 2.60 points or 0.02% at 10862.50. The market breadth was narrow as 1495 shares advanced, against a decline of 1095 shares, while 164 shares were unchanged. Tata Steel, Vedanta, and JSW Steel were the top gainers, while Hero MotoCorp, Axis Bank, Bharti Airtel and Bharti Infratel lost the most.",
    "url": "https://www.moneycontrol.com/news/business/markets/share-market-updates-bse-nse-closing-bell-sensex-ends-2018-on-a-flat-note-nifty-below-10900-midcaps-outperform-3337721.html",
    "original_url": "https://news.google.com/rss/articles/CBMihAJBVV95cUxPQmx3OV9KeGIyYVBIbXJKcmtLWUlIaEpwSkstRTdRcWVJcnRRNXJvQVl0NmVsUVFCdTUzQzJTaFpCSnR3aE0xc0tRTG1rbFN2TDFGRmJxcjBIYzNNUkU1V3VNT2NwdDNyb3JscVhxR1NTbGVMQXIySDIzZW1ROUdGUDQzcjlHNll1eDdUUUNuZHBoLXFBNFBMUGQyV2drSTVvSTdERHJOS18zN1pYcXZvWkZ5YmFWUXRESVNUQ1JLWUdtY0tZaW44RWcwN0l4eFNPYUpmak9hYk9tQkVDUi15cDZqeFB2Y2NkbG44STEwbVIwWlljdk5wYjJqVG1yX1d4RUF6bdIBigJBVV95cUxPUVl1NVpZVHMwYXZ1NVlldkw2WHBzcXY5TnVlaVRvcUVpM1NNSHJsUjZpcVBSQWJOSF9ZWGNKZVRwSzRuaTEtYkN6Z01vMHZsUm1hMXpNVlZHQmREaDE1eWtMLWdlTkhoWXZYTDhzZWtoZ2JLeFBmamwzVnpaQ0s0UEpCXzdGQVRGd09ldmV4Z0dISC1WT3JMd0tqZVRRTGdvSEJ6aEhiQkVINnM1S1VRRGlsdUhJR3BneXpoUmJlLUFibWdVQ2djcEowYXBpWmcxZ0l3SjhHTUxtelZpQll0bDIxTzNlNUdSMTJhN21IWHhTZ2tZdDVvUktYOHI1cVF4cUNseUhfTFh4QQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 725,
    "word_count": 123,
    "gnews_title": "Closing Bell: Sensex ends 2018 on a flat note, Nifty below 10,900; midcaps outperform - Moneycontrol",
    "published_date": "31/12/2018",
    "publisher": "Moneycontrol",
    "topic": "Nifty 50 stock market India"
  }
]