[
  {
    "title": "Stock market today: BSE Sensex closes over 1,400 points up; Nifty50 above 24,150 - top reasons for New Year bull party",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Madhuri Dixit displays power and elegance in black pantsuit with gold details India’s top 8 cricket stadiums worth travelling for ​​10 dishes made with carrot for school tiffin​ Pairing these 7 things with radish can have dangerous side effects ​10 desserts to make with bread at home​ Madhuri Dixit effortlessly blends vintage royalty with contemporary power dressing Krithi Shetty's gorgeous pictures 10 reasons why avocado is a superfood Kareena Kapoor exudes royal glamour in a wine-red saree A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns...",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-02-2024-dalal-street-indian-equities-global-markets/articleshow/116869999.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxQa3BOalhaQy1WMU1MZ1hHTnNiYzgtTDg2V1c5dVlyUWU3M2NaangyaEd1RExIalNCQWtIVkFEYUg5Z0ROUHUzanBXM252SXY4QVpHRE1QWjFFMTBXUEJDeWpXdWhmMlhMQlNuY0I3bHhhMFFGOWhtYUQ5YXdhd1RVLUFCUzkyNW9Zb0tpRV94dnVBZEMzM0pOX3RaNnpUSlctclFkN1haUFVod1hWSm92aTJzSTZEQmoyMnI5Sk9Ha25IWU1kYVowNTYzUERTTHZjTG9jSnNQRWRKcWRMWURCVDVpOW81YlBudVlLMUg5TFVSNVVFUldNUW5PWVFrNjNSNkh3STZkdkE1UVZEQWN2ZNIBlgJBVV95cUxOVHppT20tTEZuSFZyanJKRk4zb0FDTmktNkpRVENnejdxX2p3U0VSNmFMSENxVUVSdzBrd2ZVNDVMWHp4OGJVcW05ZXE4Z2J0bTBzd3BaNTBtR1JUWkNlUzRraEx3cTJhWU4tMU9vQzBfckI2ZVBDekVEUzJaZGZmVW1vQXp3bEVzNGFuMWZuSDBpcFlfR3R0WGtuZmp2MFM3cm9GTWtrZ3g4akJpaEk2ZFBveHQtT2tUYy1pUXFOM1lEN0RGa1JWQXIzc3o2dkNRb21KNWptS2FOckJITkh0SWtxVVFROFRUMlp6S1ByTWY3RHpuSVZ2ZGFXYVFmYUwtQ0JrTC1wOWw3MzhLTkxuS2RPYjZLUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1667,
    "word_count": 265,
    "gnews_title": "Stock market today: BSE Sensex closes over 1,400 points up; Nifty50 above 24,150 - top reasons for New Ye - The Times of India",
    "published_date": "02/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market crash: Sensex, Nifty 50 crack over 1.5% each; HMPV virus scare among 5 factors behind selloff",
    "body": "The Indian stock market crashed on Monday, January 6, with both benchmark indices, Sensex and Nifty 50, ending the session over 1.5% down amid heavy selling across the board, as reports of a new virus outbreak in China spooked investors. The Nifty 50 slipped below the crucial 24,000 mark and ended the session down 1.6% at 23,616 points, while the Sensex also tumbled 1.59% to 77,964 level. The broader market experienced even more pain, with the Nifty Smallcap 100 index and the Nifty Midcap 100 index plummeting by 3.2% and 2.7%, respectively. All major sectoral indices finished the session in negative territory withNifty PSU Bank, Nifty Metal, Nifty Energy, Nifty Realty, and Nifty Media falling the most, between 2.51% and 4%. In terms of individual stocks, 46 constituents of the Nifty 50 index closed in the red, with ITC emerging as the top laggard with a drop of 8.1%, followed by Tata Group stocks such as Tata Steel and Trent, which lost over 4% of their value. Other stocks, including BPCL, Coal India, NTPC, Adani Enterprises, Bharat Electronics, Kotak Mahindra Bank, Power Grid Corporation, Adani Ports & SEZ, and Asian Paints, all fell by between 3% and 4%. Here are the key reasons behind the fall in the Indian stock market today: Most Asian markets traded lower as sentiment remained cautious over the potential changes by the US President-elect Donald Trump, who has vowed to sharply raise tariffs on imports from China and other countries, potentially denting growth for a region heavily reliant on trade. Japan’s Nikkei 225 index lost 1.5%, while the Hang Seng in Hong Kong declined 0.3%. The Shanghai Composite index dropped 0.2%. A case ofHuman Metapneumovirus(HMPV), said to be responsible for a spike in respiratory illnesses in China, has reportedly been detected in Bengaluru on Monday. According to news reports, an eight-month-old child in Bengaluru tested positive for HMPV, a similar virus to COVID-19, that can cause respiratory disease in people of all ages, especially among young children, older adults, and people with weakened immune systems. A sharp fall in index heavyweights such as Tata Steel,Reliance Industries,HDFC Bank, Kotak Mahindra Bank,ITC,Tata Motors, among others dragged the markets lower. A gauge of Asian currencies hit its lowest in almost two decades against the dollar and equities fluctuated, with gains from a buoyant chip sector countered by declines in Japanese stocks. The dollar traded near a two-year peak on Monday. The dollar index, which gauges the greenback’s strength against a basket of six currencies, was trading around 108.74. The US dollar rose to 157.77 Japanese yen from 157.22 yen. The euro cost $1.0316, up from $1.0306. Nifty 50 has broken its key support levels, which has intensified selling pressure. “Nifty 50holds a good view until it stays above its 200 DMA which is placed at 23,900. While with inter month perspective Nifty direction will depend on what Donald Trump will do after he takes office as US President on January 20th 2025. Considering both the events upside on Nifty is likely to be capped. Technically, the landscape suggests Nifty’s major support at 23,905 / 23,727 mark. Intermonth support seen at 23,000 mark. Nifty’s hurdles are seen at 24,321/ 24,857/ 25,500 mark and then at 26,277 mark,” said Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/stock-market-crash-sensex-cracks-over-800-points-nifty-50-slips-below-23-400-5-key-factors-behind-market-selloff-11736142385355.html",
    "original_url": "https://news.google.com/rss/articles/CBMijwJBVV95cUxNX3ptZjk4YXk1VW9zSEl3bnpuelZYV09nZnF5YWNkRTBwcS1YX1FuNloxdDByXzNRaVllanNVcjl1ekRoRkVfdEprblR0akpHYUkzbG1SZVhLcjhmTXY0bG5fdWc1WHU4TEloblFHblpIX3B1dTlhbHB5VDl6d2lsR3FRR0lEV1M5b2JsUFBaV2Q2WTNpYjJVS3NRX3FkbGNLTUFFQ2Fpa0NVZHFZbVJEUmptdFVNMnRtcV85X0x3aV9RN0FBbjhlQUhLS0xjdnMxVWxORVhyT01LODBvTjc5ZlQ5VWp4dHkydXFyY3p2UHFmLTZQWTQzcGpHNkFoOExMMFl3REE1WXdialVmSm1J0gGUAkFVX3lxTE1VNUZabjJtSTVaV1lLOExtNTFtV0ZZOHdNeHhoT01qY0Z0Wi1CWElSNU9VaHg4SEtwcWNsSkdrcVkwTTlsWnRLUWpCSTZsQWZNWFFOanBqWDZ1cjNMdl9MWWR2VnlvbjRUV1JQc3ZKUGtQb09id2dPNzJwakxUWGNXU0h4S3JkM3p6Tk53ekZaUmV1WmR5MmJfaUFwMFQ3ajVWTVhfUDBGQm5BOUZ3T0hpV2N3T2h5elZhQXBjQU9QS0dNbXhnWGU4Z2I2Q3piWDUyRmk0WTNaYWZmQzB3VGhYZWRoTlJQN1pNWTNnVUlQOTkxVVB0SjI2MXVMaE9qb3RZLTRqUWtEYUd6Ml9vVDFPQkk0Xw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3798,
    "word_count": 612,
    "gnews_title": "Stock market crash: Sensex, Nifty 50 crack over 1.5% each; HMPV virus scare among 5 factors behind selloff - Mint",
    "published_date": "06/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Upward trend for Nifty intact. How to trade on Monday",
    "body": "A long bear candle was formed on Nifty's daily chart that was placed beside the long bull candle of Thursday. Technically, this pattern indicates a profit booking in the market after a stellar rise on Thursday. Nifty is currently placed near the support of 23,900 levels, which is halfway to a long bull candle of Thursday and also support as per change in polarity. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-3-january-2025/liveblog/116899017.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOWkdOZ3Y4aVBwODZxY290cnU2WUotQ3E3eXU2RVV6RFY0ejM4S2FkTzN6TVVJZGdScURKQk5QMzkxZEtsRHVLQUh5RTQxcGdyN0dMZDBhX2dyaUY5UHVUaHFKYkczNXBGcUQ1dWNhTVhSdTBzTjJ2MzNMejFoTElmT1AyQllHSGg0TWVSbWM0TmZVNmpOMTEwc196T2k5b1BKQThDRFNyMHUxNHJCbm9ya2NiSU5xbEViYll5eTNMN1ZJSmtVVTl2clJtWmVRQ1VpRnVBTmpR0gHbAUFVX3lxTFBqaEE3OW9xNG5sakhxYW4xTGtXRDhndVpnQ1NyWHNjeXdYcFdqbENyQTdtZzNZc2tWME94NXJGRWtVdV83SGJPbVZUT21OTGJpekRFWHhJTlJHMUlZUXJNRHFQLVZfRXFaRUNhc1VsRnROZWFaWk1JY2k2U0p1dEt6cloyTUNfc1J4ODZ1MnMwRGVpTjdsOHlIUnU2MHpCeDdxQTJ6VUZZbF80RlpZV1p3WFo1QTNBb3B1Y3c3SmpYVmdtLUdLak1MQUdSaHVBeDBkYkVULWJMa3VoMA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 680,
    "word_count": 116,
    "gnews_title": "Stock Market Highlights: Upward trend for Nifty intact. How to trade on Monday - The Economic Times",
    "published_date": "03/01/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Why did Sensex, Nifty crash today? 5 reasons why stock market is down",
    "body": "Domestic stock markets nosedived on Monday, with benchmark indices witnessing sharp losses. The S&P BSE Sensex plummeted as much as 1,200 points, while the NSE Nifty50 fell well over 2% to hit an intraday low of 23,601.50. At around 2:49 pm, the Sensex was down 1373.20 points to 77,871.20 and the Nifty50 tumbled 420.10 points to trade at 23,551.90. Thedownturn was driven by a combination of domestic and global factors, triggering a broad sell-off across sectors. Volatility spiked as the Nifty50’s volatility index rose to 14.5, indicating heightened nervousness among investors. Broader market indices, including Nifty Smallcap100 and Midcap100, faced steep declines of 2.60% and 2.40%, respectively. The sell-off was particularly severe in PSU banking, metals, and realty sectors, with no sector managing to stay in the green. Experts have identified multiple reasons behind the market crash, ranging from the detection of Human Metapneumovirus (HMPV) cases in India to weak global cues and ongoing FPI outflows. Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, noted, “The market is likely to be influenced by the negative factors impacting FII flows and some positive domestic factors which can support the market.” Global economic conditions remain unfavourable, with a high dollar index at 109 and the 10-year US bond yield at 4.62%. Dr. Vijayakumar explained, “The FIIs are likely to continue selling till the yields decline and the dollar stabilises.” These global challenges are weighing heavily on Indian markets. Concerns over weak business updates from key sectors, particularly banking and FMCG, have further dampened sentiment. Chowdhury noted, “Markets have been under pressure primarily due to weak business updates by companies, especially banks and some FMCG stocks.” Last but not least, the discovery of two HMPV cases in Bengaluru sparked panic among investors. Although the virus is not expected to have the same impact as Covid-19, it led to a knee-jerk reaction in the markets. Manish Chowdhury, Head of Research at StoxBox, remarked, “Market sentiment may have turned a little sour due to initial HMPV cases found in India, but its impact may be limited as the fatality seems to be lower compared to the Covid virus.” With corporate earnings, the upcoming budget, and global trade policies on the horizon, market volatility is likely to remain elevated in the near term. (Disclaimer: The views, opinions, recommendations, and suggestions expressed by experts/brokerages in this article are their own and do not reflect the views of the India Today Group. It is advisable to consult a qualified broker or financial advisor before making any actual investment or trading choices.)",
    "url": "https://www.indiatoday.in/business/story/why-did-sensex-nifty-crash-today-5-reasons-why-stock-market-is-down-2660316-2025-01-06",
    "original_url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOSXc4eVljaFdCR0dBckFaaEI5b2Y4LTJJemdHVGZYcDJILW1xeVBqckNxeU41Q01GTUc0azNELVR3UGVWOFF2eS1idjFJVE5UWUIzeTlaR1R0UHF6Z0tud1Fjc1FYeVhxWXFDekVyUDBtcUxRcEFEUFoxLUJyd2N5TmQ1OFp0Tm52U3ZDZE5YdGtBWk5mNjhDQTgtNkN3MmxOdm5FSWpQWGNPWU5FalhwdDNfQTZtOTg3ZjNMMjBCUmZBX0J4WHfSAcsBQVVfeXFMUHF1ZVBQY0hwdzk4MjQtckwwUHNCa190dFVGc3RwMzdjNW5CSVBDZVoxVmdNZi02WGpvWk94THlKQ09HS3JjSEVSeTNBbkpNWktUQ1JGakMxSDJTV2wxSXJ0S0Mza1lmRTBOR2w5VWpYUU11OWpxRTVKdlRCQWNQbmtfSVZ6VlpGUXhDQXlRT1RjUEZfeXhrOXJheDZMeDBJSEg1UTB3MmowV29qSVlfUXF1UW01RGZKUjVjX09fMGJSazYybDk5WXhORDQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2736,
    "word_count": 426,
    "gnews_title": "Why did Sensex, Nifty crash today? 5 reasons why stock market is down - India Today",
    "published_date": "06/01/2025",
    "publisher": "India Today",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Closing Highlights: Sensex adds 234 points, Nifty at 23,708; Smallcap shares outperform",
    "body": "(Photo: Shutterstock) Stock Market LIVE Updates: Technical View Stock Market LIVE Updates: Market expert view Stock Market LIVE Updates: A glance at broader market Stock Market LIVE Updates: Here's a look at Sensex gainers and loser at close Stock Market LIVE Updates: Here's a look at Nifty gainers and loser at close Stock Market LIVE Updates: Nifty finishes 91.85 pts higer at 23,707.9 Stock Market LIVE Updates: Sensex closes 234.12 pts higher at 78,199.11 Stock Market LIVE Updates: Quadrant Future Tek IPO sees strong demand, 9x subscription; GMP soars 72% Stock Market LIVE Updates: Vodafone Idea planning phased 5G rollout with new tariff plans: CEO Moondra Stock Market LIVE Updates: This Mukul Agrawal portfolio stock surges 10%; up 50% in less than 3 weeks Stock Market LIVE Updates: 3 PM market update - Sensex, Nifty trade higher Stock Market LIVE Updates: Citi initiates coverage with 'Buy' on Hyundai Motor India; share up 3% Stock Market LIVE Updates: Budget 2025: Your guide to AMFI's 15 mutual fund proposals for investors Stock Market LIVE Updates: Laurus Labs hits 2-yr high on hopes of healthy earnings; up 44% in 3 months Stock Market LIVE Updates: Zydus Lifesciences rises 5% on signing agreement with CVS Caremark; Details Stock Market LIVE Updates: CLSA's upgrade to 'high conviction outperform' drives ONGC share 5% higher Stock Market LIVE Updates: 2 PM market update - Sensex, Nifty trade higher Stock Market LIVE Updates: Final Hours! Fabtech Tech IPO closes today: 252x subscription, GMP up 94% Stock Market LIVE Updates: This small-cap defence stock has surged 48% in 10 days; more steam left? Stock Market LIVE Updates: HMPV scare: Vijaya, Dr Lal Path, healthcare stocks in focus; Time to buy? Stock Market LIVE Updates: Kitex fixes Jan 17 as record date for 1:2 bonus issue; gets Sebi nod for allotment Stock Market LIVE Updates: Fertiliser stocks in focus; Chambal, RCF, Paradeep, UPL rally up to 7% Stock Market LIVE Updates: 'Real stock market money is with Gujjus.. Let that sink in': Nithin Kamath Stock Market LIVE Updates: 1 PM market update - Sensex, Nifty trade higher Stock Market LIVE Updates: Arkade Developers up 4% on adding 3 new redevelopment projects in Mumbai Stock Market LIVE Updates: Standard Glass Lining IPO Day 2; NIIs lead charge with 30x oversubscription Stock Market LIVE Updates: This Ramesh Damani portfolio stock surges 16%; zoomed 159% in 5 months Stock Market LIVE Updates: Naukri.com parent Info Edge shares slip 4% after posting Q3 biz update Stock Market LIVE Updates: 12 PM market update - Sensex, Nifty maintain gains Stock Market LIVE Updates: Zomato share bleeds 5% as Jefferies downgrades to 'Hold', slashes target Stock Market LIVE Updates: Auto sales rose 9% in 2024 on strong demand for two-wheelers: Fada Stock Market LIVE Updates: SBI, BoB, BoI: How to trade PSU Bank stocks as index falls 20% from peak Stock Market LIVE Updates: Kalyan Jewellers share rallies 5% post Q3 biz update, pares gains later Stock Market LIVE Updates: L&T's PT&D biz wins orders worth between Rs 2,500-5,000 crore in India & abroad Stock Market LIVE Updates: PVR Inox shares hit 44-month low; stock has tanked 26% from December high Stock Market LIVE Updates: 11 AM market update - Sensex, Nifty trade higher Stock Market LIVE Updates: IGL, BPCL, Gail (India) shares rise 2% each on in-principle nod to MNGL IPO Stock Market LIVE Updates: Capital Infra Trust IPO invites bids: Analysts weigh on long-term prospects Stock Market LIVE Updates: Mobikwik share price up 8% ahead of Q2 results; here's what you should know Stock Market LIVE Updates: Biocon share rises 4% as arm gets Japan's PMDA approval for Psoriasis drug Stock Market LIVE Updates: Indo Farm Equipment share lists at 20% premium; misses IPO GMP forecasts Stock Market LIVE Updates: 10 AM market update - Sensex, Nifty pare opening gains; trade in green Stock Market LIVE Updates: Quadrant Future Tek IPO opens today: GMP up 72%; Should you subscribe? Stock Market LIVE Updates: Prashant Paroda of Allspring Global Investments on Indian markets Stock Market LIVE Updates: Ashish Gupta of Axis AMC on P/E multiples in Indian markets on CNBC TV18 Stock Market LIVE Updates: Here's why Ashoka Buildcon shares jumped 5% in trade on January 7; details Stock Market LIVE Updates: Technical view Stock Market LIVE Updates: A glance at broader market during open Stock Market LIVE Updates: Here's a look at Nifty50 gainers and loser during open Stock Market LIVE Updates: Here's a look at Sensex gainers and loser during open Stock Market LIVE Updates: Sensex up over 350 pts above 78,300 during open Stock Market LIVE Updates: Nifty50 up over 100 pts above 23,700 Stock Market LIVE Updates: A glance at broader market Stock Market LIVE Updates: Here's a look at Sensex gainers and loser at close Stock Market LIVE Updates: Nifty up over 50 pts above 23,650 in pre open Stock Market LIVE Updates: Sensex down nearly 100 pts below 77,900 in pre open Stock Market LIVE Updates: 'Investors can use dip to buy fundamentally strong beaten down auto & finance stks' Stock Market LIVE Updates: Sebi eases settlement norms for brokerage accounts inactive over 30 days Stock Market LIVE Updates: Large-cap cut-off surpasses Rs 1 trillion as 11 new stocks join the list Stock Market LIVE Updates: Gold slumps Rs 10 to Rs 78,700, silver declines Rs 100 to Rs 91,400 Stock Market LIVE Updates: ARPUs to rise, user churn to subside for telcos in Q3FY25, say analysts Stock Market LIVE Updates: India's FY25 GDP growth likely to remain in 6.4-6.8% range: Experts Stock Market LIVE Updates: Indian bond-index inflows may fall short of estimate, says Morgan Stanley Stock Market LIVE Updates: Outlook 2025: Govt capex, safeguard duty key to steel sector performance Stock Market LIVE Updates: Railways ministry spends 76% of FY25 capital expenditure by December Stock Market LIVE Updates: FinMin wants banks, NBFCs to join hands to fund large infra projects Stock Market LIVE Updates: Rupee falls to new low of 85.83 as dollar hovers near two-year high Stock Market LIVE Updates: Jobs, growth, demand in focus as FinMin concludes pre-Budget talks Stock Market LIVE Updates: FPI selloff, HMPV scare drag markets to worst fall in three months Stock Market LIVE Updates: Stocks to Watch, Jan 7, 2025 - Coal India, Mobikwik, Nuvoco Vistas, Airtel Stock Market LIVE Updates: Market Today: FY25 GDP; Quadrant, Capital Infra IPOs; Indo Farm IPO listing Stock Market LIVE Updates: Asia-Pacific markets mostly higher Stock Market LIVE Updates: S&P 500, Nasdaq climb on tech rally and moderate tariffs under Trump administration Stock Market LIVE Updates: Good morning readers! Track the latest live market updates here Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 07 2025 | 7:52 AMIST RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8%",
    "url": "https://www.business-standard.com/markets/news/stock-market-today-live-updates-sensex-today-nifty-jan-7-nse-bse-equity-indo-farm-ipo-gmp-technichem-125010700101_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxNUXRzUy1hRUVudWYyRm5vNTVMV3hMRG0xNnFPN2pqaTM4T3hoQnFETDB1UHZXclp6NXQxU1ZrTW1URVRiTHZDcmRIOTZ4UUNUUW1lZDh6Y0x0MzJrcmNoQ0tidW9pMUgzcGJFYlRHb3hvZkJDSGpzZnhfeVhOa2Zsckc4UGdNUU5NZFBrV05MUGVMd3VaU2lpUlJhWWpFX0VEekdIVWhmUm4xb2VnR0w2YnhocDZKRnBwRkpnUmI0dzRvbFp0cWprMlUweE9RM0lSZFE0QmwzUWczUEtXSUpkTVV2dVRoeHRoM3ctLUFtTGthU3pINlJoMVVVd9IBgAJBVV95cUxQUXFlZEtMTjR1NV9UVlBWbEJKaHhjejVGTVpDblpCLUh5WmdWRnZmVVJHSHJHR1A0eTg1T1VkWEkySkNaekdpZjNHQU9tUjNFODlsUGVFaHB3RGFmWklBd1lRb2RkeFk3WkdSZ3FNd0JKYWQwYVlBclZnWUZZRTM2N1pFUTIxeU5sMlVQTlo4LW8xeXlBWDBjbkl4WE1kVVJQRXFnQ2s4ZW54bGpwWHB4TzE4WWcySTBYRTJiRTdPeG15WXlHRW5sY2NFMkMtOUNSZWZFNVVzbV9TN1VZcC1wSkk1ZmRSd3NFMm5xT2lMVnRUcHNjVmxRRHh1bUhFalFk?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7205,
    "word_count": 1198,
    "gnews_title": "Stock Market Closing Highlights: Sensex adds 234 points, Nifty at 23,708; Smallcap shares outperform - Business Standard",
    "published_date": "07/01/2025",
    "publisher": "Business Standard",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market crash today: Why BSE Sensex, Nifty50 tanked in trade - from FII selloff to HMPV concerns - top reasons",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 9 Biggest Time Wasters Students Should Avoid ​8 proven tips for writing high-scoring answers in exam 8 Essential Skills Students Need for Employability 8 effective revision strategies to excel in your exams 8 things to do a day before your exam to score better 8 Clever Mind Hacks to Boost Your Academic Smarts 9 tricks to study smarter not harder during exams 9 good habits that successful students follow ​10 proven strategies to combat stage fear and speak with confidence 9 motivational quotes to help students battle anxiety A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-crash-today-why-bse-sensex-nifty50-tanked-hmpv-virus-fii-sell-off-q3-earnings-season-top-reasons/articleshow/116993534.cms",
    "original_url": "https://news.google.com/rss/articles/CBMioAJBVV95cUxOelRldldkWEVodURmQ1VJdTdBcTc3eVh1OHZhWDNaNmQ0dFpGRnJTeC1hSndQM09TMDF3RlM5TlVIcHV4dWw4bkw0amUtRWxfeWpIUVdZTzh0TE9kdTZBM20zYldfUXJXWUJHZWhPNE5hUklZRmp6Q2dUWEIxODRYX21PNC1rdEgwa2ROSXRTNGxvNUp0SW90OVAxTGl5SEJ5aURXeXRnNVZjUDFxMldZbGx1TWg1ZzhSdUp2ODhZeWF4REl5TGVWSm1wdDZyaXhvQnRZT3pqdVJrSHA0anpMUTh4T3FuTDI4NGJ0Wk5kc3hLLVdQbzl3NzNwQ0ljS2paTDRIZmhVM05pcG9BVnZIZkYxS0MyMFJTYk5tU2pQc0bSAaYCQVVfeXFMTjRyWkcxY0E3RUdNcmRXOFkwOTNhWElSODVuN2hkaDMwQlo1TV9EbnJEUlBqWElqM0dhdUVkSWJvdEZHUTFZODRuQlpBbUFCaTUxdzZsaldpVFdPMGlTMEFUbjZQcEIwaXVueVlNRS01NTA3RHZWMjM2YVE5emcteWVDUDZ0OGdzX0I5dUkzbDJ5dVpaR25jN0FpZHl1NE9FYTRkN2VDUlpPNC0wdGNvV0FZZ3I3TmVzREh2LWZMa3hiSGU4bWpfVW5yUWVwaW5zS0t0Qk8weUROMFRMdGswelRoYl9JYUVnUmNKbWVrTDkwRzRxc1Z6VURMRzh5OFZraE1BckVlWmI0NTRfbEdmellKU25tcHI4ZGpoNGJ3SUxGbXgyektn?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3690,
    "word_count": 628,
    "gnews_title": "Stock market crash today: Why BSE Sensex, Nifty50 tanked in trade - from FII selloff to HMPV concerns - t - The Times of India",
    "published_date": "06/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 7 as HMPV virus cases rise",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open higher on Tuesday following gains in global markets. The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 23,780 level, a premium of nearly 60 points from the Nifty futures’ previous close. On Monday, the domestic equity market crashed, with the benchmark Nifty 50 slipping below 23,700 level. TheSensexslumped 1,258.12 points, or 1.59%, to close at 77,964.99, while the Nifty 50 settled 388.70 points, or 1.62%, lower at 23,616.05. Nifty 50 formed a long bear candle that has negated the bullish sentiment created in the last week. “The candle pattern of Monday is indicating a bull trap of recent upside breakout and this signals more weakness in the short term. The recent upside breakout of range has been negated and the Nifty 50 slipped below the crucial 200-day EMA (Exponential Moving Average) again at 23,700 levels for the third time. Hence, the next support of 23,500 - 23,400 levels could be in danger of violation,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities. According to him, the short-term trend ofNifty 50is weak and one may expect some more weakness in the coming sessions. The next lower supports are seen in the vicinity of 23,460 and 23,260 levels. Any upside bounce could find hurdle around 23,800, he added. Here’s what to expect from Nifty 50 and Bank Nifty today: Nifty 50 witnessed a steep decline on January 6 and closed the day lower by 388 points. “Technical indicators presented a mixed outlook for the market. The Relative Strength Index (RSI) currently stands at 40.7, trending downward, indicating bearish momentum. In contrast, the Stochastic RSI showed a bullish crossover, hinting at a potential short-term recovery. This divergence in indicators suggests caution, as the market lacks a clear directional bias,” said Mandar Bhojane, Research Analyst at Choice Broking. He advises investors to monitor price action closely near critical support and resistance levels. The interplay between these technical indicators and market trends will determine whether the Nifty 50 stabilizes or faces further downside pressure in the coming sessions, he added. VLA Ambala, Co-Founder of Stock Market Today, expects Nifty 50 to hover for support near 23,470 and 23,200 and notice resistance near 23,650 and 23,720 and the broader sentiment is likely to remain bearish. Bank Nifty index slumped 1,066.80 points, or 2.09%, to close at 49,922.00 on Monday. “Bank Niftywitnessed heavy profit booking as the day progressed and has breached below the significant support zone of the 200 period MA at 50,700 levels after a very long time, weakening the overall bias and has arrived near the critical support zone of 49,700 levels where previously, on thrice occasion it had indicated a positive reversal from this zone,” said Vaishali Parekh, Vice President — Technical Research at Prabhudas Lilladher. According to her, a decisive breach below the 50,700 zone shall invite intensified selling pressure, with the overall trend turning bearish with the 48,500 level as the next necessary support. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-january-7-11736180691822.html",
    "original_url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNUkZpX2hjWVJyd2VTMUo4MnNNV0RTMUhNUXg5c0tjUWpZVl9hR1ZuYkpaV1hhdl9qSjRhLWtMdXVLbmhud1B6bC1ITjVzalRVaHB0cFkyMGlhaTRBcFR6RzRuSS13ZFJmNjlLa1NuMTNwcG9rU2JQdF9DbUlObnJzbDBLaGZXX2ZKbjVVRUNISXJBQWh3LXBPMkpCd08wS0VkT0VxcjM4d0lUWUh2WFlJWWZyNG52TWlmN0kwa3BwcUZ1UHZKOU9JRUZOeVBzNlNjQWQwOUh0V28yMjFoZGJmTUpHc2M0MmxM0gHuAUFVX3lxTE9uZlhHUnFSTnN1bWNsZ0I3bEpiTS05dkFzbUgxQW9jbUoxYlE1dmphOHRqUlVJdmpoajFXb0ozaWtGNjEwVUQ4bWhsUzY2eW9lZFVJaHRJazBOOTMzLU56VHJZSV9MNUJvOHpPQzc0dC1JVGFWV2lDR1ZDZ2RUMUM0LWhWclJYWkpOQ2RlWktPc2JEWHF4aXlYTk5xRGJOWVB4RnBxSkJBSVdteGd1eHBrR0NKM0FMN240TVhHYzJLc1hTQmNKemY4RTNjR2VWSE9hb1daTURnRDgtRThkTzFfc1lBWjhuT1d6dFg1VVE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3633,
    "word_count": 576,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 7 as HMPV virus cases rise - Mint",
    "published_date": "07/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Follow-through weakness seems absent in Nifty. How to trade on Wednesday",
    "body": "A small positive candle was formed on Nifty daily chart with minor upper and lower ranges. Technically, this market action indicates a counter-attack by bulls after an attempt at a false downside breakout of the range movement. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-31-december-2024/liveblog/116813348.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQd2REbnNkVmlrcnVXSTlpR3NMUkp4MDdGWWZuUzliTnNrR1ZES0Ytb2pmNF95LWlCMTFCZlVkczZZVzJydlZJM1dSZFRmdUhzbjVpSFZMWllGM1U0cDhlLVZwbEhLSExNdUNUTkpwT2xmVFhnQWtTb0FTSm1sVlhKY19ZQ0ZCenFIZ3BWeEdyb0lNelU4YllUS1NfT1BJbm81Mkxvb09iZXBqeGZqMnpudk94X1VrXzl3NFJrTDVfSXlhbnhOS2xZYk9RT3ZBUUJWMGYybnFjZFLSAd4BQVVfeXFMTUlob3RsX05MQ2F6b21lendhNjhHQ0VkbzhPZ1F4SUtKUnJ4NnZzT1FsYmU0VGd6MWxULXROTDFnLS1WTzg5aG1LWnNpQWtUUW9pRTRuc0t4eWZpZ0FhbEtxRDh2c1V2TEdtQ191YVFQVlZQQzgtaVlYWURzRkNjeE5WYldBUzhQajBfTDdGMk54TnZ4cDNkQW56NllsdURaVi1OWkNIWGNYSHVDc29hUlU1SS1nT2tkOGVjVjdKWGhhUC02aXZSUHhwc2VJcXlPdFc4SzJHT2hJdHp5aXB3?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 541,
    "word_count": 89,
    "gnews_title": "Stock Market Highlights: Follow-through weakness seems absent in Nifty. How to trade on Wednesday - The Economic Times",
    "published_date": "02/01/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market crash today: BSE Sensex closes over 1,200 points down; Nifty50 ends just above 23,600",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 9 Simple Ways to Boost Brain Power While Studying Nine minute daily habits that will change your life: Student edition 9 Good Study Habits to Develop 9 Supercharged Study Habits for Exam Success 9 Common Myths About Board Exam Preparation Debunked 8 life-changing benefits of learning one new thing every day 8 essential memory techniques every student needs to master 8 Clear Indicators That Suggest You Could Excel as an Engineer 9 Myths About Online Learning Debunked: What Every Student Should Know 8 Online Resources for Free Books to Help You Study at Home A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-january-06-2025-dalal-street-indian-equities-global-markets/articleshow/116979441.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxNMVFRbWcyZ3UzWjJFZlhmSFlhd3FBeTBzYi02U3JQRjQ5bGo1N2VVX19MSUZqNDg5ckpwanIxUk9zYXk2SEFQcXJVNzZiQllBWFN5Q0hnWERiYnM3UUdtRThvdk84NkliRGxYNFlpcUp4b3FNdXJDU3pzRXo5Rmx4b3Q0WkkxY1MtN18tLVJRSmRmX3N4UUZkOE9ORkc4SzlTY1BLeFROY0hIcm05Z2RrYXJ3c2RqcFN3UEV6VzUweWVvWW41R1B2VlJ0OWVDWFR2LU4yTUZ0LVZtM3hVbzJRbTdMYmMtRnhaNTB3RVlLSEV3NmMwMm1pVElBTWRwbWpVUndpcDlaODNXZ3RqTjA4b9IBlgJBVV95cUxPOTMxT3NBLWFNaWhPVWxCcldTdTJpQmJRMEh6Y1J4N1ppWlBEMW5FVUdfZHF4VDg2ZFlpelBDanAzeFMzTkVmOTh4THJCbTZiNWtaenZVZjE1T3FhcjkxYXpaWEVhbWh6blJ1eTZSMTJRY3pEc055Tk11djk0V0ZQY0NKOWdBcWY5UE45OWJaTHhueHEzUm10WEFUT3F5Nmw3c0dwdkVlQ296bHpRYVlaZ2tSd3FZdXhfSS1LLU9RMjhWa0FIN3dFVmtIMngxQVdQbDFqN0l1eWoyTDVvSXd1MHdIei1LdGpFeHhPaUVzTU1jUVVISVg2SWxjY2VpWW42VFNFOEtSb1pNN3l3VXFFUklpNVB2QQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3723,
    "word_count": 634,
    "gnews_title": "Stock market crash today: BSE Sensex closes over 1,200 points down; Nifty50 ends just above 23,600 - The Times of India",
    "published_date": "06/01/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 1",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open lower on Wednesday tracking weak global cues. The trends on Gift Nifty also indicate a negative start for the Indian benchmark index. The Gift Nifty was trading around 23,734 level, a discount of nearly 70 points from the Nifty futures’ previous close. On Tuesday, the Indian stock market indices ended the last session of the year 2024 with minor losses amid a lackluster trade. TheSensexfell 109.12 points, or 0.14%, to close at 78,139.01, while the Nifty 50 settled flat at 23,644.80. Nifty 50 formed a small positive candle on the daily chart with minor upper and lower range. “Technically, this market action is indicating counter attack by bulls after an attempt of false downside breakout of the range movement. The crucial 200-day EMA (Exponential Moving Average) is in the limelight again. After moving below this moving average on Monday, Nifty has failed to show any decisive follow -through weakness in the subsequent session and showed upside bounce from the lows,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities. Nifty 50 formed a small red candle on the weekly chart, placed beside the similar green candle of last week, which signals a broader range movement in the market. “The upside bounce of Tuesday could be an early indication of another round of upside bounce in the market.Nifty 50is broadly in a range of 23,500 - 24,000 levels for the near term. Having bounced back from the lower range of 23,500 levels, one may expect further upside bounce towards 24,000 levels in the coming week,” Shetti said. Here’s what to expect from Nifty 50 and Bank Nifty today: Nifty Open Interest (OI) data indicates the highest OI on the call side at the 23,800 and 24,000 strike prices, highlighting strong resistance levels. On the put side, OI is concentrated at the 23,500 and 23,200 strike prices, marking these as key support levels, said Hardik Matalia, Derivative Analyst at Choice Broking. Nifty 50 showed upside recovery from the lows on December 31 and closed the day flat. “Following a weak start, the Nifty 50 recovered smartly during the day. However, the technical setup remains unchanged as the index failed to break above any significant moving averages. Despite this, sentiment appeared to improve throughout the session. On the higher end, if Nifty 50 moves above 23,700, it could advance towards 23,900-24,000. On the lower end, support is placed at 23,550,” said Rupak De, Senior Technical Analyst, LKP Securities. According to VLA Ambala, Co-Founder of Stock Market Today, the market is expected to remain weak in the coming weeks, turning 2025 into a more challenging year for investors compared to the uptrend in 2023 and 2024. “Amid these developments, Nifty could expect support levels at 23,210 and 22,970 and resistance at 23,610 and 23,750. Similarly, Bank Nifty could find support at 50,350 and 49,800 and face resistance near 51,170 and 51,350,” said Ambala. Bank Nifty index recovered from day's low and ended 92.55 points, or 0.18%, lower at 50,860.20 on Tuesday, forming a bullish candlestick pattern on the daily chart. “Technically, theBank Niftyindex reversed from trendline support and defended its 200-Days simple moving average (200-DSMA), which is near 50,600. Furthermore, the index has formed a green candle on the daily chart, indicating strength. On the upside, 50-Days Exponential Moving Average (50-DEMA) is placed near 51,915 which will act as resistance,” said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Intermediates Ltd. (A Pantomath Group Company). In the short term, he expects Bank Nifty to trade within the 50,500 – 52,000 range, with a breakout in either direction determining its future direction. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-january-1-11735656187338.html",
    "original_url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQWHZnS3k2VlN6Y0NmT0lvX2UtcXl5X1RySi1uUF9tcnhkVUpQYmxBZXNsUVhENTROX3FrVHNqQjBkV2lYeTQ2WEtRNTRwVnZCaXlmRmUtNndBOThicUE0dzY1QnViZVZpNUJwX1NTczJudmtiZndaVjJPRTQxcjJNOHBNUWVscGZSY3hOd3NaNVNLelFRS1lXRzVsdkd0RGx2a3VaR0phTERBN3dGckVUQ210NEZQV1JHRjY3R0QtblZqTEgyWFBMSmR5eTZ4Qk1VUnZmQVJ0M24xUkxoMDg1S2U1bzQyT3ZD0gHuAUFVX3lxTE5WbWF4ZDR4OXhfd3BWN0tZRnBpODJ1WThWOUpINU5uUkwxV1dZYk5JeUFaWlkzYzBqeTVxaWJMdWgtcUlRUVlrOU9yVl9vbjdncWZaeG5ONlRCVVJUTVhHNGV1LU4zdFFKODZFZGc5Rklkd1dpWnBMN0d0MHAxVExiMmw3TVRteEw4VlV5bWxDOU1qMVdIRzRqODhodXU3YWJhcGJoNDlaUFQwZEYtX2VjMzBjZFNkUmtpdnBXQ0lTX2dZUHdWQzJxRTNLYWZXZVdsUXExNjBJaUU4VW1pMlJDWWhybmx6dGZKT2lXNWc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4250,
    "word_count": 681,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on January 1 - Mint",
    "published_date": "01/01/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  }
]