[
  {
    "title": "Nifty 50 gives zero returns in one year! Is the Indian stock market still overvalued?",
    "body": "Following a period of strong outperformance in the past 2–3 years, the Indian equity market has lagged behind its global counterparts in the last year, generating nearly flat returns. In fact, both Indian benchmarks - Sensex andNifty 50- have slipped nearly 2 per cent in last one year, giving negligible returns and raising concerns about stretched valuations in the Indian equity market. “Currently, the index trades at a price-to-earnings (P/E) ratio of around 22–23 times, notably above its long-term average, while the price-to-book ratio hovers near 3.4 times and the dividend yield remains modest at approximately 1.3%. Moreover, India’s market-cap-to-GDP ratio has surpassed 139%, a level that typically signals limited upside unless earnings growth accelerates meaningfully,” said Seema Srivastava, Senior Research Analyst at SMC Global Securities. Srivastava further highlighted that the medium- to long-term outlook- of the Indian stock market remains favorable. Historically, theNiftyhas delivered compounded annual returns of 12–17 per cent, supported by India’s structural growth trajectory. India’s growth story is anchored in strong fundamentals rising consumption, digital innovation, and a young, skilled workforce. Government reforms i.e. recent GST 2.0, infrastructure expansion, and initiatives like Make in India and PLI are boosting industrial capacity According to Santosh Meena, Head of Research at Swastika Investmart, the key reason behind this underperformance has been sustained FII selling, driven by better opportunities in developed markets as well as in countries like China and Germany. “ The recent global market rally has been largely led by AI-related stocks—a theme where India has no direct large-scale players. As a result, most of the incremental flows have been directed towards the US and China. Additionally, corporate earnings in India have remained muted for the past few quarters, while valuations were not particularly attractive. However, valuations have now reached more comfortable levels, and the growth outlook appears promising, which could rekindle FII interest in the Indian market going forward,” Meena said. Seema Srivastava of SMC Global said that India’s long-term trajectory remains robust, despite short-term macro challenges. “With resilient domestic demand and improving corporate governance, it offers compelling opportunities for long-term investors seeking sustainable wealth creation,” she said. Srivastava further explained that themarketis not in a bubble, it is priced for perfection, and current valuations can only be sustained if earnings growth picks up, domestic consumption remains resilient, global monetary conditions ease, and broader sectoral participation improves. “In this scenario, maintaining investment discipline and focusing on carefully chosen stocks becomes essential to manage short-term market volatility,” she added. Disclaimer: This story is for educational purposes only. The views and recommendations above are those of individual analysts or broking companies, not Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-gives-zero-returns-in-one-year-is-the-indian-stock-market-still-overvalued-11758440672763.html",
    "original_url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxONld2QjlUT3hIS1NJMHVLRGdTcEVoanFob2dBR3EyUUh0VU9kM3hIUko1Q3Rzbmg1R0N2Y3lNYXBQNjh6Q05Id05Rc21FaUpvS0xMZDNnMU9zRkt3Z1NlbWYwclRsM0RuUVFqc1V4NVZrcFdUcUoxcWJpc29KdHo3N3J0XzFsaGNCSXFXMnJYTXh6YjVuS1JZUk1sV0pBTEdFeXFCQkdOZDRzMDM5WG1iYVAzSWVrMS1RNDJ5Vk8zYTFtbXFPd2hiMlVUVzFBQnUwUW0yaV93cGFNYzlmRkVlVU1ndTlnYy1W0gHuAUFVX3lxTE9wM0ZjaVJkZXhiWHczUEEyY0dNa2liQVpDQk8yMzJlODRPcHJYV01YNzg0NDM0MGtGMnhwOHV6YTNWYzZNUTQzNDFJTzBVTzFjcHVScjBFZ09xak1wU0l6ZU52dlFvUUotem16blJpMkt1Ty15a1BlTkpUcm9ydGlpVWF4UU95SE9FT25MUnBaLVh2VW9VOEFpRHdCZHN2RmRpZlI1OThvak9JcUpWZXFVdFRHenlQeUhjTTVyN2FFSkZFcVowYWRhYndJVE8ybTYzcjlkeTVpV2F6QVhpYXdnV18xMVBGQmx6Zi1jaHc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3381,
    "word_count": 481,
    "gnews_title": "Nifty 50 gives zero returns in one year! Is the Indian stock market still overvalued? - Mint",
    "published_date": "21/09/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Sensex settles 466 pts lower; Nifty below 25,250; TCS, Infy drop 3% each",
    "body": "Sensex Today | Stock Market LIVE Updates: Indian benchmark indices Sensex and Nifty retreated for a second session on Monday, with IT shares leading losses after United States sharply increased the one-time fee for H-1B visas to $100,000, delivering a fresh blow to a sector that had only just begun to stabilize. - Vinod Nair, Head of Research at Geojit Investments - Anand James, Chief Market Strategist, Geojit Investments Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-22-september-2025/liveblog/124035547.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxQSTgwb0w4X1VFbjhkOUlZaFRCYW1XOTUyeXo5RDF1S280MTdLNlowX2EwMnljOHM4ZjBYcEdZS1NkVjhwVXhJbHZlNG56MDhXRHdlWWxQTWZ5OGNpMEI1OWN0SGhadWx2SWVsRmp2aktRbGVyWWZjbkQxN2ZnemdydzZQeHk5WWpmYjg3NTI2bnU3NFk1UVo2bWtyUmF2NDMxejRiRDdQOE9TNTBKODhMVGN5bVkxSnhiSUFLTXVWbHMyczhUMFpiQmFBSVdSWWREc18zU0FqZC0tQdIB3wFBVV95cUxQTVVuZlp0aTA3dERHX0xZYS1ZM19lZlJrOWVBdndNUHk2azk1bG9qNURHSmZodXI0RzRhbXdWRUdMNkFJZWxJeDV4TlR4dEVHYTM5dE9ibTYyWThRbUpoVnVaTG1jbTZBUWxLOUNlNjBQLUxJZjdsaENxY3p2bWx1ZDJTTmxpOUlWZzRxSXJBLXVLc3RKMjFaT2JQSm9qRGVheXhaNFdKUlVNMHZxV2gtZ3A1MGxwaUo0VXlMSFpmclFBX0VoYVlmeGJEOFF2SWRJaTR3RE1zeWYySmp6elVB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 739,
    "word_count": 121,
    "gnews_title": "Stock Market Highlights: Sensex settles 466 pts lower; Nifty below 25,250; TCS, Infy drop 3% each - The Economic Times",
    "published_date": "22/09/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market today: Nifty50 ends below 25,100; BSE Sensex down over 380 points",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Lehenga Tales by actress Indhu From Pacific Salmon to Octopus: Animals that die after giving birth Vicky Kuashal - Katrina Kaif: Must see pics of soon-to-be parents 10 best family dog breeds: From Labradors to Beagles 9 makeup tips for a stunning Durga Puja look Devoleena Bhattacharjee’s gorgeous ethnic looks for the festive season Affordable cars with cruise control under Rs eight lakh: Tata Altroz, Exter and more Navratri 2025: Bollywood divas inspired ethnic looks in blue for day 3 Ferrari Spider to Land Rover: Dulquer Salmaan's luxurious car collection 10 common mistakes parents of teens (13–17) must avoid to build trust Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-september-24-2025-dalal-street-indian-equities-global-markets-h-1b-visas-india-us-trade-deal/articleshow/124082431.cms",
    "original_url": "https://news.google.com/rss/articles/CBMivAJBVV95cUxOVDREQURvb01TTXFkUUhjWU9YQjR5cXRsVDJReGlDZ3d4MTN1d1VDU1dfazlPazZrVDhPNkE1WjZIeXZZY045Rmx5SHhzZ0FTODRsdXdPb1ZadktnZTI4ZFVLXzVkbEVaSXB5X191U0ZqRnRTUl8xSXM1NXV1cEVGVEFIWkdZLXdFdWFQZE9pdXlTbmRpc1hodTdYVXQyRWlrbV9LNkZEY2RnNGV3Y1JyN3JQN0ZzdFFqSExqNVJJLXVwa3lQQlFNb0wwb1h1NzB6V2YzN0lyaTh6QmtNbHZGbzFabi1vSnFRWmhBX2lJWHRoelVnWkFjU2cyQjNuYTg2V1UyUW96dzhWeXBFTzZGQ3N1WlNvZ3U1eVE3ZnJ0N2FTbG8xbDRJbGdJVUV6Y19aMmdFeFNkSUNZcjBf0gHCAkFVX3lxTE9DUjRPSE1IRzg3ZXFPeXYxd1AwOV9FU3h6dk5Zbk5VMkNvck1HTmNmRExhSnFuRFhYQzNOWFZlbWdNRm9pV3NGRlRaazFJbVRiN0lVUVd2NGdfZkhpNzVKYXBidXA4MnBmam1vRDM0eEYwSUpjdWtoQnk0V0s3cExjV0ltOU9RWU5lRjBsTTRrM0NhMVZqbHZjVWNtSjZuTl9mcmQzNXIxanl5SGU2N1ZjbkZzXzY1Vk5GZl96Rk1ZbF9KVFhhajVLd3pYOEVsN2JEa3JuWVdaS0pQYTlhUUFVb1FFMG9GQXc1T3RGTWhuTUpSUmNUeXhQZVpxeHpTZ0RJZThjN0FjaFhMdEhBc0h6ajJncHlaNFJWb3pyb2YtQXJHdEdPWVppbG5OUUNwdUlza1JnemZxRWJKdkJLdWVXaVE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1661,
    "word_count": 264,
    "gnews_title": "Stock market today: Nifty50 ends below 25,100; BSE Sensex down over 380 points - The Times of India",
    "published_date": "24/09/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 25 after drop in global markets",
    "body": "The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to extend losses for the fifth consecutive session and open lower on Thursday, tracking weakness in global markets. The trends on Gift Nifty also indicate a negative start for the Indian benchmark index. The Gift Nifty was trading around 25,071 level, a discount of nearly 40 points from the Nifty futures’ previous close. On Wednesday, the equity market indices extended losses for the fourth consecutive session, with the Nifty 50 closing below 25,100 level. TheSensexdropped 386.47 points, or 0.47%, to close at 81,715.63, while the Nifty 50 settled 112.60 points, or 0.45%, lower at 25,056.90. Here’s what to expect from Sensex, Nifty 50, and Bank Nifty today: Sensex is holding a lower top formation on intraday charts, and on daily charts, it has formed a bearish candle, which is largely negative. “We are of the view that the intraday market texture is weak, but a fresh selloff is possible only after the dismissal of the 81,500 level. Below this,Sensexcould slip to 81,200 - 81,000. On the flip side, above 82,000, the pullback move could extend up to 82,300 - 82,500. The intraday market texture is volatile; hence, level-based trading would be the ideal strategy for day traders,” said Shrikant Chouhan, Head Equity Research, Kotak Securities. Mayank Jain, Market Analyst, Share.Market said that the immediate resistance for Sensex is seen at 82,000 – 82,100, and a convincing move above this may propel the index toward 82,500. “On the downside, support lies at 81,200 – 81,000. Breaching this zone could bring 80,500 as the next test for market sentiment,” Jain said. Derivatives positioning reflects a cautious undertone, with call writers continuing to outpace put writers. “Fresh Nifty open interest (OI) addition of 1.12 crore contracts at the 25,500 strike has established this level as a formidable resistance ceiling. Conversely, significant Put OI of 1.14 crore contracts at 25,000 reinforces this band as immediate support. The concurrent buildup of positions on both sides at near-the-money strikes underscores the prevailing indecision, hinting at a likely range-bound phase,” said Dhupesh Dhameja, Derivatives Research Analyst, SAMCO Securities. The Put-Call Ratio (PCR) eased to 0.78 from 0.86, tilting sentiment slightly bearish and indicating sellers still maintain an edge. Nifty 50 formed a bearish candle with a lower high and lower low on the daily chart, indicating continued profit booking. “A reasonable bear candle was formed on the daily chart with minor upper and lower shadow. Technically, this market action indicates weakness in the market with volatility. Though, Nifty 50 placed at the lows of 4 days decline, still there is no indication of any reversal pattern forming at the lows,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities. According to him, the short-term trend of the market continues to be negative.Nifty 50is now sliding down to the crucial lower support of 24,900 levels as per weekly chart. Immediate resistance is placed at 25,150. Nilesh Jain, Head – Technical and Derivatives Research Analyst (Equity Research), Centrum Broking Ltd. noted that the Nifty 50 has now completed a 38.2% Fibonacci retracement of the rally from 24,404 to the recent peak of 25,448, with the key level around 25,050. “A decisive move below this level could open the door for further downside towards 24,920, which coincides with the 50-day and 100-day moving averages, as well as the 50% retracement of the recent uptrend. Despite the ongoing weakness, the broader structure remains positive as long as Nifty 50 holds above 24,900. On the upside, a breakout above 25,150 would invalidate the current bearish setup and may trigger a short-covering rally towards 25,300,” said Jain. Mayank Jain said that the immediate resistance for Nifty 50 is at 25,200 – 25,250, and a decisive break above this level may lift the index toward 25,350. Strong support is placed at 25,000 – 24,950, and if this zone breaks, then maybe 24,800 will act as the support. Bank Nifty slipped 388.25 points, or 0.70%, to close at 55,121.50 on Wednesday, forming a bearish candle, with the day’s high remaining much lower than the previous session’s high, reflecting a slight loss of positive momentum. “Bank Nifty has closed below the 23.6% Fibonacci retracement at 55,270 and is now about to test the 38.2% retracement. Slipping below this level may drag the index further towards the 50% retracement near the 54,700 zone. On the higher side, 55,500 has become immediate resistance, and only a decisive close above this mark would alleviate the current pressure. On the hourly timeframe, Nifty Bank is consolidating around 55,100, with repeated rejections near the 55,300 levels,” said Om Mehra, Technical Research Analyst, SAMCO Securities. The RSI has dropped to 51 on the daily chart and slipped near 40 on the hourly timeframe, reflecting a loss of strength. The daily MACD remains in positive territory. “The broader trend remains constructive above the 20-day moving average (DMA) at 54,620, but the near-term setup suggests extended consolidation with a downward trend. Unless Nifty Bank closes back above 55,500, the index may drift lower towards 54,800 – 54,600,” Mehra said. According to Sudeep Shah, Head - Technical Research and Derivatives at SBI Securities, the 55,100 – 55,000 zone will act as an immediate support forBank Nifty, and a sustained move below 55,000 can lead to the throwback extending further in the Index towards 54,500. “On the upside, the zone of 55,500 - 55,600 is likely to act as an immediate resistance. Any follow through buying above this zone can lead to resumption of uptrend in the Index,” said Shah. Hrishikesh Yedve, AVP Technical and Derivative Research, Asit C. Mehta Investment Interrmediates Ltd. highlighted that the Bank Nifty index formed a red candle on the daily scale, signalling persistent selling pressure. “On the downside, immediate support is placed at 54,800, followed by 54,500. On the upside, the zone of 56,000 – 56,160 will act as a significant resistance. Hence, adopting a buy-near-support and sell-near-resistance approach is recommended in Bank Nifty for the short term,” said Yedve. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-september-25-after-drop-in-global-markets-11758731664019.html",
    "original_url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxNUVhvUUJFaFROQlJISEFFWFU1M2szUi1Ta3hUTjc5T2JVSmp3SjlqU2dka25ldWRUUWRKTVlZSWstMFNNU1gxOTZOQUtMR2RmNV9qTTVBN1c4Q2R0aV83Q3FEeTFLS1Nfbml1bVU0R1NMTEV0cEFlS2RWcmNiX05Ya0JwVWNRQ0NEU1NydHpxZWdpRWVETXhEbl9ub1NnQVdvZndCTVkybXJwMVNHVVluU1B1TGZhUTlhWE9QamhxVUw5VU16X0lYZ1lGcEM5MmZPM0hKQnZLeEZDYk1IS192OThaTEQ2S1ktVFdTMnV0RXpRejBtYmpIcXVpLV8wVmh3djFzUm0xZy1JNkpnbEFKV1BGZ9IBmAJBVV95cUxOdnJsdWNfVFFaNlVQSTVIdzhINGtKT2UyaTNDbFF0U0Myak91eG5GcW1HZGFMZXNyRlZCRG9TVDlhUGdKeDhORHBvc2dJa2ZpYnBKVkJBNzVWZFFsdlJSZld6OXduUDF6aUZidWFMcHdxcHZrWXdSM0FTOXY1MzVuY3hpamdxLTZsbEs4QzFsTm5JSlNsXzFpSnczUC0tbnFqRTFrRlNXT201RDEtQWFzUWsxc29WTHEtR24takFvYVRrdUdhWkcxR0FaWGtya3gxbi0wMGZmY0lrOWFpTjExWnVlYTAxamxfa3pmMFlhWGlsb2FxNHRKRHB2eUVidllTU0JyZE1EVk1vNnVqVl9adHA4X0lPUmxW?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6706,
    "word_count": 1068,
    "gnews_title": "Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 25 after drop in global markets - Mint",
    "published_date": "25/09/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Sensex falls for 7th day, settles 61 pts lower; Nifty flat on selloff in IT, auto stocks",
    "body": "Sensex Today | Stock Market Highlights: India's heartbeat indices Nifty and the BSE Sensex ended negative on Monday recording their seventh successive loss led by selling pressure in auto, IT and pharma stocks. The trade was lackluster as markets traded in a range. - Nilesh Jain, Head – Technical and Derivatives Research Analyst at Centrum Broking - Anand James of Geojit Investments Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-29-september-2025/liveblog/124203000.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNenBTU3VJcXk1MHFFYXAtaEFIbGtsTE9pc2VRVDhpSFV0aTBZTFV1WHJiTjdfOGFWVlhmcjdPR1FBVDFIVjNIN1JtdmRaSzhFc0Z3Tk9aRnE3SDloZDZ1dVFZbF9zenozaFlLc3g5UnI4eHFxZXdOWFdRSzI5QlNZcVVQZHVqbDVGOXBNMUFiQVYyak5ETjhjN1ZpY0FIaUtaX1ZWNTdtZWVuRGdEUWpFaUxkaklIZU9DTEdlMmh4eWpUVlZza3daZjlfTE84NTB2aUY0bGdMU005Z9IB3wFBVV95cUxNYVF2NmxfR2RtRTNmaW5kZERHTEpyekdtNG9FbWlPQ0c5dEdpNW1rMDdfZTA5NGVQTG9mSGhYVWNxbDN5X1ZEYnNTU1NadnJHVWFFQ2Rua1NtNEdadElyMlQ4Z0ZlYmFRT3lQMHlHbUhkYVRIZEx2RFJJTzE4TkM0bWEyWVpDdEVGZDFLNmJ0R1Flbk8tamtYclZRUkNZeVRYSHdWbTFvU1NjNnhpQXpfVHRKWC1yX2NUVHoyaVIzVHJJV3dsa0k5WFBpZ3RiNk9ZYUZyNmd1TWpCdUVWUV9z?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 699,
    "word_count": 114,
    "gnews_title": "Stock Market Highlights: Sensex falls for 7th day, settles 61 pts lower; Nifty flat on selloff in IT, aut... - The Economic Times",
    "published_date": "29/09/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market today: Nifty50 ends below 25,100; BSE Sensex down over 100 points",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Simratt Kaur Randhawa redefines beauty with simplicity and grace From Beavers to Pufferfish: 10 animals with astonishing habitat-building skills Beauty secrets of French women Mouni Roy’s top 10 stunning ethnic looks BLACKPINK's Lisa to Selena Gomez: Best dressed stars at 2025 Emmys Aishwarya Lekshmi draped in scarlet dreams 10 most beautiful freshwater aquarium fish only expert aquarists should keep Ever gorgeous Ramya Krishnan proves 'Age is just a number' Surbhi Chandna’s ethnic and chic looks Katrina Kaif, Janhvi Kapoor, Alia Bhatt: Bollywood actresses in stunning, simple styles Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-september-15-2025-dalal-street-indian-equities-global-markets/articleshow/123891186.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxNSW1BdFBuT1JSNWhzNEh1cEtmZ294NjdweUVGcGtfZlpTU0EyQlR2ZDNCTVJTclE4Y0FKUWkxRXc4R3Vtb21lZUl5TE5TQTVsaTBDb18wYUFhWWdUS0h3Y2o4c2QwaklBUld0ZE9hV3d5b3RxY3FCbXJYMWpwcUZEWW5rc3YtUWIzamF5Q0FoVTFuazR1ZWQ3eHZsZS1CVWtyQVZOZFA1S3p0MVo0bHRtd1JVZUN5VWhQRkdHVjlKTGlsT19PMW8wUjZVZktFSEFud1JlRGc2Y3paeDl5MHc2Sk1XVzNBNEpwZkwzVXFFOFMyZ1d0TG14amt4cXhjUW9uUTVhNHVXbXNpTk0tMW81cFU1Y9IBmAJBVV95cUxPUk1QakRLUVB3eS0tc0c2X0NHQXh3MGx5YXhocWRCek1uNk41SUtNVjFocmtGd01yQk44b3d5V3hSX1ZNLWZobnRfcXRFTFhFSUJQcHlhZGxISlZWa3JSSmFQNFpuNGVTaF9mbHEtMEFDM1dfTS05dmdmZENndFQxbWc2M1NnT015ajhCbVVVUmViZFRXbHVHXzc5aGFLWEt6VjBRV3BqX1ZzX2xaUnBEeUJZNUJLc2pJUWtkN2FxdVd4cGVNc05rdDhlMlRKTzIxaFdiUGtFWWNsSW9FYXFlb0phVVRsRUdlMkVHbk5UbVZsSWx5aG9FS3hBYmZaeEhmN28xU19FRXdwUnUtam5jb3RTNU5NQlJa?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1618,
    "word_count": 249,
    "gnews_title": "Stock market today: Nifty50 ends below 25,100; BSE Sensex down over 100 points - The Times of India",
    "published_date": "15/09/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Indian stock market: Nifty 50 falls below 25,300. Can it slip back to 25,000?",
    "body": "Indian stock market:Indian equities began Monday’s session on a weaker note, extending the previous round of profit-taking, with IT stocks weighing the most after the U.S. sharply increased the one-time H-1B visa fee to $100,000 (₹88 lakh). The move dampened sentiment in a sector that had only recently begun to recover. At the opening bell, the S&P BSE Sensex declined 0.37 per cent to 82,323.62, down 302.61 points, while the NSENifty 50slipped 0.26 per cent to 25,260, losing 67.05 points. By around 9:30 AM, the Sensex was trading 182 points, or 0.22 per cent, lower at 82,443, and the Nifty50 was down 40 points, or 0.16 per cent, at 25,288. “Last week's achievement of the 25400-600 objective, along with an evening star candle formation prompts us to look for a pull back instead of extending upside objectives right away. Favoured rest point is 24880-800. However, should slippages not stretch beyond the 25200-25000 region, we could as well be seeing a sideways move, followed by recovery attempts, though an outright penetration of 25669 is less expected,” said Anand James, Chief Market Strategist, Geojit Investments Limited. TheNiftyindex displayed strong bullish momentum over the past week, advancing 213 points and forming a bullish candle, marking the third consecutive week of gains. According to Amruta Shinde, Technical & Derivative Analyst, Choice Broking, The index has held firmly above the 25,300 mark, closing at 25,327. Nifty continues to trade above its key moving averages—the 20-day, 50-day, and 200-day EMAs—further confirming the broader bullish undertone. “As long as the index remains above these moving averages, market sentiment is expected to stay constructive. On the upside, immediate resistance levels are seen at 25,500, followed by 25,600 and 25,850. On the downside, support is placed at 25,150 and then at 25,000, with a deeper breakdown below 24,900 likely to trigger additional downside pressure,” Shinde said. Support Levels:- 25150-25000 Resistance Levels:- 25600-25850 Overall Bias:- Sideways To Bullish BankNiftyended the week on a positive note, closing at 55,458.85 after recovering nearly 649 points during the week. The index has demonstrated resilience by sustaining above the 55,400 mark and closing in the green for the third consecutive week. “If the buying momentum continues and the index decisively crosses 55,750, it could pave the way for further upside towards 56,000 and 56,500 levels. On the downside, immediate support is placed at 55,000. A sustained breakdown below this level could trigger fresh selling pressure, with potential targets at 54,830 and 54,500,” Shinde said. Resistance: 56000-56500 Bias- Sideways to Bullish Disclaimer: This story is for educational purposes only. The views and recommendations above are those of individual analysts or broking companies, not Mint. We advise investors to check with certified experts before making any investment decisions. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-nifty-50-slips-below-25-300-can-it-slip-back-to-25000-11758526102043.html",
    "original_url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNMjdfb1RvV1p6bmxxazJNMTRoWTdrQmdoOU93ZXVqU1JlZFJIaEU1bDBqa0ppOGlMMjFsSXEwbldnYTZtbjJIVFlwMmhxdGJJRC1mbUlaUlc2aU9FYmhfeXBxZGNPT1RqTzNySktEa1FoU3JsWFRNTGhnZXJhQlVKajNXMkFoWW5RYU4ySDZjRlF6TmM5QU1WYXMwS3pIV192OTlRWmhJY0xFbWVWVUR6Ul8xS2EwcGVVVEk4UUJmSGpzTVM1cVR2WUxMelhDYk9uR2RGTV9BYS1scDjSAeABQVVfeXFMT09PS1VDQ2MxR0VvbjhZUmRUVndpUGhmUFdZV1pNSEdRSmpXMVN4NXFSakcwc2VOak5wSGpCMTVtOXFVSm5CVXpzWnBwMmdxVHlHaUJXeEZ6dEh3RHZ2ek50NXdxREhqY21VYXV1SzYtNUhjcmdTZHJ3azRmUWJmRWxlcEFZeU9RYXFzYzZ0VHRuQUFYSG0xY1h6bVZVSDdTRWpaVnk5blNSOEdXX25yM1JfZ2JNOHdwQmFOcF9JYlN1NlR1VUZ3bm0wbTBNMFB0M1ZSNEVRUmtFaDRhdUFPdG4?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3163,
    "word_count": 485,
    "gnews_title": "Indian stock market: Nifty 50 falls below 25,300. Can it slip back to 25,000? - Mint",
    "published_date": "22/09/2025",
    "publisher": "Mint",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock Market Highlights: Sensex settles 386 pts lower; Nifty below 25,100; TaMo falls 3%, BEL 2%",
    "body": "Sensex Today | Stock Market LIVE Updates: Indian equities fell for a fourth straight session on Wednesday, with financial and IT shares leading losses on the Sensex and Nifty after worries over U.S. H-1B visa rules kept investors unsettled. The declines were broad-based, with persistent foreign outflows overshadowing hopes of a festive-season boost to consumption. - Vinod Nair, Head of Research at Geojit Investments - Shrikant Chouhan, Head of Equity Research at Kotak Securities Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-24-september-2025/liveblog/124081163.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxOWDhFeGNPTTk2ZkhWbnRmRThuMWNhSjh0dWVudVBPOUpjMjhvZ2dxNG4wb0t1N3lyYzVQR3VMX0xXVk1sVXV4UXVjOHE1ZGZkX1BUcmNLRVRZUGZXSU1RcjNDXzc4Z1E5OGxSekN0TGZ1a3FvcFpQOHlYWVk2ajhsdWViazVPeW05QkViS3NrVG5IeHRaU09yb3BNZWdUMVQwOWxkenRVTmJpU0JqbnZsMlY1bFpzMXM3Q1hKMzczSDVmTTBVNW82Z2ROQW5kZGtaRDBRSmNqeUJXQdIB3wFBVV95cUxNaGw4UFhlTm9VS1lUcWtkQUtzcFNTZWtiaUlvX0hzSU5aTndHZjhkSDBxcy1McnZvemN4VmtZNzVsMmszRjRUTWFyQUR0ZXVIcEtodTdpZllSaVUteGRDS2xSZVIwSEstMGRfQjgzZERpR3hOUmczZGJUSkt5X3Jwc3RvNC1FVGNfaWJwbGtPX0h6WFF3dHlMcG9FMWk2YjVWVWtrTmUxemg0REJBNjk3QTJoNHlqTTUxZkFoTjNQQkJHNHNrSVg2UjNlbWZRRC1SRm9LRHdieHdBSE9YR21n?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 797,
    "word_count": 126,
    "gnews_title": "Stock Market Highlights: Sensex settles 386 pts lower; Nifty below 25,100; TaMo falls 3%, BEL 2% - The Economic Times",
    "published_date": "24/09/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market today: Nifty50 ends in red for 8th straight session; BSE Sensex closes below 80,300",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More In pics: Vijay Sethupathi’s fierce avatar in Bigg Boss Tamil 9 promo 10 small dog breeds perfect for apartment living: Family-friendly and easy to care for Disha Parmar approved top 10 stylish looks Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9 From Chic to Classy: Priyanka Mohan’s style evolution Mamitha Baiju mesmerizes; nature meets grace Monalisa stuns in red saree for Durga Puja Best family games that will make your kids forget all about screens Karthika Nair shines bright captivating hearts with beauty and poise Manasi Parekh's Ode to Grace Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-september-30-2025-dalal-street-global-markets-donald-trump-rbi-policy-us-government-shutdown/articleshow/124225010.cms",
    "original_url": "https://news.google.com/rss/articles/CBMivAJBVV95cUxOT3ZPRHJnS0lhUGEzUElpOXMzdEpjNFUtMXp2ajJwbVI1Q1dkUGFYWURDdWJzOTYxWWE1YlhZRVItUXpTMTcwWUItX1hsY3E0NW1BNGl2MnFUT1oxUFBKTUF1T2hUSXl1NmNMUjN1bWJYS0FTT0U0MS00V3NsQ0tFazFwLTZLUVRYekdxQ1liQ2tZcV90YjJmUnVhUnBRdGJjaTExS0pMNjJPYXVnazNJNjc4MGFnNnQzbEJnRU5mWDV3Z0x0WG9zRjgwRXJ4MG1uRlFYOUloUVBkOVFaVnlxaE9naUZkRWNlY0NtMmxreFRmMnl1eEI3a3VUT2I3dVN5Ym94QnNxV010TmQ2aWZTUlRkdU9kVzY3bjZUQlktNnR5dVNsSnVmQ2lUWUozU211V2hlUjhSOTloelNY0gHCAkFVX3lxTE05ZmpiOWk0WVZaQ2RJRVlFME9tVEtodkdieVk5RFJIQUs1emc3ZlFiMGpiS0tSbHpBOWRFczctZTVJOEpweEd4QXZKT29GVnh0Tm9VaGdIMWFha0F3RTAyNnNFMC03d0Y2ZkEydmlRUWxvbkRCMzFqSm92SHhkYXg4OGREbG1KMTFHR1RKOHF0bW9ack9RZ1lNRW41djZQa0pyU3dkdVM3SHNCaEEtTXQ3WTBLUEpNNXM3Sm9zajZwSEZRMkFVbjBIcFRTc3pPMWtiemxmYVB4Z0ZRY2pJX3pBOEY1NTVycHk0RmJ2dVBrck9nd3pra01zSE1zd0UteVRHdGFIMXphVzVjTlRTaTZ2SmY1QVZzdXl2V1dtUC1aSlN6MmRJZnVlMzZzRXp0OWpoVDRSLU1KNEVwaGx6OHA4WFE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1633,
    "word_count": 260,
    "gnews_title": "Stock market today: Nifty50 ends in red for 8th straight session; BSE Sensex closes below 80,300 - The Times of India",
    "published_date": "30/09/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Sensex settles 150 points higher, Nifty above 24,700; Britannia rises 3%, Apollo Hospitals 2%",
    "body": "Sensex Today | Nifty 50 | Stock Market LIVE Updates: Indian benchmark indices Sensex and Nifty settled higher on Thursday after the government's GST 2.0 reforms lifted investor sentiments on the D-Street. The tax overhaul aims to spur consumption ahead of the festive season and offset pressure from steep U.S. tariffs, among other factors. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-04-september-2025/liveblog/123688196.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxOc09ZUXcxUVktZzFZTzRYdnBLdXo0OU1lUWJyWFpZcHBlZGhVelh3SFZqRy13YndXWE8wMDlGb3I3RTRndXRTRGtYeWt4bFhOY3c1a25qU1dvTEJVQ2FTam1ObzhXZUdDZjdOTWYxY2E0TXFzenRZNC00RUxuVjFYZ0c4NXVUZGlJdlRpRjhsRkt1QjVMTXNfMDRWSUhjQjNSbURDNUVObzN1UWl0VmpCelcxWUJlbEZfVnlKVkdaLUNGbHdteXVFQ3E4UVlEekl0YnVMeTlNOWZfQdIB3wFBVV95cUxNT2ZyeUt1NXpwNHU0S200S1JMcDUtb3drX1NjLVkxMkk3MUkxbUlvd0FHazFYVW1Qd3dNZEQ5ckEyQ2ZZTDdBTDJKS0lpeHQ1akNUSjJRWW5RVGxicWJ0RGlHMTJ1NW1nbXktRElaUTdfRUJibWR4UG5QNFN0Uk1PXzU2RmpNVXlSZ3NfMkdBcF9FWDNoWk1SZ2V5VUxaLTRFQ19waEdFQmtRZE1WZVdkaWJULXNRNTlKSmIxV2g4TE05WnViYkFNVHV5NlBhQXVzZTRMRExzd0NINVh6QV9F?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 654,
    "word_count": 106,
    "gnews_title": "Sensex settles 150 points higher, Nifty above 24,700; Britannia rises 3%, Apollo Hospitals 2% - The Economic Times",
    "published_date": "04/09/2025",
    "publisher": "The Economic Times",
    "topic": "Nifty 50 stock market India"
  },
  {
    "title": "Stock market today: Nifty50 ends above 24,750; BSE Sensex up over 70 points",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More Deepika Padukone's style evolution from drapes to designer trails Rashmika Mandanna's saree looks to check for your next festive season 8 hair oils which are best to promote hair growth Lunar Eclipse 2025: In Pics-- Beautiful rare Blood Moon witnessed by millions across world Isha Malviya inspired top 10 glamorous looks Aishwarya in white — A poem of grace 'Gandhi Kannadi' actress's Namita Krishnamurthy’s elegant looks Charu Asopa’s Saree Moments You Can’t Miss How to convert an oversized shirt into a stylish crop top Small space, big results: How to start vertical gardening in balcony Determine the monthly installment amount for a loan Estimate the returns on investments made through SIPs Find out maturity amount and interest earned on PPF Check maturity amount and interest earned on an FD Estimate the pension amount and corpus accumulated under NPS A Mutual Fund Calculator helps estimate the future value of investments",
    "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-september-08-2025-dalal-street-indian-equities-global-markets/articleshow/123756237.cms",
    "original_url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxPS1NJXzFZaGxLSnFScjBkSG5CWENuMjdyeE1hYUxtdEJDZXdVVWc2aXhxRF9BLXVrdXlSTzRHbXFxcVZBNURuaHBTOC1tb25BYm9ickg2dVRJaUJvNVhrT0x6dVRaVlhRUVJDQjdKV0xuY2EtUWVUVnRkdkFTYnA5c3M5VDNUdC1Mckg5Ry1UUkwzS1VkYXlsQk95WGtBMXZPanV3RHhUSHkxaTNBNWl5VmFqdy1XYTg4aE50UF9CZFJWNHBvSWM3V0ZWbjdiTzE0ZEVXMW9MVHZhS3ZxS2pJUm5fVk5GTFQ2aE56SlhqcENDWldhVzVmUzRLLUZGbzQ2b3Bvd1hJN2NFNENaZmpQeHQya9IBmAJBVV95cUxQbzJJaTVNSzFKVjZNU05lLXdEWG1ET3RfdzlaQXVGdC1uNG5obERIUE1qaXJJOHJnSUtVNDE1SHBYU29SQm5vSkllVTJrT0Y4NDJEQUxmaGJoemFrbE9ybEd5bHV2czN6Y29RTzVUQU8zbkJSdGN1QjVZcS0wYTZvdU1XRFFWSG1hUll3eVMyUDlFS1h6YW8yV0pPOVBqRk1zZnpzWXgwYlNPdGN5ZkdLejVnZjdvVlJhMHg4QWVqbmVxNTIydzFIVTdEc25uQ04zSzBkVFhmaVdTZUdNQXphdzloY1JScWZnYWFsYUdOWWwzQWtZVUdtRjhCOGVER3JsUzFvQlVZWnktckMxeVhibTlsNHVLbldG?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1621,
    "word_count": 257,
    "gnews_title": "Stock market today: Nifty50 ends above 24,750; BSE Sensex up over 70 points - The Times of India",
    "published_date": "08/09/2025",
    "publisher": "The Times of India",
    "topic": "Nifty 50 stock market India"
  }
]