[
  {
    "title": "Is the NSE IPO coming Soon? A Comprehensive Overview",
    "body": "The National Stock Exchange of India Ltd. (NSE) is planning an initial public offering (IPO). The IPO will be a book-built issue, with 11.14 Cr shares being offered to the public, as per its DRHP dated 28 December 2016. The shares will be offered in the following categories: Qualified Institutional (maximum 50%), Non-Institutional (minimum 15%), and Retail Individual (minimum 35%). The dates, issue size and price band for the IPO are yet to be announced. The company reapplied for the market regulator's approval in August 2024, but the Indian market regulator has yet to provide a valid justification for withholding permission for the IPO. NSE holds a dominant position in the Indian capital market and equity derivative segments. It has a 92.7% market share in cash equities, 99.9% in Equity Futures, and 96.9% in Equity Options. NSE is the world's largest derivatives exchange by trading volume and the third-largest in cash equities by the number of trades. The exchange also provides co-location facilities for high-volume and high-frequency traders. Between 2019 and 2024, NSE demonstrated remarkable financial growth, with sales growing more than fivefold from ₹3,027.79 crores to ₹16,433.61 crores and net profits soaring more than fourfold from ₹1,708.04 crores to ₹8,305.74 crores. The company’s profit before tax also surged from ₹2,576.21 crore in FY19 to ₹11,184.28 crore in FY24. NSE has achieved this growth while maintaining an asset-light business model and avoiding reliance on debt. By FY24, its total assets had grown significantly to ₹65,464 crore from ₹19,978 crore in FY19. A major portion of its revenue, 73.8%, comes from transaction charges, followed by 5.4% from co-location charges and 10.79% from other fees, underscoring its strong and diversified revenue streams. Recently, NSE has faced several legal challenges related to co-location, dark fibre, corporate governance, conflict of interest, trading access point (TAP), and interoperability. However, Nuvama Institutional Equities stated that NSE is on track to overcome these issues. SEBI recently disposed of a show cause notice against NSE and its former executives in the co-location case due to insufficient evidence. The Securities Appellate Tribunal (SAT) dismissed SEBI’s appeals on corporate governance and conflict of interest matters in July. NSE also settled SEBI's probe into TAP system violations by paying Rs 6.43 billion in September 2024 and resolved interoperability non-compliance issues by paying Rs 271.3 million in November 2023. As of January 13, NSE is trading at Rs 1,800 per share in the unlisted market. The unlisted shares are currently quoted at Rs 7,300 per share on WWIPL (Wealth Wisdom India Private Limited). In November 2024, NSE issued four bonus shares for every one share held, resulting in a subdivision of shares. Key domestic investors in the NSE include Life Insurance Corporation (LIC), which holds a 10.72% stake, Stock Holding Corporation of India, which holds a 4.44% stake, and Radhakishan Damani (who owns a 1.6% stake). SBI Capital Markets holds approximately 4.4%, while the State Bank of India (SBI) owns 3.23%. The Indian economy is rapidly growing, and the increasing digitization and formalization of the economy are projected to drive growth in the financial sector. NSE is well-positioned to capitalize on this growth with its innovative products and services. The surge in retail investor participation also points to a demand for new offerings. Read More :Rikhav Securities IPO Allotment Status|Kabra Jewels IPO Allotment Status Disclaimer: This news is solely for educational purposes. The securities/investments quoted here are not recommendatory.",
    "url": "https://groww.in/blog/is-the-nse-ipo-coming-soon",
    "original_url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE9MdDBaM3ZhZFl4X3pHbXlBa1gza0ozRDg4U2NBMVFxd2FjVHlCRXBNMHFTbml2bGpBSDN3MVNHaEI1TFpOR2x6NDlNRk5YSnpsLVo0TWhsaXZtUXhP?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3693,
    "word_count": 567,
    "gnews_title": "Is the NSE IPO coming Soon? A Comprehensive Overview - Groww",
    "published_date": "20/01/2025",
    "publisher": "Groww",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE adds 10 million investors in 5 months, surpasses 110 million mark",
    "body": "It took 14 years since the NSE's commencement of operations in 1994 to reach 10 million investors. The National Stock Exchange (NSE) on Wednesday said its unique registered investors have crossed the 11 crore mark, with the latest 1 crore addition taking place in just five months, reflecting investor participation in the stock market through direct means. Investor registrations at the NSE have experienced a remarkable acceleration in recent times, with a 3.6 times jump in the last five years. It took 14 years since the NSE's commencement of operations in 1994 to reach 1 crore investors. The pace then quickened, with the next 1 crore registrations taking about seven years, followed by another 3.5 years for the next crore and the subsequent milestone of adding the fourth crore took just over a year. \"The rate of growth has since quickened significantly, with each additional 1 crore investors being added in roughly 6-7 months, while the last 1 crore investors were added in just over five months, reflecting a shift in investor enthusiasm and participation in the stock market through direct means,\" NSE said in a statement. In the last five months, daily new unique investor registrations have consistently ranged between 47,000 and 73,000. This growth has been driven by several key factors, including the rapid advancement of digitisation, heightened investor awareness, financial inclusion efforts, and strong market performance. In 2024, the Nifty 50 index delivered a return of 8.8 per cent while the Nifty 500 index saw an impressive 15.2 per cent gain. Indian markets have had positive returns for the past nine consecutive years. \"As the new year begins, India's capital markets have achieved a significant milestone, with the number of registered investors at NSE exceeding the 11-crore mark. This rapid growth, with over one crore new investors added in just five months since crossing the 10-crore mark in August, reflects rising confidence of the Indian public in the stock market as a trusted avenue for wealth creation,\" Sriram Krishnan, Chief Business Development Officer at NSE, said. With this, the total number of client codes (accounts) registered with the exchange stands at 21 crore. This includes all client registrations done till date. Notably, clients can register with more than one trading member. Krishnan said that factors such as enhanced digital accessibility, increased investor education, and government initiatives promoting financial inclusion have driven this surge. Additionally, a younger, tech-savvy population and growing awareness of the benefits of equity investments have further accelerated this trend. Investor growth has also expanded beyond the urban centres, with all but 30 pin codes in the country having investors registered with the exchange, implying a coverage of 99.84 per cent in the country. In terms of geography, Maharashtra leads with 1.8 crore registered investors, followed by Uttar Pradesh at 1.2 crore, and Gujarat at 98 lakh and these three states account for 36.6 per cent of the 11 crore investors. Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Jan 22 2025 | 4:55 PM IST Zubeen Garg death case: Festival organiser & manager arrested; what’s going on? RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US",
    "url": "https://www.business-standard.com/markets/news/nse-adds-10-million-investors-in-5-months-surpasses-110-million-mark-125012200929_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNcmJyRWhSczhGek5sTU5PT0RyVkxCSUwxbmVpcG4xZUdjN0N0UENxMkxUOXVfbUNaMzdWOFBoUnZCNmNRd3NZNE01V29teG9DU2RzYndVU1Z6dnR4bndUMl9sNkp3YkV2Y3V4REYyd2kwNkxWd3FxOTlTQ2JPQ0g3aXZidnB0RmhHYVE0b0p6OWpYV3Z3TWk5UW1OTEpsUFdlVncxZm1rTmlqZnY2LUhEVjg5ZFUySVV6a0JQaUNxUXoweXNMYnY4eVFfVmtOakNm0gHWAUFVX3lxTE1VckJFMzI1RVZoSm9KSkVyYUg5VzJUTXdGajhFa21FX2pObGdxMWJKRjZrUE55UUdTOGUta0EyZ3BPWUNDTmpRREtsQWlOMTl2MGlCQUEyak5MbkEzUlNTa0IwTjA5T0NBcDNVY0t1djVoS21XOTlKcHJVYmRIN1VnelBPb1I1ZWZ3b0xwSWxvaklwcUstbDY2YzRBVmZFV3JFb2lRcWJsYjlKN2QzM21Ya3pPZU0zSWctV3dxTEh2N0I2ckhsdENUOTNMdUhzZGJMSk9SZmc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3573,
    "word_count": 581,
    "gnews_title": "NSE adds 10 million investors in 5 months, surpasses 110 million mark - Business Standard",
    "published_date": "22/01/2025",
    "publisher": "Business Standard",
    "topic": "NSE India trading"
  },
  {
    "title": "Castrol India, Gland Pharma not eligible to enter F&O, NSE modifies previous order",
    "body": "The National Stock Exchange (NSE) will be excluding shares of Castrol India and Gland Pharma from the Futures & Options (F&O) segment starting January 31, a statement from the exchange said on January 24. A circular modifying theprevious intimation, dated January 7, was shared by NSE, citing incomplete 'eligibility criteria' as the reason behind the decision to exclude. \"...it is being hereby informed that the below securities have not fulfilled one of the eligibility criteria ason date,\" said NSE, namingCastrol IndiaandGland Pharmain its latest communication. \"Members are requested to note that the availability of the above two securities for trading in Futures & Options contracts with effect from January 31, 2025 stands withdrawn,\" the circular said. No further explanation has been shared as to what criteria was not fulfilled, leading to the withdrawal from the segment. Previously, NSE had proposed to include six companies, including these two, in the F&O space for trading from January 31, 2025. There is no change for other four securities, namely, NBCC, Phoenix, Solar Industries India and Torrent Power, as mentioned in the circular earlier. The National Stock Exchange had also announced the removal of 16 stocks from the F&O segment, effective February 28, 2025, stating that no contracts will be available for trading beyond this date. The excluded stocks include PVR Inox, United Breweries, Abbott India, Atul, Bata India, Can Fin Homes, Coromandel International, City Union Bank, Gujarat Narmada Valley Fertilizers and Chemicals, Gujarat Gas, IndiaMart Intermesh, IPCA Laboratories, Dr. Lal Path Labs, Metropolis Healthcare, Navin Fluorine International, and Sun TV Network. The market lot and scheme of strikes of the securities shall be informed to members on January 30, 2025 through a separate circular. Analysts have previously said that inclusion in the derivatives segment can significantly enhance trading volumes and price discovery for these stocks. NSE's MD and CEO Ashish Chauhan has in the past said that many of these stocks were included after achieving higher liquidity and size thresholds. Discover the latestBusiness News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated! Find the best of Al News in one place, specially curated for you every weekend. Stay on top of the latest tech trends and biggest startup news. You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/castrol-india-gland-pharma-not-eligible-to-enter-f-o-nse-modifies-previous-order-12918781.html",
    "original_url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxNZWVlRVpzWHRJczREUDFYYk1nME9faTZrMkRHVUI0OEFpMWowVXg4MzF2ZDhtM0trRjluczE4ZjlORTFBMWVUQ0lkQlVMSVNtUFJVNS1hRjJlZTlqY0Ixc2JPeGViclpja082NVhNeFBYOFdxbHQ0dHNjcEtrb0dWSEFSYlhWbU1LenBMdng4Y3BFWGhWNEt4YjNaUEcwZk1xNUhBOF80QkFZQWpIY0M1UEtXWEhKSGxDdzBvekVXQ1JMZEs4VGN3WDNZSjJ4bUNEVjdjSU5fMGJtUm5PaHfSAeMBQVVfeXFMTS1ZcVZBcXNBVUVZeWEzdVBHamRwUzVOUTY5R0VuY2RodDdJQjNYSnJPTXR5TElnejBld1BQMjNpU05kb0JiQUluNFpVQ0dyMGpyVmJOaXU5ODY0X01jRmNqQlBKOXZjVTFNa1lfX2JNa2Y0SGFjYzhJanozYXJySXNKZ011cVRINnZKU2FGOTl0SnhtSE1RUTZHV1k1TElUMkE1bWlCaEJzcE10dWptYUJNdmdqYzZvRzM1Z3JPb3l5Zm9CdE5GSUpnN0sxMWNEWXdLMlp6aFZrS0k3SmYtMG10dlU?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2501,
    "word_count": 379,
    "gnews_title": "Castrol India, Gland Pharma not eligible to enter F&O, NSE modifies previous order - Moneycontrol",
    "published_date": "24/01/2025",
    "publisher": "Moneycontrol",
    "topic": "NSE India trading"
  },
  {
    "title": "Swan Defence resumes trading on NSE and BSE, shares rise 5 per cent",
    "body": "Swan Defence and Heavy Industries Limited (SDHI) reached a critical milestone when its shares resumed trading on the National Stock Exchange (NSE) and the Bombay Stock Exchange (BSE). The stock opened at Rs 35.99 on the BSE under the scrip code 533107/SWANDEF and has increased by five per cent this session, reaching an intra-day high of Rs 37.78. Vivek Merchant, Director, Swan Defence and Heavy Industries, said that “The resumption of trading marks a new journey to transform their shipyard into a premier global maritime hub, advancing India’s position in global shipbuilding. ” The company completed the Indian Coast Guard’s Raj Ratan patrol vessel refit ahead of schedule, showcasing strong execution capabilities. Swan Defence’s strategy emphasis on expansion and innovation is reflected in the preparations being made to start shipbuilding operations at its shipyard.",
    "url": "https://www.manufacturingtodayindia.com/swan-defence-resumes-trading-on-nse-and-bse-shares-rise-5-per-cent",
    "original_url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQVlZ2YUlFLU1xeDI1c3BGY2hFSHFNanYtNTNhbUhpaEcyYlZMWERxRmJHemoyb2dHb1lmY0NHS0Vqd1JGU1h0RC0xZFcyTldEX3dtLWhqZWN1QlhvcXdPZV9LcGJkLTVtaWYzYldfbEFURFNXSmxhT09jM2VIcHJqN1pmNVQxM3JySmJld1lSZzUtUEY0ekFUVmJrWU5rMHpINi01anlmbFQ5Zw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 876,
    "word_count": 134,
    "gnews_title": "Swan Defence resumes trading on NSE and BSE, shares rise 5 per cent - Manufacturing Today India",
    "published_date": "21/01/2025",
    "publisher": "Manufacturing Today India",
    "topic": "NSE India trading"
  },
  {
    "title": "Stallion India Share Price Highlights: Stock jumps over 33% in debut trade",
    "body": "Stallion India Share Price Highlights: Stock jumps over 33% in debut trade 5 min read | Updated on January 23, 2025, 12:15 IST Stallion India Fluorochemicals Share Price Highlights: Stallion India Fluorochemicals shares were listed at ₹120 apiece on the NSE and the BSE on Thursday, January 23, reflecting a premium of 33.33% over the issue price of ₹90 per unit. Stallion India IPO received 188.38 times subscription on the closing day of bidding on Monday. Stallion India Fluorochemicals shares jump over 33% in debut trade Shares of Stallion India Fluorochemicals were listed on Thursday at a premium of more than 33% on the bourses against the issue price of ₹90. The stock debuted at ₹120 on the BSE and the NSE, registering a leap of 33.33% each from the issue price. Later, the stock rose 5% to ₹126 and ₹125.99 apiece -- to hit its upper circuit level -- on the NSE and the BSE. January 23, 2025, 12:15 PM Stallion India promoter holding Manisha Shazad Rustomji, Shazad Sheriar Rustomji, and Rohan Shazad Rustomji are the company promoters. Their shareholding was reduced to 67.90% post-listing from 94.63% pre-issue. January 23, 2025, 11:43 AM How will Stallion India use IPO proceeds? The money raised will be used towards funding working capital needs, capital expenditure for its proposed plants in Maharashtra and Andhra Pradesh, and general corporate purposes. January 23, 2025, 11:27 AM Stallion India m-cap hits ₹999.5 crore The market capitalisation of Stallion India stands at ₹999.50 crore as shares hit 5% upper circuit on the NSE. January 23, 2025, 11:07 AM Stallion India trading stats January 23, 2025, 10:46 AM Stallion India price information January 23, 2025, 10:36 AM Stallion India shares up 4.99% on BSE Shares of Stallion India Fluorochemicals are trading at ₹125.99 apiece, up 4.99%, its upper circuit on the BSE. January 23, 2025, 10:24 AM Stallion India shares hit 5% upper circuit After listing at a 33.33% premium, Stallion India shares hit a 5% upper circuit and traded at ₹126 apiece on the NSE. January 23, 2025, 10:12 AM Stallion India Fluorochemicals shares list at 33.33% premium on NSE and BSE January 23, 2025, 10:00 AM Stallion India Fluorochemicals shares trade at 33.3% premium in pre-open market In the pre-open market, Stallion India Fluorochemicals shares trade at ₹120 a unit on the National Stock Exchange, a premium of 33.33% over the issue price of ₹90 apiece. January 23, 2025, 09:45 AM Stallion India Fluorochemicals risks January 23, 2025, 09:35 AM Stallion India Fluorochemicals strengths January 23, 2025, 09:26 AM Here's how Stallion India Fluorochemicals performed in H1FY25, FY24 and FY23 January 23, 2025, 09:18 AM Stallion India Fluorochemicals IPO timeline The issue was open for subscription from January 16 to January 20. The allotment status was finalised on January 21. Shares were credited to the Demat accounts of successful investors on Wednesday. The stock will be listed on stock exchanges at 10 am on Thursday. January 23, 2025, 09:08 AM Stallion India Fluorochemicals IPO lot size Investors were allowed to bid for at least 165 shares worth ₹14,850 and in multiples thereafter. January 23, 2025, 09:00 AM Stallion India Fluorochemicals price band Stallion India Fluorochemicals had fixed a price band of ₹85 to ₹90 per share for its initial public offer. January 23, 2025, 08:51 AM Stallion India Fluorochemicals IPO: Listing date and time January 23, 2025, 08:46 AM Stallion India IPO Listing: Subscription details The ₹199.45 crore public offer was subscribed 188.38 times, as bids were received for 2,92,22,89,425 equity shares against 1,55,12,978 shares on offer. The non-institutional investors' quota was subscribed 422.42 times, while qualified institutional investors bid 172.93 times. The retail investors subscribed their portion 96.90 times. January 23, 2025, 08:45 AM Stallion India Fluorochemicals shares to be listed on January 23 January 23, 2025, 08:44 AM By signing up you agree to Upstox’sTerms & Conditions",
    "url": "https://upstox.com/news/market-news/ipo/stallion-india-fluorochemicals-listing-date-share-price-live-shares-list-premium-nse-bse-stock-news-review-all-you-need-to-know/liveblog-141882/",
    "original_url": "https://news.google.com/rss/articles/CBMikgJBVV95cUxPcUkwam40bU52MC1NX2Q1QXNuVjJ5WWhjRW5UZ19xTTFtdWh6MjkxQUZoeVUzYWQ4T003dDlNb0xrUmdQRTFTMGhVY2RvYlBPaTMzRWp2NlVxekgxcmdoR3JLa3RieVVrR2gwM2xIU05PWXVYbDdibkpLU0FySndIWGlfN3NXNUdBWmZEZ1lMeDVhOXRJWk1wVkFQU1RNTGFpTzc2X0RPOExKeTBTUlROaXVEYW55aWQxTlBQc0pCTWRJd2tST3JpYmJNU2dQR29BM1RBUnJlYk5hZGJ6cmw0RWJWM0dLRlk1WkFYSnU1RExlVjJmSXlQb0M1bE1IVmtqVml0NXc5VkZaU09KYW1QSldB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4000,
    "word_count": 644,
    "gnews_title": "Stallion India Share Price Highlights: Stock jumps over 33% in debut trade - Upstox",
    "published_date": "22/01/2025",
    "publisher": "Upstox",
    "topic": "NSE India trading"
  },
  {
    "title": "Defence stock jumps 278% upon relisting on NSE and BSE after 1.5 years",
    "body": "Defence stock jumps 278% upon relisting on NSE and BSE after 1.5 years by Trade Brains | January 21, 2025 11:38 am During Tuesday’s trading session, the shares of India’s largest shipbuilding and heavy fabrication company in India hit a 5 percent upper circuit at Rs. 39.66 on BSE, after the company’s relisting on the Indian stock exchanges—BSE and NSE—after a gap of 1.5 years. With a market cap of Rs. 209 crores, the shares of Swan Defence and Heavy Industries Limited opened in the green at Rs. 39.66, as compared to its previous closing price of Rs. 37.78. Stock Relisting Details Swan Defence and Heavy Industries Limited was relisted on the BSE and NSE on Monday, 20th January 2025, marking its return to trading after 1.5 years. The stock opened at Rs. 35.99 on BSE and climbed 5 percent to hit the upper circuit limit of Rs. 37.78 on Monday’s trading session. On 17th January, the company announced that trading of its shares would resume from 20th January. Commenting on the relisting, the Director of SDHI stated: “ The resumption of trading in Swan Defence and Heavy Industries shares marks the beginning of a new journey for the shipyard. Our vision is to establish the shipyard as a globally renowned centre of innovation and craftsmanship, playing a pivotal role in elevating India’s standing amongst the world’s top shipbuilding nations. ” Scrip Code – 533107 , Symbol – SWANDEF Related Updates The company’s relisting aligns with its recent rebranding initiatives. Earlier this month on 2nd January, Swan Energy announced that its acquired entity, Reliance Naval and Engineering Ltd (RNEL), had been renamed Swan Defence and Heavy Industries Ltd (SDHI). This move follows Swan Energy’s acquisition last year of the former Reliance Naval & Engineering, previously part of the Anil Ambani group. With this acquisition, Swan Energy aims to establish itself as a key private player in India’s naval defence sector and the construction of oil & gas vessels. As part of the restructuring, RNEL’s old shares were converted into SDHI shares at a conversion ratio of 275 RNEL shares for one Swan Defence share. The total equity structure includes 26.81 lakh shares held by the public, alongside 5 crore additional shares issued to Hazel Infra, the acquirer through the NCLT process, resulting in a total equity of Rs. 52.68 crore. About the Company Swan Defence and Heavy Industries Limited (SDHI) is India’s largest shipbuilding and heavy fabrication company strategically located on the west coast of India. It is a key private player in commercial & defence shipbuilding, ship repairs, and heavy fabrication in India. Written by Shivani Singh Disclaimer The views and investment tips expressed by investment experts/broking houses/rating agencies on tradebrains.in are their own, and not that of the website or its management. Investing in equities poses a risk of financial losses. Investors must therefore exercise due caution while investing or trading in stocks. Dailyraven Technologies or the author are not liable for any losses caused as a result of the decision based on this article. Please consult your investment advisor before investing .",
    "url": "https://tradebrains.in/defence-stock-jumps-278-upon-relisting-on-nse-and-bse-after-1-5-years/",
    "original_url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNNHFHN3pjYWstUFFnS1Nsb1dTTUc3a1pfSS1oNkx2T1ZJWE5XMlFyZVNHV0tHNHd6YlAxaFloc3ZlTDdVaGtkYUR0Skt6YlNaX24wWkRFYVMxR0FsWFIyYngzVzNnWmlRV3BmbFJyNlVUZzQ2T1BSZmJhVWRKOTRsSHh6T3QwTE4wS1FpZjN3VU84dlVDQ3BkYw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3162,
    "word_count": 515,
    "gnews_title": "Defence stock jumps 278% upon relisting on NSE and BSE after 1.5 years - Trade Brains",
    "published_date": "21/01/2025",
    "publisher": "Trade Brains",
    "topic": "NSE India trading"
  }
]