[
  {
    "title": "Stock market holiday: Are BSE, NSE closed on Jan 14 for Makar Sankranti?",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Jan 13 2025 | 5:37 PM IST Zubeen Garg death case: Festival organiser & manager arrested; what’s going on? RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US",
    "url": "https://www.business-standard.com/markets/news/stock-market-holiday-bse-nse-january-14-makar-sankranti-125011300766_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNSmg5QW1pblJ2WnU3LVZnX1BSR1VESTFsbnE3NGVTWXNudDJ4aEQwWmxMSm4teHl6SE41TFhreGFKc0tiR2JiQUQ1ekNsTlVzNGJhWmNhZ1dEWFhDUnA1cFVOS3Vvb0F3NjZtRC0xVG1PYlVGWHlzekVqTmlPeWpyRFJ0elpoU3VuZjhvOGwxeU1idkFlNUNXeFYtYTJTQzloTFVBQ1EyLW14TW5ma1lIbzRFYWNSTWw3ZkxCZGtKSdIBxAFBVV95cUxPRmFvOElBS3I1QnJoY3ZiUDgteWJjenh0YkZyVURhUWMxdmphMkxjMTl3UFhTYUp1TFFweUtPUWJfZ0plQzRFMXNUU1A1WlczRjFrclhZM0ZoYUYwUExmTG9tNzRfZ0FFcVZ2ME4tSTdHWngwVFhDc0tmRGlReHYzdzBjS3psX1R0LXpncUhZek1CNTA3ZURMaVJwOHZPQ0xWX0pjSVFndWF6c3J4U1NfRnlRWkVuLVozY3ZZN3R5b1dnY3FZ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 495,
    "word_count": 95,
    "gnews_title": "Stock market holiday: Are BSE, NSE closed on Jan 14 for Makar Sankranti? - Business Standard",
    "published_date": "14/01/2025",
    "publisher": "Business Standard",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock market holiday: Are BSE, NSE open on January 14, Makar Sankranti?",
    "body": "Amid the market downturn, a break on Dalal Street might have been welcomed, but the BSE and NSE holiday schedules indicate otherwise. India prepares to celebrate festivals like Makar Sankranti, Pongal, and Lohri on January 14. Many traders and investors are wondering whether the stock markets will remain closed for the festivities. However, according to the official holiday calendar released by the Bombay Stock Exchange (BSE) and the National Stock Exchange (NSE), the stock markets will remain open on this day. Despite the holiday mood across the country, January 14 is not listed as a trading holiday, meaning that both exchanges will operate as usual. Trading in equities, derivatives, bonds, commodities, and currencies will take place during regular market hours from 9.15 AM to 3.30 PM. The holiday schedules for the BSE and NSE are determined based on national holidays and key religious and cultural festivals that are widely observed across the country. While Makar Sankranti and Pongal are celebrated in many states, they are considered regional holidays and do not feature on the official list of trading holidays. For 2025, the BSE and NSE have announced a total of 14 holidays when the markets will remain closed. These include major festivals such as Diwali, Holi, and Eid, as well as national observances like Independence Day and Republic Day. However, regional festivals like Pongal, Ugadi, and Onam typically do not qualify for market holidays unless they coincide with other national events. While the stock markets will remain open, the Reserve Bank of India (RBI) has declared January 14 as a bank holiday in select states for Makar Sankranti and Pongal. This means that banking operations such as cheque clearing and branch services may be unavailable in some regions. Customers are advised to check with their local banks for specific details. Here is the complete list of trading holidays for the Indian stock markets in 2025: February 26: Mahashivratri March 31: Eid-Ul-Fitr (Ramzan Id) April 10: Shri Mahavir Jayanti April 14: Dr Baba Saheb Ambedkar Jayanti April 18: Good Friday May 1: Maharashtra Day August 15: Independence Day August 27: Ganesh Chaturthi October 2: Mahatma Gandhi Jayanti October 21: Diwali (Laxmi Pujan) October 22: Diwali (Balipratipada) November 5: Prakash Gurpurb (Guru Nanak Jayanti) December 25: Christmas",
    "url": "https://www.indiatoday.in/business/story/stock-market-holiday-are-bse-nse-open-on-tuesday-january-14-for-pongal-makar-sankranti-2025-2664384-2025-01-14",
    "original_url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQX2tkejlHblIzYkt5U3BlZ2p2a3A0OEVPQTlpb2c2ZG1ZTUM1Yjg1WnNZWmlxX2hsTmlMS1I1UXNFZTc4Z3RpbGUyV3dhRm9yRF9VVjNCU3l6QUlJa2g1NXVpSlFRTkwwSEJ0bm81MkY1Yk5GdzVqbUU0Ry10WHljN2QtX09uYlRwVGx3MW9MMlZyVFpzVXV6Z1pvOU1LazVfRVN0ZFQzendsbUZUNjJybmFKT2F6QXhSclBNbjlnNFE3TjJNeG9Va0JJd0tvSlZoT0dqZUxnQ0d3VVJVcFIyN0twS3BWUdIB6wFBVV95cUxPRFZhVjhxdVV1dWtXZG5hOV9RVzltd1BOSEtDUl94VWtqZzl5b2hRN1FDOEdJYVdqemNzeFRGRGQxbmRzOC1DS0M3MEhWdFlMOV80cDVLcjR1TVBiX25PY0M1OWtCSmZRMTVwUWx3cDZFNUc5QmM3Nmp6MWJrUC1oWktXTFFxT2tlMncxcVZtLWVWYWp0elhDV2E4NXA4RV9pUS15b2FPZ1NXUDVseHpPMzRpOEY1bWZoRGx3REp3aVBaUFJTQ085VWN5TEpaR2hBRFp4NTQ2SU1JQno1dzcxREFrc2dyOExNeUY4?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2363,
    "word_count": 375,
    "gnews_title": "Stock market holiday: Are BSE, NSE open on January 14, Makar Sankranti? - India Today",
    "published_date": "14/01/2025",
    "publisher": "India Today",
    "topic": "NSE India trading"
  },
  {
    "title": "Makar Sankranti 2025: Is the stock market open today? Check NSE holiday calendar",
    "body": "ETMarkets.com Indian stock markets open higher on Makar Sankranti. Indian stock markets will remain open on Tuesday, January 14, the day celebrated as Makar Sankranti . All segments, including equity, derivatives, and SLB, will operate as usual. Additionally, the Multi-Commodity Exchange (MCX) will also remain open for both the morning and evening sessions. The BSE and NSE holiday calendars consist of 14 days throughout the year when trading will be suspended on both exchanges. Next, and the first market closure of the year will be on February 26th, on account of Mahashivratri. Trading holidays are distributed throughout the year as follows: February, May, November, and December each have one; March and August have two each; and April and October have the most, with three each. In addition to the holiday, it should also be noted that the stock market will remain open on February 1, on the Budget Day, in order to ensure investor access and timely reactions to Budget announcements. Trading hours on February 1 are expected to follow the regular market timings to ensure a smooth operation. Also read: Angel One shares slide 6% even as Q3 PAT rises 8% YoY to Rs 281 crore For the first half of the year, trading will be halted on the 14th March for Holi and again on the March 31 for Eid-Ul-Fitr (Ramadan Eid). April will see three holidays: Shri Mahavir Jayanti on April 10th, Dr. Baba Saheb Ambedkar Jayanti on April 14th, and Good Friday on April 18th. Maharashtra Day will be observed on May 1st, resulting in a market holiday. Several public holidays in 2025 coincide with weekends. Republic Day (January 26th), Shri Ram Navami (April 6th), and Muharram (July 6th) all fall on Sundays, while Bakri Id falls on Saturday, June 7th. Since these dates already fall on non-trading days, they do not impact the stock market's operational schedule. On Tuesday, domestic benchmark indices, Sensex and Nifty50, opened higher, rebounding from seven-month lows in the previous session, driven by gains in banking, auto, and energy stocks. The BSE Sensex rose 372 points, or 0.49%, to 76,711, while the Nifty50 gained 120 points, or 0.52%, trading at 23,206 around 9:21 am. ( Disclaimer : Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times) Add as a Reliable and Trusted News Source Add Now! (You can now subscribe to our ETMarkets WhatsApp channel ) Read More News on indian stock markets makar sankranti bse nse sensex NSE holiday January 14 2025 Indian stock market January 14 2025 opening hours Makar Sankranti stock market open or close stock market trading schedule 2025 BSE NSE trading holidays 2025 (What's moving Sensex and Nifty Track latest market news , stock tips , Budget 2025 , Share Market on Budget 2025 and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today . Top Trending Stocks: SBI Share Price , Axis Bank Share Price , HDFC Bank Share Price , Infosys Share Price , Wipro Share Price , NTPC Share Price ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition As RIL, Adani, Tata wait in the wings, this 90-page rulebook could shatter India’s N-power dreams How forgery, murder and Lord Hanuman are woven into multi-crore insurance crimes Automakers hit the brakes on deliveries as cess losses stall dealer inventories Can amendments untangle the bankruptcy law hobbled at courts? Stock Radar: This fintech stock hits fresh highs in September; trading in a rising channel; check for target & stop loss For wealth creation, focus on ‘Irrespective of & Despite Trump’: 7 mid-caps from different sectors with upside potential of up to 42% 1 2 3 View all Stories",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/nse-holiday-today-is-the-stock-market-open-or-close-today-for-makar-sankranti-2025/articleshow/117222763.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxPZnVMTnFIaFA0Y05pcWk4QjRUVXFzeVM0OWlIZXVNaUZxbjBTbXlpN3FtZHVCR2tNRWVTLU1CeWpDX3hCdGpFMTZyVlpoR1VpXzBxam45V0gwQW1aRXhUcngxNnl0NGFDUzB5SFl2OWdhcXlrQ0JzM19uNzloSUJ4MjAzY0J1dmM2OF91OHdsZWdOMGVCY3lkQlgzbmY5WG53ZlJqdFpUSXQ3UEcyOWtmcnl1RzM0VlJFZkhzQzBEcG9zYURoQnI5b0hxWWVDVjFWWnhTWVRkNHEwdll2enh1blVsSGQyRDYzQmRhVtIB8gFBVV95cUxOcWhCNFFVMUZtQnZuRUR1RXdDWW9vYkd0aHBJbi05bWVfbXNzdjZNTUVSbHZhQWM5czZZM25HV01WQUlhVWY2ejBvV1ItOXZlaVdUeWdpVzlBSS1OZWthZzN1MVhoVmZ1YW9fQWtZeG1QNWlIUElVOENvLVNTZFRyUmVkNGM2anpONWtGeXRJVmRtbXdNalRFem1Ud2tEaEVKUUlRS1FtQlNzTGt6ZGRBaVhkazBuWkhSUWl5UHprRWYyY3dMeWttbHdrbTlHdXh2Nmxnc2RldlBtTm14UGxLWlJnbDluSU9TUVRkVFVyQ08zZw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3927,
    "word_count": 655,
    "gnews_title": "Makar Sankranti 2025: Is the stock market open today? Check NSE holiday calendar - The Economic Times",
    "published_date": "14/01/2025",
    "publisher": "The Economic Times",
    "topic": "NSE India trading"
  },
  {
    "title": "Share Market Highlights 14 January 2025: Sensex, Nifty see modest gains as financials recover",
    "body": "Stock Market Growth istock photo for BL | Photo Credit: innni D escription: Stock Market on 14 January 2025 | Share Market Updates - Find here all the updates related to Sensex, Nifty, BSE, NSE, share prices and Indian stock markets. January 14, 2025 16:08 Stock market updates: The live blog is now closed. January 14, 2025 15:39 Nifty Today: Top gainers, losers on the NSE WhatsApp Image 2025-01-14 at 15.36.32.jpeg January 14, 2025 15:38 Closing Bell: Sensex closed 169.62 pts or 0.22% higher at 76,499.63, and Nifty 50 ended positive by 90.10 pts or 0.39% at 23,176.05. January 14, 2025 15:34 Stock market Live updates: Globe Textiles (India) Limited has announced its Rights Issue, Globe Textiles (India) Limited has announced its Rights Issue, offering eligible shareholders a valuable opportunity to enhance their engagement and equity ownership in the company. The company seeks to raise upto ₹4,504 lakhs through the Rights Issue to support strategic investments aimed at long-term growth, including initiatives in R&D, product development, and market expansion. Stock traded at ₹4.91 on the NSE. January 14, 2025 15:34 Stock Market Live Updates: HDFC Asset Management Company recorded ₹641.36 crore net profit HDFC Asset Management Company recorded a consolidated net profit for quarter ended December 2024 as at ₹641.36 crore as against ₹487.92 crore in the corresponding quarter last year. HDFC stock traded flat on the NSE at ₹3,858.90. January 14, 2025 15:33 Stock market live updates: Hyundai Motor India stock traded flat on the NSE as at 1,779.95. Company’s Hyundai CRETA Electric to launch on January17, 2025 January 14, 2025 14:41 Stock market live updates: Paytm shares traded at ₹819.45 on the NSE, up 3.77%. January 14, 2025 14:34 Stock Market Live Updates: Major Adani Group stocks are in green zone and trading at day’s high Adani Ports: CMP 1099, Up 3.0% Adani Ent: CMP 2317.0, Up 4.1% Adani Green Energy: CMP 956, Up 7.4% Adani Power: CMP 487.0, Up 8.3% Adani Wilmar: CMP 268.0, Up 2.3% Adani Total: CMP 662.0 Up 5.4% Adani Energy: CMP 736.0 Up 6.8% ACC: CMP 1905, Up 2.5% Ambuja: CMP 502.0, Up 1.8% NDTV: CMP 144.3, Up 3.5% January 14, 2025 14:33 Stock Market Live Updates: Investment Fund for investing in Indian Railways ecosystem Groww Mutual Fund has introduced India’s first Nifty India Railways PSU ETF , aiming to offer retail investors the opportunity to invest in the Indian Railways ecosystem, a fundamental pillar of India’s infrastructure. The NFO period of the scheme is from 16-30 January, 2025 January 14, 2025 14:32 Stock Market Live Updates: Piramal Enterprises stock zoomed 8.19% on the NSE to trade at ₹1,025.50 January 14, 2025 14:32 Stock Market Live Updates: TCI Express board to consider and approve financial results on Feb 6. Stock traded flat on the NSE at ₹776.85. January 14, 2025 14:32 Stock Market Live Updates: Rise in imports of soyabean oil and sunflower oil A significant jump in the imports of soyabean oil and sunflower oil has led India to register 13.03 per cent growth in edible oils imports in the first two months of the oil year 2024-25 (November-October). January 14, 2025 14:31 Stock Market Live Updates: Laxmi Dental has been subscribed 11.52 times as at 2.12 pm on January 14, 2025. The NIIs have been booked 25.35 times, retail 24.01 times, and QIBs 0.44 times. The IPO closes tomorrow, Jan 15. January 14, 2025 14:31 Stock Market Live Updates: Top gainers of Nifty Bank stocks Canara Bank (4.18%), IDFC First Bank (3.76%), SBI (3.14%), AU Small Finance Bank (2.46%) January 14, 2025 14:30 Stock Market Live Updates: Nazara Technologies stock traded at ₹880.65 on the NSE, down 1.08%. Nazara Technologies board has approved the payment of balance consideration of ₹72.73 Crore in cash to Porush Jain and Srinivas Cuddapah, the existing shareholders of Absolute Sports Private Limited, a subsidiary of the Company, towards acquisition of 19,343 equity shares of ₹1 each, representing 9.09% of the equity share capital of Absolute, on fully diluted basis. January 14, 2025 13:47 Stock Market Live Updates: Awfis Space Solutions Limited announced the launch of its first centre in Lucknow, spanning an impressive 47,694 sq. Shares traded flat at ₹687.70 on the NSE. January 14, 2025 13:38 Stock Market Live Updates: AWL stock gained 1.77% on the NSE to trade at ₹266.65. Adani Wilmar informed that Adani Commodities LLP, one of the promoter entities of the Company, has sold equity shares of the Company, representing 13.52% of the paid-up share capital (i.e. 39,54,18,121 no. of shares) through Offer for Sale (OFS) mechanism. January 14, 2025 13:37 Stock market live updates today: JM Financial expectations for MSCI India Standard Index JM Financial expects the following inclusions - High probability: Coforge, Fortis Healthcare, One 97 Communications, Coromandel International Low probability: Federal Bank, Blue Star, GE Vernova TD India, Uno Minda January 14, 2025 13:33 Stock market live updates today: Vodafone Idea Partners with HCLSoftware to Automate 4G and 5G Networks; HCL Technologies stock slips on NSE, Vodafone Idea shares gain Vodafone Idea partners with HCLSoftware to automate 4G and 5G Networks; HCL Technologies stock trades at ₹1,825.15 on the NSE, down 8.26%. Vodafone Idea shares were up 4.52% on the NSE to ₹8.09 January 14, 2025 13:31 Stock market live updates today: Greaves Electric Mobility launches Ampere Magnus Neo, an enhanced variant of its Magnus electric scooter; Greaves Cotton stock gains on BSE Greaves Electric Mobility Ltd (GEML), the e-mobility division of Greaves Cotton Limited , has introduced Ampere Magnus Neo, an enhanced variant of its Magnus electric scooter. Greaves Cotton stock rose 2.52% on the BSE to trade at ₹243.90 January 14, 2025 13:17 Stock market live updates today: NSE Indices Expectations March Rebalancing - JM Financial Potential inclusions to Nifty 50 index: Jio Financial Services and Zomato Potential exclusions: BPCL and Britannia January 14, 2025 13:16 Stock market live updates today: Nifty Bank index January 14, 2025 13:15 Stock market live updates today: Top gainers among Nifty Energy stocks: Adani Power (16.56%), Adani Green (12.31%), Adani Energy Solutions (11.77%), ATGL (8.53%), JSW Energy (5.21%), Suzlon (5%) January 14, 2025 13:15 Stock market live updates today: ESAF Small Finance Bank board to meet on February 10 to consider and approve financial results for the quarter ended December 2024. Stock trades flat on NSE at ₹37.35 January 14, 2025 13:15 Stock market live updates today: Swashthik Plascon expands installed production capacity for PET bottles; stock rises on BSE Swashthik Plascon has utilised proceedings of its IPO and constructed new building for setting up of plant and installation of new machineries for enhancement of existing installed production capacity from 1300 tonnes per month to 1420 tonnes per month. The new machineries will be used for manufacturing PET bottles for pharmaceutical applications, liquor applications, FMCG packaging, household applications etc. Swashthik Plascon stock rises 2.09% on the BSE, trading at ₹83 January 14, 2025 13:11 Stock market live updates today: Akg Exim board to consider financial results on January 22. Stock trades flat on the NSE at ₹17.36 January 14, 2025 13:11 Stock market live updates today: Operations at Goa Carbon’s Bilaspur unit temporarily shut down for maintenance work from today; shares rise on NSE Goa Carbon informs that operations at the company’s Bilaspur unit located at 34-40, Sector B, Sirgitti Industrial Area, Bilaspur (Chhattisgarh) has been temporarily shut down for maintenance work from today, 14 January 2025. Shares rise 1.51% on the NSE to ₹618.90 January 14, 2025 13:09 Stock market live updates today: Adani Group shares outlook: Adani Power and Energy stocks rally Adani Power (17.99%) Adani Green Energy (13.07%) Adani Energy Solutions (12.67%) ATGL (11.29%) Adani Enterprises (7.39%) Adani Ports (5.36%) ACC (3.17%) Ambuja Cement (3.13%) AWL (0.57%) NDTV (7.11%) January 14, 2025 12:50 Stock market live updates today: Markets extend recovery as Adani stocks lead rally; HCL Tech tumbles Indian equity markets maintained their upward momentum in Tuesday’s mid-day trading, with the benchmark Sensex rising 242.04 points or 0.32 per cent to 76,572.05, building on earlier gains fuelled by softer inflation data. The broader Nifty added 84.30 points or 0.37 per cent to trade at 23,170.25 at 12.30 pm. Adani Group stocks emerged as the top performers, with Adani Enterprises surging 7.61 per cent and Adani Ports advancing 5.56 per cent. Other major gainers included NTPC, which rose 4.38 per cent, followed by Hindalco and Bajaj Finance, adding 3.71 per cent and 3.17 per cent respectively. Read more January 14, 2025 12:40 Stock market live updates today: JSW Energy stock surged 5.11% on the NSE to trade at ₹544.20. Company has received a LoI for 3600MW KSK Mahanadi for a consideration of ₹16000 crore January 14, 2025 12:35 Stock market live updates today: Groww Mutual Fund Launches India’s First Nifty India Railways PSU ETF; NFO Period: January 16–30, 2025 January 14, 2025 12:35 Stock market live updates today: Thejo Engineering gets purchase order from Vale, Brazil, for supply of Ball Mill Liners to their mine in Brazil; stock trades flat on NSE Thejo Engineering has received a purchase order from Vale, Brazil, for supply of Ball Mill Liners to one of their mines in Brazil. The value of the order is $3.23 lakhs (about ₹2.80 crores) and is expected to be executed by April 2025. Stock traded flat on the NSE at ₹1,885.90 January 14, 2025 12:33 Stock market live updates today: 5paisa Capital has approved the appointment of Gaurav Seth as Chief Executive Officer with effect from January 14, 2025. January 14, 2025 12:32 Stock market live updates today: ICRA expects SFBs GNPAs to increase to 2.6-2.8% by end of March 2025; return on assets to decline to 1.4-1.6% in FY2025 and marginally improve to 1.6-1.8% in FY2026 January 14, 2025 12:32 Stock market live updates today: ICRA expects small finance banks growth to moderate to 18-20 per cent in FY25 from 24 per cent in FY24. However, it expects growth to pick up in FY26 to 20-23 per cent January 14, 2025 12:09 Stock market live updates today: Quadrant Future Tek stock locked in upper circuit on the BSE at ₹448.75, about 20% higher than the listing price January 14, 2025 12:06 Stock market live updates today: Biocon shares surged 5.42% on the NSE to ₹385. USFDA recently classified Biocon Biologics’ Insulins facilities in Johor Bahru, Malaysia as Voluntary Action Indicated January 14, 2025 12:05 Stock market live updates today: Top gainers on the NSE as at 12 noon WhatsApp Image 2025-01-14 at 12.02.26 PM.jpeg January 14, 2025 12:04 Stock market live updates today: Top gainers on the NSE as at 12 noon January 14, 2025 12:04 Stock market live updates today: BSE snapshot at 12 noon Of 3,899 stocks traded on the BSE at 12 noon on January 14, 2025, 2,746 advanced against 1,032 stocks that declined, and 121 remained unchanged. While 68 stocks recorded a 52-week high, 203 hit a 52-week low. A total of 181 stocks traded in the upper circuit, and 285 in the lower circuit January 14, 2025 12:01 Stock market live updates today: United Drilling Tools secures its first Taiwanese order worth $4,82,444 by Magitech International Ltd. Stock jumps 9.47% on NSE to trade at ₹258.90 January 14, 2025 11:57 Stock market live updates today: Laxmi Dental IPO draws strong retail, NII interest; QIB portion undersubscribed The Initial Public Offering (IPO) of Laxmi Dental Limited witnessed robust demand from retail and non-institutional investors on its second day, while the qualified institutional buyers’ portion remained undersubscribed. As of January 14, 2025, at 11.09 AM, the issue was subscribed 8.09 times overall. Read more January 14, 2025 11:53 Stock market live updates today: BEL shares gain 2.56% on the NSE to ₹266.25, following receipt of work orders worth ₹561 crore. January 14, 2025 11:44 Stock market live updates today: JSW Energy receives letter of intent for its resolution plan submitted for KSK Mahanadi Power Company; stock zooms up on NSE JSW Energy Ltd has received a letter of intent from the Resolution Professional for its resolution plan submitted for KSK Mahanadi Power Company Ltd (KMPCL) under the corporate insolvency resolution process of the Insolvency and Bankruptcy Code, 2016. Stock zoomed 5.94% on the NSE, trading at ₹548.50. January 14, 2025 11:37 Stock market live updates today: Nifty metal and PSU bank indices trade over 3% January 14, 2025 11:27 Stock market live updates today: Angel One shares declined 1.29% on the NSE to ₹2,414.90, following Q3 results January 14, 2025 11:27 Stock market live updates today: Delta Autocorp gets listed on NSE Emerge January 14, 2025 11:25 Stock market live updates today: January 14, 2025 11:24 Stock market live updates today: Sensex climbed 491.24 pts or 0.64% to trade at 76,821.25 as at 11.15 am January 14, 2025 11:12 Stock market live updates today: Laxmi Dental subscribed 7.99 times as at 11.03 am on January 14. The NIIs have been booked 17.42 times, retail 17.41 times, and QIBs 0.14 times. IPO closes on Jan 15 January 14, 2025 11:04 Stock market live updates today: Delta Autocorp shares debut at 35% premium on NSE Emerge at ₹175, over the issue price of ₹130. Currently, the stock has slipped to trade at ₹170.45. January 14, 2025 11:00 Stock market live updates today: Shares of Quadrant Future Tek trade higher at ₹427.65 on BSE. The stock listed at ₹374, nearly 29% higher than the issue price of ₹290. January 14, 2025 10:58 Stock market live updates today: Moneyboxx Finance sanctions ₹500-million term loan from Indian Overseas Bank, Bajaj Finserv, and Nabkisan Finance in Q3; stock surges 4% on BSE to ₹224.65 January 14, 2025 10:54 Stock market live updates today: STEL Holdings board meeting on January 22 to approve results for December quarter; stock gains on NSE ​ STEL Holdings Ltd ​ is to hold a board meeting on January 22, 2025, to inter-alia consider and approve the unaudited financial results of the company for the quarter ended December 2024. Stock rose 2.45% on the NSE to ₹391.45. January 14, 2025 10:49 Stock market live updates today: Top losers among Nifty IT stocks: HCL Tech (-9.32%), LTIMindtree (-2.47%), Persistent Systems (-1.52%), Tech Mahindra (-1.46%), LTTS (-1.08%) January 14, 2025 10:49 Stock market live updates today: Top gainers among Nifty Metal: Adani Enterprises (5.53%), Hindustan Zinc (3.55%), Jindal Steel (3.31%), SAIL (3.06%), JSL (3.01%) January 14, 2025 10:48 Stock market live updates today: JLR and Tata Communications to enhance JLR’s connected vehicle ecosystem; Tata Communications stock gains on NSE JLR and Tata Communications are set to enhance JLR’s connected vehicle ecosystem, transforming the driving experience for customers worldwide through the Tata Communications MOVE platform. Tata Communications stock rose 1.72% on the NSE to ₹1,660.40. January 14, 2025 10:18 Stock market live updates today: Markets rebound after four-day slide; IT stocks under pressure Indian equity markets opened higher on Tuesday, breaking a four-day losing streak, as cooling inflation data boosted hopes for potential interest rate cuts, while technology stocks faced selling pressure following mixed quarterly results. Read more January 14, 2025 09:56 Stock market live updates today: Rupee recovers from record low, rises 21 paise to 86.49 against US dollar in early trade The rupee rebounded from its lowest-ever level and appreciated 21 paise to 86.49 against the US dollar in early trade on Tuesday on the back of retreating American currency and easing crude oil prices. According to forex traders, the Indian currency found support from positive inflation numbers and some recovery in domestic equity markets even though the outflow of foreign funds continued to play a negative role. Read more January 14, 2025 09:55 Stock market live updates today: TEMBO Global Industries to participate in event at WEF; shares fall on NSE TEMBO Global Industries Ltd , (TEMBO DEFENCE PRODUCTS PRIVATE Ltd), has been invited to participate in an event at the World Economic Forum in DAVOS. Shares fell 2.04% to ₹721.05 on the NSE. January 14, 2025 09:53 Stock market live updates today: Indian Hotels Company completes acquisition of Rajscape Hotels; stock trades flat on NSE The Indian Hotels Company Ltd has completed the acquisition of Rajscape Hotels Private Ltd, representing 55 per cent of the issued and paid-up share capital of the target company for a total consideration of around ₹17.66 crores. Stock trades flat on the NSE at ₹760.30. January 14, 2025 09:37 Stock market live updates today: HCLTech, Microsoft expand strategic partnership to help transform contact centres with generative AI and cloud-based solutions; HCLTech share sink on NSE HCLTech and Microsoft expand strategic partnership to help transform contact centers with generative AI and cloud-based solutions. Shares of HCL Tech sink 9.27% to trade at ₹1,805 on the NSE, despite 5.5% increase in net profit in Q3. January 14, 2025 09:36 Stock market live updates today: Top gainers, losers on the NSE as at 9.30 am WhatsApp Image 2025-01-14 at 9.32.31 AM.jpeg January 14, 2025 09:35 Stock market live updates today: Fund House Recommendations Jefferies on BSE: Upgrade to Hold on Company, raise target price at Rs 5250/Sh (Positive) Jefferies on Max Hospitals: Maintain Buy on Company, raise target price at Rs 1380/Sh (Positive) HSBC on Biocon: Upgrade to Buy on Company, raise target price at Rs 430/Sh (Positive) MS on MGL: Maintain Overweight on Company, target price at Rs 1606/Sh (Positive) ICICI on PFC: Initiate Buy on Company, target price at Rs 550/Sh (Positive) ICICI on REC: Initiate Buy on Company, target price at Rs 600/Sh (Positive) Nuvama on Jindal Stainless: Upgrades to Buy on Company, target price at Rs 836/Sh (Positive) Jefferies on Hospitals: Max Healthcare and Fortis are top picks among the sector. (Positive) Macquarie on United Spirits: Maintain Underperform on Company, target price at Rs 1175/Sh (Neutral) Jefferies on HCL Tech: Maintain Hold on Company, target price at Rs 2060/Sh (Neutral) Nomura on HCL Tech: Maintain Buy on Company, target price at Rs 2000/Sh (Neutral) Citi on HCL Tech: Maintain Neutral on Company, target price at Rs 1920/Sh (Neutral) CLSA on HCL Tech: Maintain Hold on Company, target price at Rs 1882/Sh (Neutral) Bernstein on HCL Tech: Maintain Market Perform on Company, target price at Rs 2000/Sh (Neutral) MS on HCL Tech: Maintain Equal weight on Company, target price at Rs 1970/Sh (Neutral) Nuvama on HCL Tech: Downgrade to Hold on Company, raise target price at Rs 2150/Sh from Rs 2125/Sh (Neutral) January 14, 2025 09:34 Stock market live updates today: Securities in F&O Ban For Trade Date 14-January-2025 * AARTIIND * BANDHANBANK * HINDCOPPER * LTFIN * MANAPPURAM * RBLBANK January 14, 2025 09:34 Stock market live updates today: Q3FY25 EARNING CALENDAR 14.01.2025 HATHWAY, HDFCAMC, NETWORK18, SHOPERSTOP HDFCAMC * Revenue expected at Rs 973 crore versus Rs 671 crore * Net profit expected to be seen at Rs 604 crore versus Rs 487 crore Q3FY25 EARNING CALENDAR 15.01.2025 AEROFLEX, AIIL, CEATLTD,HDFCLIFE, LTTS, MAHABANK, MAHSCOOTER, NELCO, OFSS, ORIENTHOT, PSB, RIIL, TRANSRAILL CEATLTD * Revenue expected at Rs 3309 crore versus Rs 2963 crore * EBITDA expected to be seen at Rs 359 crore versus Rs 417 crore * EBITDA margin expected to be seen at 10.85% versus 14.09% * Net profit expected to be seen at Rs 121 crore versus Rs 181 crore HDFCLIFE * APE expected at Rs 3663 crore versus Rs 3190 crore * EBIT expected to be seen at Rs 576 crore versus Rs 328 crore * EBIT margin expected to be seen at 1.23% versus 18.58% * Net profit expected to be seen at Rs 400 crore versus Rs 367 crore LTTS * Revenue expected at Rs 2663 crore versus Rs 2578 crore * EBIT expected to be seen at Rs 411 crore versus Rs 387 crore * EBIT margin expected to be seen at 15.43% versus 15.03% * Net profit expected to be seen at Rs 330 crore versus Rs 319 crore January 14, 2025 09:33 Stock market live updates today: Economic Calendar – 14.01.2025 12:00 INDIA WPI Manufacturing Inflation y/y (Expected: 2.30% versus Previous: 2.00%) 19:00 U.S. PPI m/m (Expected: 0.4% versus Previous: 0.4%) 20:30 U.S. FOMC Member Schmid Speaks January 14, 2025 09:22 Stock market live updates today: Major U.S. listed stocks: Result calendar – 14.01.2025 Applied Digital Corporation (Post market) (Sector- Technology) January 14, 2025 09:20 Stock market live updates today: Sensex and Nifty open firm note. At 9:16 am Nifty was at 23,197.20, up 111.25 points or 0.48% higher. Sensex was at 76,688.02, up 358.01 points or 0.47% firmer. January 14, 2025 08:50 Stock market live updates today: Rupee unlikely to find support in Asia FX’s slight recovery The Indian rupee ’s spiral is likely to persist on Tuesday despite the mild recovery in its Asian peers and a pause in the dollar index’s rally. Read more January 14, 2025 08:14 Stock market live updates today: Sensex, Nifty to open on a firm note Benchmark indexes are likely to open higher on Tuesday after closing at seven-month lows in the previous session, while IT company HCLTech will be in focus after reporting a smaller-than-expected quarterly revenue. The GIFT Nifty futures were trading at 23,274 as of 7:55 a.m. IST, indicating that the blue-chip Nifty 50 will open above Monday’s close of 23,085.95. Read more January 14, 2025 07:19 Stock market live updates today: Today’s Stock Recommendation: January 14, 2025 January 14, 2025 07:13 Stock market live updates today: Stock to buy today: Hindustan Unilever (₹2,453) BUY The short-term outlook is bullish for Hindustan Unilever (HUL) . The stock has been performing well even as the broader market faces significant declines. Strong support is evident around ₹2,400, and a break below this level appears unlikely, as fresh buying interest is expected to limit the downside. Read more Comments Published on January 14, 2025",
    "url": "https://www.thehindubusinessline.com/markets/stock-market-highlights-january-14-2025/article68973206.ece",
    "original_url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQUFNyeUwyc00tckpldjVtaVhLRWRpajQ4MFNJVzAxR0tPdnlYb1dKdmFLSEV6cFFIRmlfa0NEeW1KMjNfSm1odmJrcjhCTW8zTjJtaS1JYUJST2lFc19RU1F4UjN3WE5MZU1DblB1QzYwdnBwTGttWWItTHozamRrUXdSekRTZS1qVWZiQTNnNDRMWExsbHBvdWRKSWxHUHpMQ0MtRTBINA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 22117,
    "word_count": 3604,
    "gnews_title": "Share Market Highlights 14 January 2025: Sensex, Nifty see modest gains as financials recover - BusinessLine",
    "published_date": "14/01/2025",
    "publisher": "BusinessLine",
    "topic": "NSE India trading"
  },
  {
    "title": "Best Gaming Stocks in India",
    "body": "India has become the biggest gaming market in the world, with 9.5 billion gaming app downloads and 568 million gamers in the past few years. This growth is fueled by advancing IT infrastructure, widespread use of mobile devices and high-speed internet connectivity. Moreover, the incorporation of technologies such as Augmented Reality (AR), Virtual Reality (VR) and the metaverse into console and computer games is also contributing to this expansion. With such a massive user base, it is no surprise that investors are eyeing the gaming sector for potential opportunities. In recent years, the gaming industry in India has transformed significantly, with a surge in online gaming participation across the nation. From casual gaming on mobile devices and PCs to organised esports tournaments and leagues, India is witnessing an unprecedented rise in gaming culture. This growth can be attributed to several factors, including the expansion of broadband connectivity in Tier-II and Tier-III cities, along with affordable data costs and smartphones, which have made gaming more accessible to a diverse audience. In 2022, the Commonwealth Esports Championship marked a significant milestone, showcasing the global recognition of esports, exemplified by the Indian DOTA 2 squad's remarkable achievement of a bronze medal. By 2023, India's online gamer community surged to 442 million, making it the world's second-largest gaming user base, trailing only behind China. Furthermore, the Indian government has undertaken several initiatives to promote the growth of the gaming industry. It includes amendments to the Information Technology Rules of 2021 to regulate online gaming and protect gamers from harmful content and addiction. Additionally, the establishment of the Animation, Visual Effects, Gaming, and Comics (AVGC) Promotion Task Force aims to enhance domestic capabilities and foster the growth of the AVGC sector through the creation of a National AVGC policy. Furthermore, the government's authorisation of 100% Foreign Direct Investment (FDI) in the gaming sector presents opportunities for both domestic and foreign investors to contribute to the industry's expansion. However, the gaming market in India is estimated to reach USD 7.24 billion by 2029, driven by a CAGR of 15.68% from 2024 to 2029. The following table highlights the best gaming stocks in India in 2025 as per BUY analyst ratings provided by the I/B/E/S databases. We have listed these stocks based on analyst ratings because stock market analysts review and rate a stock based on their in-depth market study: Gaming Stocks in India (as per analyst ratings) BUY Analyst Rating (in %) Zensar Technologies Limited Tata Consultancy Services *Our stock selection criteria for top stocks based on analyst ratings are mentioned at the bottom of this blog. Here is a table showcasing the top gaming stocks in 2025 as permarket capitalisation: Gaming Stocks in India (as per market capitalisation) Tata Consultancy Services Zensar Technologies Limited *Our stock selection criteria for top stocks based on Market Capitalisation are mentioned at the bottom of this blog. Here is a summarised overview of the best gaming stocks as per analyst ratings: Nazara Technologies Limited is an Indian company that offers a wide range of gaming and sports media services. It operates in three main segments: Gaming, eSports and Ad tech. The gaming segment includes Kiddopia, Animal Jam, WCC3 and Classic Rummy. Nazara Technologies is involved in esports through Nodwin, PublishMe and Sportskeeda. Additionally, it offers skill-based, fantasy, and trivia games via OpenPlay, Halaplay and Qunami. It also provides digital ad tech solutions through Datawrkz. The company's distribution network covers approximately 52 telecom operators in 58 countries, including Africa, the Middle East and South Asia. Nazara Technologies has subsidiaries like Nazara Technologies FZ LLC, Nazara Pte Limited and Sports Unity Private Limited among others. Zensar Technologies Limited is a company that provides digital solutions and technology services. It caters to various industries like healthcare and life sciences, hi-tech engineering, telecom, banking and financial services, insurance, consumer and manufacturing services. Zensar Technologies offers a variety of IT services and solutions across two main segments - Digital and Application Services (DAS) and Digital Foundation Services (DFS). The DAS segment provides custom application management services, including development, maintenance, modernisation, support and testing across different industries and technologies. On the other hand, the DFS segment offers infrastructure management services, such as digital workspace, hybrid IT, unified IT and dynamic security services through a managed service platform utilising autonomics, automation and machine learning. A subsidiary of Tata Sons Private Limited, Tata Consultancy Services Limited (TCS) is a leading provider of information technology (IT) services. These services include IoT, quality engineering, blockchain, consulting, business process outsourcing, business intelligence, cloud services, infrastructure services and enterprise solutions. It also provides business solutions to diverse industries such as banking, financial services, insurance, media, technology, life sciences, information services, communication, healthcare, retail, manufacturing, energy, hospitality and more. TCS's software products include TCS MasterCraft, TCS Optumera, TCS OmniStore, TCS BaNCS, Jile, TCS iON, TCS TwinX, TAP, Ignio, TCS ADD, Quartz and TCS HOBS. Incorporated in 1981, Infosys Limited is a digital services and consulting company that provides technology-driven business solutions. Its services include data analytics, AI, digital workspace, digital process automation, digital marketing, cybersecurity, blockchain, salesforce, IoT, engineering, cloud services and consulting. These offerings are tailored to various industries, including agriculture, consumer packaged goods, aerospace and defence, communication services, high technology, automotive, healthcare, education, financial services, insurance, mining, oil and gas and life sciences. It also caters to industries such as media and entertainment, logistics and distribution, professional services, the public sector, retail, travel, hospitality, and utilities. Infosys operates with a presence in over 56 countries and has 13 subsidiaries all over the world. Before you decide to invest in gaming stocks, there are some factors you should keep in mind. These factors are as follows: Assessing the potential of new and innovative game concepts is essential. Investing in promising new ideas with good initial funding can increase the chances of commercial success and higher returns on investment. So, keep an eye out for unique concepts that have the potential to capture the market's attention. Before investing in gaming stocks, it is crucial to evaluate both the leadership and management teams of gaming companies and their ethical conduct. Assess the leadership team for their industry experience and track record of success. Look for companies known for ethical practices to align investments with integrity and minimise risks. Consider the current valuation of a gaming company. Make sure it aligns with its financial performance and growth prospects. This helps you determine if the investment is justified. The gaming industry in India is competitive. To succeed, you need to assess a company's competitive position compared to its peers. Look at factors like product offerings, customer base, and pricing to understand how it stacks up against the competition. When thinking about investing in the gaming industry, be mindful of regulatory and legal risks. Changes in gaming laws or regulations can impact the industry, so it is crucial to invest in companies that are well-versed in the regulatory environment. Laws related to privacy and data protection can significantly affect the industry's revenue potential. Evaluating a gaming company's financial performance is crucial. You must look at factors like revenue growth, profit margins andcash flowto identify financially stable companies with growth potential. Before investing in gamingstocks, understand the obstacles and risks that the Indian gaming market might face as it grows. One big challenge is dealing with rules and regulations, especially when it comes to data privacy laws. This can be tough because India is still catching up with global standards. Moreover, the fact that software patents are not allowed makes it hard for companies to innovate, especially those making digital products. They need to protect their software code within the laws that already exist. Additionally, adhering to diverse compliance rules can be costly and hinder growth, particularly for new firms. Even though gaming stocks seem promising, knowing about and dealing with these challenges is crucial before investing. If you are planning to invest in gaming companies in India, be assured of their potential. With ample growth prospects and impressive revenue generation, now is a prime opportunity to consider investing in gaming stocks. However, research thoroughly and align your investment with your financial goals before prioritising this emerging sector. You may also be interested to know Best Travel Stocks in India Best Media Stocks in India Best Automobile Stocks in India Best Gold Stocks in India Best Tobacco Stocks in India *Stock Selection Criteria for Top Stocks Based on Analyst Rating Investors must carefully read through the following information on stock selection criteria while running through the stocks based on analyst ratings- These stocks have been shortlisted as per Analyst ratings provided by the I/B/E/S (The Institutional Broker’s Estimate System) database, further aggregated by Refinitiv. Ratings are determined by analysts' forecasts of company performance, taking into account metrics like earnings per share, sales, and net income. These ratings should not be construed as investment advice/recommendations/offer/solicitation of an offer to buy/sell any securities by Groww Invest Tech Pvt. Ltd. (formerly known as Nextbillion Technology Pvt. Ltd.). Before investing, investors must conduct independent research and not solely rely on the information provided here. This will allow investors to make appropriate investment decisions based on their financial goals, investment objectives and risk tolerance. *Stock Selection Criteria for Top Stocks Based on Market Capitalisation These stocks are chosen based on their market capitalization, which represents the total value of a company's outstanding shares. The selection is arranged in descending order, placing the largest companies first and the smaller ones later. This helps prioritize stocks based on their market size. It is important to note that market capitalization in no way guarantees a company’s performance or the returns from its stocks. However, it can be used as a criterion for shortlisting companies from within a sector. Investors should recognize that other factors, such as financial health, management efficiency, and market trends, play crucial roles in determining the actual success of an investment. This stock selection should not be construed as investment advice/recommendations/offer/solicitation of an offer to buy/sell any securities by Groww Invest Tech Pvt. Ltd. (formerly known as Nextbillion Technology Pvt. Ltd.). Disclaimer: This blog is solely for educational purposes. The securities/investments quoted here are not recommendatory. To read the RA disclaimer, please clickhereResearch Analyst - Aakash Baid",
    "url": "https://groww.in/blog/best-gaming-stocks-in-india",
    "original_url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE1sV2V4eGVobW5zaTdubTRaTkhMS042a2h6QUJJbWVyMXpSSmhLTWRmTTJDZkRYS3VEM1lPRnlJWWw3SkJXckNrSGhNZ0pqSGY5OXBmS2N3RlpnLXB3anc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 11717,
    "word_count": 1705,
    "gnews_title": "Best Gaming Stocks in India 2025 - Groww",
    "published_date": "16/01/2025",
    "publisher": "Groww",
    "topic": "NSE India trading"
  },
  {
    "title": "How will markets open today? Here are 7 key cues to watch out for",
    "body": "GIFT Nifty indicated that Indian equity indices BSE Sensex and NSE Nifty 50 might see a higher start on Tuesday following Asian markets opening on a lower note in early trade hours. Previously, on Monday, the NSE Nifty 50 closed the session 345.55 points or 1.47% lower at 23,085.95, while the BSE Sensex closed 1,048.90 points or 1.36% lower at 76,330.01. Key global and domestic cues to know on January 14, 2024 Asian markets Asia markets were trading on a lower note on Tuesday following an overnight loss in the US markets. Japan’s Nikkei 225 was trading 1.5% lower at 38,599.36. South Korea’s Kospi slipped 0.01% to trade at 2,489.93. The Asia Dow was trading 1.65% lower at 3,645.81. Wall Street US indices closed Monday on a mixed note after tech stocks saw a massive selloff. The S&P 500 closed the session 0.16% higher at 5,836.22. The technology-heavy Nasdaq Composite dipped 0.38% to close the session at 19,088.10. The 30-stock Dow Jones Industrial Average advanced 358.67 points or 0.86% to close at 42,297.12. US dollar The US Dollar Index (DXY), which measures the dollar’s value against a basket of six foreign currencies, was up 0.10% at 109.60 on Tuesday morning. The index evaluates the strength or weakness of the US dollar in comparison to major currencies. The basket contains currencies such as the British Pound, Euro, Swedish Krona, Japanese Yen, Swiss Franc, etc. Also, the Indian rupee closed to a new all-time low of 86.59 against the US Dollar on Monday. Crude oil WTI crude prices were trading at $78.69 down by 0.16%, while Brent crude prices were trading at $80.82 down by 0.24%, on Tuesday morning. FII, DII data Foreign institutional investors (FII) were the net sellers of shares net worth Rs 4,892.84 crore. Meanwhile, the Domestic institutional investors (DII) were the net buyers of shares worth Rs 8,066.07 crore on January 13, 2024, according to the provisional data available on the NSE. India’s retail inflation India’s retail inflation, based on the Consumer Price Index (CPI), for December stood at 5.22%, slightly lower than 5.48% in November, data released by the Ministry of Statistics & Programme Implementation showed on Monday. In October, CPI inflation had reached a 14-month high of 6.21% and it stood at 5.69% in December 2023. Quarterly results HDFC Asset Management Company, Network 18 Media & Investments, Shoppers Stop , Hathway Cable and Datacom , Benares Hotels , Atishay , Sayaji Pune, Golkunda Diamonds and Jewellery , Sita Enterprises , and SRM Energy will be releasing their quarterly results on January 17. Read Next How will markets open today? US Futures down on Govt shutdown concerns, and 6 other cues to watch at this hour How will markets open today? Gift Nifty up, Nikkei down, and 6 other cues to watch at this hour How will markets open today? Gift Nifty up, Nikkei down, and 6 other cues to watch at this hour",
    "url": "https://www.financialexpress.com/market/global-action-at-this-hour-here-are-top-7-cues-to-watch-ahead-of-market-opening-3714322/",
    "original_url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNZWhoT0p2MHdUdDBhWHVZcWRYT3A5ZnVKUmoxa1NEN3VPZldoMHJ6cHBBQlM3VmRzczE5Rjh3MmViWkJUS2h3bS1yUlFoaEpxY1pUdmk3Tk4wYlo1blZMa0V0eTZSTnVGdl9JT3pPeVU5TEdLZkVHSlpPZndYU2pmQVFfbkFSTzV4dy1oYUpVd1VrYXpTTk1sbFR0NnRLOW40YnN1OU9fNGhXTDRWSURJcjZ4T0txWFBYN1RRSjIxTkt3M0hCelg4?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2883,
    "word_count": 487,
    "gnews_title": "How will markets open today? Here are 7 key cues to watch out for - financialexpress.com",
    "published_date": "14/01/2025",
    "publisher": "financialexpress.com",
    "topic": "NSE India trading"
  },
  {
    "title": "Standard Glass Lining Share Price Highlights: Stock settles 5.1% lower after listing at 22.86% premium on NSE",
    "body": "4 min read | Updated on January 13, 2025, 15:34 IST Standard Glass Lining Technology shares were listed at ₹172 a unit on the National Stock Exchange (NSE) on Monday, reflecting a premium of 22.86% to the issue price of ₹140. Standard Glass Lining Technology is one of the leading engineering equipment manufacturers. The minimum application size was 107 shares, needing an investment of ₹14,980. The price range was set at ₹133 to ₹140 per share. The initial share sale was subscribed to a whopping 183.18 times, as bids were received for 3,81,56,56,808 shares against the 2,08,29,567 on offer. Shares of Standard Glass Lining will begin trading on the NSE and the BSE at 10 am on Monday, January 13. Standard Glass Lining Technology offers comprehensive solutions that encompass design, engineering, manufacturing, assembly, installation, and commissioning. It also establishes standard operating procedures for pharmaceutical and chemical manufacturers on a turnkey basis. Its pharma clients include Aurobindo Pharma, Cadila Pharmaceutical, Granules India Ltd, Macleods Pharmaceuticals, Piramal Pharma, and Suven Pharmaceuticals. By signing up you agree to Upstox’sTerms & Conditions By signing up you agree to Upstox’sTerms & Conditions",
    "url": "https://upstox.com/news/market-news/ipo/standard-glass-lining-ipo-listing-date-share-price-live-shares-list-premium-nse-bse-stock-news-review-all-you-need-to-know/article-139979/",
    "original_url": "https://news.google.com/rss/articles/CBMiigJBVV95cUxQZjRCQnZoRUxhX3pGaUktNlVWa2paUDF1emxYZFpSLUhiRkNTRGtFM29nRkxMMUFHXzRGWWM5Qkp4dmxkV1hLYnY2OUJqTF9pekIzbXpkbnJrV2lIY2FITmVLRW9FSWlKT1NpME5RTEdsektRRm41Y2U2NWR1OFgzUWIzRzVuQ0cxcEl5RDVXb2JCc2NLRlZQLWFWM1J4MEVsbS10ZktteHdLdmF4R25YeW1DWmpxZHpVZjEtSDdPRURUQVlIYUhNaEdWeFRCa2R4RDBHbDB4M1lmR3BMbGtGZkNicTVwOFo0OGFCZ3NmTUd3bHo2NlhlOFhUcEV2RW9HUUZHZFN3bDdXZw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1240,
    "word_count": 187,
    "gnews_title": "Standard Glass Lining Share Price Highlights: Stock settles 5.1% lower after listing at 22.86% premium on NSE - Upstox",
    "published_date": "13/01/2025",
    "publisher": "Upstox",
    "topic": "NSE India trading"
  }
]