[
  {
    "title": "ITC Hotels share price: Stock lists at 30% discount on NSE",
    "body": "Shares of ITC Hotels listed at a discount of 30% on Thursday, opening at Rs 180 on the national stock exchange (NSE), to the discovered price of Rs 260 per share. ITC Hotels shares opened at Rs 188 on the Bombay Stock Exchange (BSE), to the discovered price of Rs 270 per share. \"Trading Members of the Exchange are hereby informed that effective from Janaury 29, 2025, the equity shares of ITC Hotels Ltd (Scrip Code: 544325) are listed and admitted to dealings on the Exchange in the list of ''T'' Group Securities,\" saidITC Hotels in a stock exchange filing. After making its stock market debut, ITC Hotels saw its shares drop further, hitting the 5% lower circuit on the BSE. The stock was trading at Rs 178.60 at the time the article was being written. The company, which was recently spun off from ITC Ltd, a conglomerate spanning cigarettes, FMCG, and other sectors, officially listed on January 29. The listing price of ITC Hotels shares was lower than the market estimates given earlier on January 6 during a special price-discovery session. In that session, the stock was valued at approximately Rs 260 on the Nifty and around Rs 270 on the BSE. For ITC shareholders, the cost of acquiring 100 shares of ITC Hotels amounts to Rs 54,040. As per the demerger plan, ITC has retained a 40% stake in the newly formed hotel company, while the remaining 60% has been allotted to shareholders in a 10:1 ratio. Akriti Mehrotra, Research Analyst at StoxBox, said that investors who have received ITC Hotels shares may find it beneficial to hold them for a medium to long-term investment. (Disclaimer: The views, opinions, recommendations, and suggestions expressed by experts/brokerages in this article are their own and do not reflect the views of the India Today Group. It is advisable to consult a qualified broker or financial advisor before making any actual investment or trading choices.)",
    "url": "https://www.indiatoday.in/business/story/itc-hotels-share-price-stock-lists-at-30-percent-discount-on-nse-rs-180-bse-listing-2671718-2025-01-29",
    "original_url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPbGNUYTVqMTQ3ck5IT0lnZ0VLNDJqYmhqN0R4N001MVZCbGo5bHNYRzZxdEJyaXVURnFOZkdtNWNaRXp3aVkyaHpENG1zMTFMQ3R6T3UwNFhYT3dieVJYVllITFFpQTFZNmEtWlUwZ3F1UTg2RllSZS16UUY3ZHltdWNuWFBoSldwd2pvTHVTTWJwWFB0dmhCcHlXbldTRGNCdkRkUUNFejJKdEtNWUo1MGQ5ZjZvX0lET2p1Z2RrbzAyeUhSeFRuV2dmRVlHeHBuOVNyNTJwTmt4TzjSAeABQVVfeXFMTzByd21DaWNnZzc1T1dha2hMc0tvMHQ2cXBxMTVfeVRTamZQUjloWXg5MThFT09SQ0RGTVBHVm5Nd2M2SEhnQ1QtQ3VIRDdaYzRGYVRJUG1jTmpzQTJkMEZDUmpzQ0pMamxIMVJCRWNMbG1XTmdQMnNkb1pMZG1wZElZNTNVVWVrZFNPX2FBWVg3d3doWDdoV3YyZ2tpWENpUlZoeER1bTkxWDc3WFlMdDdsNVZDdGpWSkxhY19fOUNaQ3FQRGZ6b0o3NnEzUnYtY2Y4b3c0U0YzblhrdTE3eTQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1895,
    "word_count": 323,
    "gnews_title": "ITC Hotels share price: Stock lists at 30% discount on NSE - India Today",
    "published_date": "29/01/2025",
    "publisher": "India Today",
    "topic": "NSE India trading"
  },
  {
    "title": "Will Indian stock exchanges remain open for trading on budget day, Feb 1?",
    "body": "ETMarkets.com Indian stock market: Markets to remain open on Budget Day, allowing investors to respond instantly to key policy announcements, tax reforms, and economic measures impacting various sectors. The Indian stock market will remain open for a special trading session on Saturday, February 1, 2025, as Finance Minister Nirmala Sitharaman presents the Union Budget 2025-26, the National Stock Exchange (NSE) and BSE confirmed in a circular issued Monday. The exchanges will conduct a full trading session on Budget Day, following regular market hours, with equity trading from 9:15 AM to 3:30 PM and commodity derivatives trading until 5:00 PM. However, the T+0 settlement session will remain suspended due to the settlement holiday. The move aligns with past practices when markets opened on Saturdays for budget announcements, notably in 2020 and 2015. The decision ensures investors can react in real time to fiscal policy measures, tax reforms, and sectoral allocations that often drive market movements. Pre-market trading will take place from 9:00 AM to 9:08 AM, while benchmark indices Nifty 50 and Sensex will update live throughout the session. The Union Budget remains a pivotal event for markets, setting the economic agenda for the year ahead. With the government’s fiscal roadmap under scrutiny, market participants will parse the announcements for cues on growth, taxation, and sectoral incentives, shaping investment sentiment in the weeks to follow. Also read | Time to buy the dip? Stock market indicates oversold level Analysts and investors will closely monitor Sitharaman’s proposals, with infrastructure, banking, manufacturing, and healthcare stocks expected to see heightened volatility based on policy announcements. Historically, the Union Budget was presented on the last working day of February. However, in 2017, then-Finance Minister Arun Jaitley advanced the date to February 1, allowing the government additional time to implement policies within the financial year. Since then, the Union Budget has been presented on February 1 annually. Finance Minister Nirmala Sitharaman will deliver the Union Budget for fiscal year 2025-26 on February 1, marking her eighth consecutive budget presentation. The most recent full-fledged Union Budget was presented by Sitharaman on July 23, 2024, following the Lok Sabha elections. Before that, an interim budget was tabled on February 1, 2024, covering essential government expenditures. Also read | Market crash coming! Rich Dad, Poor Dad author Robert Kiyosaki's top 8 predictions since 2002 (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Economic Times) Add as a Reliable and Trusted News Source Add Now! (You can now subscribe to our ETMarkets WhatsApp channel ) Read More News on Fiscal year Arun Jaitley Derivatives Equity Stock Market Volatility (What's moving Sensex and Nifty Track latest market news , stock tips , Budget 2025 , Share Market on Budget 2025 and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today . Top Trending Stocks: SBI Share Price , Axis Bank Share Price , HDFC Bank Share Price , Infosys Share Price , Wipro Share Price , NTPC Share Price ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition As RIL, Adani, Tata wait in the wings, this 90-page rulebook could shatter India’s N-power dreams How forgery, murder and Lord Hanuman are woven into multi-crore insurance crimes Automakers hit the brakes on deliveries as cess losses stall dealer inventories Can amendments untangle the bankruptcy law hobbled at courts? Stock Radar: This fintech stock hits fresh highs in September; trading in a rising channel; check for target & stop loss For wealth creation, focus on ‘Irrespective of & Despite Trump’: 7 mid-caps from different sectors with upside potential of up to 42% 1 2 3 View all Stories",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/will-indian-stock-exchanges-remain-open-for-trading-on-budget-day-feb-1/articleshow/117689697.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxQdlpPNGxESWtsNDNyaG9NSlhmcXpTX0hBS25zMGJ3Q0VKVmQxNnBDUEpjbl9BVHUtbWNSTDc4aXp3dk9QMWlLZlQ0TVFjZG9rdmllSXBQelpVXzhVX2R2Sl9EUjFMRHc4Nno0MnhXMWZWY2JTVVRvb3VwbGdhS2xzU0N5Y1JIVzk0V2JmT2lzNThOSXo0NE8zdHZSYkM0RUpRM0U5SGV3N0MzS1JkMlhINmk3ZTdGd3o2ZDNkNWhwQWd0bVl0VzZXUUFnU1lFTGI4YlRSeFNZc2VGbEluNnfSAeMBQVVfeXFMTkhMMDgyeUlabURKQnFJbXFraEk0LWw2d2syUXZoay1MMmt3dmdFZk1KZVpDYWxLSzFHZmJRVDhzZ1JtcWtmUDB5ajNnekYwZnE4eWdXNWwwdk0ydTNqdi1jMW9CaHFwSy00M0t1TTN5WTBXT2ZFWEpmZ0VBWkx6NFF0Q0VtYXFRUlFmQ0M2VWxWX3pvUF9uR191QnFpQVIxWWhNT0N4VTVpSHlXc2d5a0tzMnJyZjlodnJYWlppamlfaGJjMVlocFdDYnoxUHNfUmtYRVN6eDhQS2lkTnJYWDVMSDQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4141,
    "word_count": 645,
    "gnews_title": "Will Indian stock exchanges remain open for trading on budget day, Feb 1? - The Economic Times",
    "published_date": "29/01/2025",
    "publisher": "The Economic Times",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Close Highlights: Sensex bounces back, gains 535pts as banks rally; Nifty at 22,957",
    "body": "Stock Market LIVE Updates: Expert view Stock Market LIVE Updates: Market expert view Stock Market LIVE Updates: Here's a look at Nifty gainers and loser at close Stock Market LIVE Updates: Here's a look at Sensex gainers and loser at close Stock Market LIVE Updates: A glance at broader market Stock Market LIVE Updates: Nifty 50 settles 128.10 pts higher at 22,957.25 Stock Market LIVE Updates: Sensex ends 535.24 pts higher at 75,901.41 Stock Market LIVE Updates: Apar Industries shares tank 20% on disappointing December quarter results Stock Market LIVE Updates: Arvind Q3 profit jumps 13% on strong festive demand for textiles Stock Market LIVE Updates: Cipla Q3 result: PAT soars 48.7% to Rs 1,570.5 cr , revenue grows 7.1% Stock Market LIVE Updates: Tata Motors Q3 Preview; here's what to expect from auto major in Dec qtr Stock Market LIVE Updates: Route Mobile shares down 5% after profit slips in Q3 results; revenue up 4% Stock Market LIVE Updates: TVS Motor Q3 result; net profit up 20% at Rs 609.35 cr on higher sales Stock Market LIVE Updates: Tips Music falls 5% as stock trades ex-dividend date today; details Stock Market LIVE Updates: 2 PM market update - Sensex, Nifty maintain higher levels Stock Market LIVE Updates: DLF shares: Dahlias' strong pre-sales trigger bullish calls by analysts Stock Market LIVE Updates: Budget may provide triggers for the market, says Naveen Kulkarni, Axis Sec PMS Stock Market LIVE Updates: ITC, UB, Delta Corp: Trading strategies for sin stocks ahead of Budget 2025 Stock Market LIVE Updates: Updater Services share skyrockets 12% after solid Q3 show; profit up 52% Stock Market LIVE Updates: HDFC Bank, Axis Bank, others rise as RBI announces liquidity measures Stock Market LIVE Updates: Aditya Birla Sun Life share plummets 8% after Q3 results; here's why Stock Market LIVE Updates: 1 PM market update - Sensex, Nifty maintain higher levels Stock Market LIVE: SpiceJet to re-induct 1st grounded 737 MAX on Jan 29, to re-deploy 10 aircraft by mid-Apr Stock Market LIVE Updates: Gensol EV gets 30,000 pre-orders for EZIO and EZIBOT from existing fleet operators Stock Market LIVE Updates: Policybazaar owner PB Fintech's Q3 PAT may rise 86% YoY, rev 44%: Analysts Stock Market LIVE Updates: Smallcap extends fall, down 4%; Anant Raj, Netweb, Newgen tank up to 20% Stock Market LIVE Updates: Can DeepSeek sparked AI sell-off dent Indian IT shares? Tech view here Stock Market LIVE Updates: RailTel Corp share drops 8% after margins dip in Q3 show; know more Stock Market LIVE Updates: 12 PM market update - Sensex, Nifty climb higher Stock Market LIVE Updates: Bank of India Money Market Fund NFO opens today; check key features here Stock Market LIVE Updates: Emami gains 5% on posting healthy Q3 results; PAT up 7%, revenue up 5% Stock Market LIVE Updates: Union Bank shares gain 7% after posting Q3 results; check details here Stock Market LIVE Updates: Kaynes tanks 19% as Q3 revenue growth moderates; stk down 46% in Jan so far Stock Market LIVE Updates: Analysts remain divided on Coal India's future prospects after mixed Q3 Stock Market LIVE Updates: 11 AM market update - Sensex, Nifty hold opening gains Stock Market LIVE Updates: Nvidia, energy stocks: DeepSeek AI triggers market sell-off; time to worry? Stock Market LIVE Updates: CLN Energy IPO allotment today; check status, GMP, listing schedule Stock Market LIVE Updates: Federal Bank slumps 7% after profit declines in Q3 results; details here Stock Market LIVE Updates: Bajaj Housing Finance rises 4% but pares gain soon after posting Q3 results Stock Market LIVE Updates: 'Currently the bond market awaits a funding mix for financing the fiscal deficit' Stock Market LIVE Updates: Indian bonds poised to rally further on account of borrowing cut bets Stock Market LIVE Updates: 10 AM market update - Sensex, Nifty trade higher Stock Market LIVE Updates: Dividend, Bonus: BPCL, MPS, Technopack Polymers to remain in focus today Stock Market LIVE Updates: Nifty fall since October 2nd biggest in 10 years; 16 stocks tank over 20% Stock Market LIVE Updates: Nifty Jan expiry strategy: Kotak Securities recommends a Short Strangle Stock Market LIVE Updates: Shriram Fin, Infosys, Axis Bank gain up to 2% on NSE Stock Market LIVE Updates: Nifty PSU Bank, Financials lead among sectors Stock Market LIVE Updates: Broader indices mixed Stock Market LIVE Updates: Heatmap check Stock Market LIVE Updates: Nifty rises above 22,900 Stock Market LIVE Updates: Sensex soars over 400 pts Stock Market LIVE Updates: Nifty above 22,950 in pre-open Stock Market LIVE Updates: Sensex surges 290 pts in pre-open Stock Market LIVE Updates: 23,128 will act as key resistance for Nifty50 today Stock Market LIVE Updates: Indian oversold and is set for a rebound Stock Market LIVE Updates: Try to amicably resolve dispute over Lodha trademark: HC to Lodha brothers Stock Market LIVE Updates: 360 One WAM to acquire brokerage house B-K Securities for Rs 1,884 cr Stock Market LIVE Updates: 'For today's session, Nifty supports lie in the area spanning 22,725 and 22,787' Stock Market LIVE Updates: JSW group forays into copper mining with Rs 2,600 crore investment Stock Market LIVE Updates: Indian Oil Q3 results: Net profit drops 77% to Rs 2,115 cr, revenue down 5% Stock Market LIVE Updates: Tata Steel Q3 result: Net profit drops 43% to Rs 295 cr due to lower income Stock Market LIVE Updates: HCLSoftware designates India as its fifth key global pillar in strategy Stock Market LIVE Updates: Bank of India targets 35% share in MCLR-linked credit in next 2-3 years Stock Market LIVE Updates: Mahindra Logistics Q3 results: Loss at Rs 9.03 cr, revenue jumps 14% Stock Market LIVE Updates: Small steps to equity: Lowering SIP threshold should increase penetration Stock Market LIVE Updates: Finance ministry pushes PSBs to boost affordable insurance coverage Stock Market LIVE Updates: Yellow metal: Maintain allocation; tariff battles may sustain bull run Stock Market LIVE Updates: RBI's Rs 1.5 trillion liquidity booster raises Feb rate cut hopes Stock Market LIVE Updates: Worsening woes: Investors lose Rs 9.2 trillion in broadbased selloff Stock Market LIVE Updates: Bears on the prowl as markets turn skittish; individual stocks hit hard Stock Market LIVE Updates: DeepSeek sparks AI stock selloff; Nvidia loses record $593 bn in mcap Stock Market LIVE Updates: Bajaj Auto, Cipla, Coal India, Tata Steel, Emami in focus today Stock Market LIVE Updates: Cipla, Bajaj Auto Q3; RBI; Nasdaq; DeepSeek; CLN Energy IPO Stock Market LIVE Updates: GIFT Nifty suggests positive start for Sensex, Nifty Stock Market LIVE Updates: Nikkei drags in Asian markets Stock Market LIVE Updates: Tech selloff drags Nasdaq, S&P 500 lower Stock Market LIVE Updates: Good morning readers! Track the latest live market updates here Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 28 2025 | 7:55 AMIST Zubeen Garg death case: Festival organiser & manager arrested; what’s going on? RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US",
    "url": "https://www.business-standard.com/markets/news/stock-market-today-live-updates-sensex-today-nifty-jan-28-nse-bse-equity-bajaj-auto-bajaj-housing-q3-125012800102_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxNb1JNWkpPdVlvWU1Tcnp2dXZTTzkzaDlVaWwwa09QRFVPWVdOQ001Z2ZRQjk1ZzRPczNxUENpRlAtUVk4LWxXODVNakI3MDRqNklBYWVRa3oyMnE1VTNpYTZ6ZVgwNjc4ZVNkZEVibmNyc05GMWtmeEZHNFRKdERVTVhfRlJGYkVtOHhZSWczamg2bElzOU1iM0o1NDVQd3pMRkVPRVcydUtCWG15UlRyVUNpY3VPWTBHczhReV9xWjRlcDRwM1lXS281c2JydnNGUHZoMEpNQmhiSnA5V1J0LXRvaFNHU3NFZVBENEpGcXlLVlhZSmNXODY5TdIBgAJBVV95cUxOY1BqeVhiejA3ZE01QXlJT0o3WTV5blE1SjhlczZoVUN0clJacGQ2RGlHVmNPMVBWX2ZhMmNZdnF4SG8wQzZjMnNUTnU2NlFIS1dwV3U0d3M0Y09pTEQ5MVctQ2h0SjhTcmhKVnNwMXNCUmRvdzBSbWViNDFNMTlWWm9HZ0tneERiblE3OUtvSUh2eDF6QmhVNVFhaUhsUS1zUjd5OFVwVU56bnBJaUJVcFBuN2xqS0JCS0luTHZsMnF4OG5uVkttOU9IS3cyMm1kRzN0VU9iOE10U3J2Z1JIT2x6bngzN3k0N2hPVjg3TkhSNktOaFRaR2YxVzZRN1Vv?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7311,
    "word_count": 1205,
    "gnews_title": "Stock Market Close Highlights: Sensex bounces back, gains 535pts as banks rally; Nifty at 22,957 - Business Standard",
    "published_date": "28/01/2025",
    "publisher": "Business Standard",
    "topic": "NSE India trading"
  },
  {
    "title": "Is the share market open on February 1 for trading on Budget Day",
    "body": "Markets to Remain Open for trading on Saturday, February 1: In a break from the usual weekend routine, the key market exchanges NSE and BSE have announced that they will remain open for trading on Saturday, February 1 for trading on Budget day. This is only the third instance when the share market will remain open on a Saturday for Budget. The markets were open on February 1, 2020, and February 28, 2015, when the Union Budget was presented. Indian markets are usually closed on weekends, but this time, a special trading session will be held on Saturday for the Union Budget 2025, presented by Finance Minister Nirmala Sitharaman. A full day of trading Both exchanges will operate full trading sessions on Budget Day. The equity markets will be open from 9:15 am to 3:30 pm, while the commodity derivatives market will extend its trading until 5:00 pm. As is the norm, pre-market trading will take place between 9:00 am and 9:08 am, followed by regular market hours. However, the “T0” session has been excluded due to a settlement holiday. The trades undertaken on Friday- January 31 will be sttled on the following Monday, February 3. Also Read Stocks To Watch: Tata Motors, KPIT Tech, Maruti Suzuki, Bajaj Finance, Brigade Enterprises, Raymond, Mineral Stocks, GR Infra, Afcons Infra The trading session will run as usual, with key segments like equity, commodity derivatives, and equity derivatives seeing active participation. MCX to stay open on February 1 for trading on Budget day In addition to equity and commodity derivatives trading, the Multi Commodity Exchange of India Ltd. ( MCX ) will also conduct a live trading session on the same day. “The Multi Commodity Exchange of India Ltd. (MCX), India’s leading Exchange in the Commodity Derivatives Market segment, shall be conducting a special live trading session on Saturday, February 1, 2025, to make available the trading platform for market participants on account of presentation of the Union Budget, supporting their real-time risk management and hedging requirements,” said MCX in a press release. “The exchange will remain open for normal trade from 9.00 a.m. to 5.00 p.m.,” added. Union Budget 2025 On February 1, Finance Minister Nirmala Sitharaman will present the Union Budget for the FY25-26, marking her eighth consecutive budget in a row. This follows her previous budget presentation on July 23, 2024, which came after the Lok Sabha elections. Earlier, on February 1, 2024, an interim budget was presented by her in the parliament to cover essential government expenses until the full budget. Read Next How will markets open today? US Futures down on Govt shutdown concerns, and 6 other cues to watch at this hour Are NSE, BSE open or closed on October 2? Full list of stock market holidays in October 2025 How will markets open today? Gift Nifty up, Nikkei down, and 6 other cues to watch at this hour",
    "url": "https://www.financialexpress.com/market/is-the-share-market-open-on-february-1-for-trading-on-budget-day-3730150/",
    "original_url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQb3JqRWNJY1V1YjZoSGsyOU5aSC1RdkMzQUM1bkE3T2gyajFIVndDTkZhNWVvcUtoanhpclNjcjdPU29QUGZGa2w4UVpnNDR4aERVTXJMd21GSEdvWjgxUDdVWjZVR1ZhcnN1VkM4SzFSMlJJWGsyT3FweUlQQzFwU0prOTlkUTd6WlJGX28tcWNvZ3N6bV9uU1hvVTRMQU9Ga25wZl9ac0RyUkNjazVTaGpsOA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2884,
    "word_count": 482,
    "gnews_title": "Is the share market open on February 1 for trading on Budget Day - financialexpress.com",
    "published_date": "30/01/2025",
    "publisher": "financialexpress.com",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Holiday 2025: Is Trading Open On BSE, NSE On Budget Day, February 1st?",
    "body": "Stock Market Holidays 2025: One of the biggest events of the financial year 2025-26 is arriving on February 1st, when the Government of India will declare receipts, expenditures and many reforms to drive the economy's growth. This is called Union Budget! Right from the common man to taxpayers and India Inc., all have high hopes for Budget. Since 2017, the Finance Minister of India has been declaring the Union Budget of the country on February 1st every year. Will the stock market be open on the coming Budget day? Stock Market Holidays: The February 1st Budget announcement falls on a weekend, namely Saturday. And weekends are by default stock market holidays. Hence, trading in equities, equity derivates, derivatives, commodities, bonds, forex and other market related instruments will be closed on Saturday, February 1, 2025. Notably, this is the second time February 1st has fallen on Saturday since 2017, and the Covid-19 pandemic. The last Budget that was presented on a Saturday was on February 1, 2020, right after nationwide band due to the coronavirus. What Is a Union Budget? India's Union Budget is known as the annual financial statement under Article 112 of the Constitution of India. This annual budget is announced every financial year since Republic Day in 1950 which marked the constitution of the country. The annual Budget includes revenues and capital expenditure targets that the government could spend or predict to earn during that financial year. During the annual budget, the Finance Minister announces key reforms and policies that could drive consumption, investment and income of citizens and companies. That being said, the annual budget aims to drive the economy in that respective fiscal than compared to the previous year. What Market is expecting from Budget 2025? Chandraprakash Padiyar, Senior Fund Manager at Tata Asset Management said, that late 2024 and ongoing in 2025 is a clear trend of global capital moving towards the US economy. US$ has appreciated against all currencies sharply. With the new President in the US promising further protectionism, every economy in the world needs to focus on its strong points and look more internally. Fiscal discipline along with other macro parameters would be critical in these times. Padiyar added, \"India has done very well over the past few years on improving fiscal health and the government has articulated its target to achieve below 4.5% deficit for FY26E. Additionally, the Finance Minister articulated the target to reduce debt to GDP sharply beyond FY27. It would be prudent to continue to walk the path of fiscal consolidation and reduce debt to GDP ratios for the country which will go a long way in sustaining growth in the long term.\" While Sarvjeet Singh Virk, Co-founder & MD, Shoonya by Finvasia said, \"I am keen to see how Budget 2025 drives economic growth and inclusivity through key reforms. Reducing long-term capital gains tax, extending retail tax exemptions, increasing FDI limits, and promoting green bonds and startups through tax breaks would help attract capital and foster innovation. Standardizing KYC processes for Ease of Doing Business (EODB) and incentivising first-time investors in the capital market can also significantly enhance financial inclusion and encourage broader participation in India's economic growth. GIFT City's IFSC and enhancements to the Retail Direct Scheme would strengthen India's position as a global financial hub - an opportunity I believe we shouldn't miss out on.\" Virk further said, \"Past budgets have focused on privatization, modernization, and reforms across PSUs, railways, defense, agriculture, and GST to drive growth and improve efficiency. Continued advancements in these sectors to simplify compliance, reduce tax evasion, and enhance Public Digital Infrastructure is the need of the hour to boost growth and improve tax efficiency. With an FY26 fiscal deficit target of -4.5% of GDP, emphasis on capex, job creation, MSME support, and rural housing aligns with a long-term vision to achieve developed nation status by 2047, positioning India for sustained global leadership.\" How Stock Market Is Expected To Perform In The Week Ahead? Puneet Singhania, Director at Master Trust Group said, the coming week promises to be eventful for the Indian equity market, with key macroeconomic data and important corporate earnings reports set to shape market sentiment. The Master Trust Group highlighted the following key events that could stir market sentiments in India: - On Monday, January 27, China's NBS Composite PMI for January will provide insights into the performance of China's manufacturing and non-manufacturing sector health. On Tuesday, January 28, the U.S. Durable Goods Orders for December will offer clues about discretionary spending at the consumer level, followed by Japan's Consumer Confidence for January on Wednesday, January 29. - On Thursday, January 30, the U.S. Federal Reserve's Interest Rate Decision will be announced, which is expected to remain at 4.5%, along with the U.S. GDP Growth Rate for Q4, which is forecasted at 3.1%. These releases will provide essential information on economic growth and monetary policy. - On Friday, January 31, key U.S. data will be released, including the Core PCE Price Index MoM for December measuring the price change in goods and services purchased by consumers and UK Nationwide indicating trends in UK house prices. Singhania said, \"The interplay of rising inflation, global price trends, and corporate performance will be crucial for market participants. Robust performances from these corporate heavyweights could catalyze positive investor sentiment, while any earnings misses may exacerbate market volatility. \" The technical market outlook: Nifty 50 Outlook: Singhania said the NIFTY index ended the week with a 0.48% decline, marking its third consecutive weekly loss. It trades below critical support levels, including the horizontal zone and ascending trendline, as well as the 21 EMA, 55-week EMA, and 200-day EMA, confirming a downtrend. The resistance zone at 23350-23450 continues to cap any upward momentum, signalling strong selling pressure. The current technical structure supports a \"sell on rise\" strategy until the index sustains above 23450. The market may target 22850 and 22600 on the downside. However, a breach above 24450 could signal a potential recovery toward 23750. Traders should remain cautious, as technical setups indicate a bearish bias persists, he added. Indian stock market will react to the budget 2025 announcement on February 3rd, 2025. FM Nirmala Sitharaman will present her eighth Budget for India. Stay Informed with GoodReturns",
    "url": "https://www.goodreturns.in/news/stock-market-holiday-2025-is-trading-open-on-bse-nse-on-budget-day-february-1st-1401673.html",
    "original_url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNYW1CaXJEUDEwWGRMSEtuTVR4aTZRVmlLa09RTVFFUzBLMUVvSjdlSUZlZDI1RXZUNHA0YkZvS0JnQVJhc2E5MENuZVVHbXpsT19YLTAwZ3FWX3c1TmVSUy0tM1pEeHEydEZmc0FJajlGVEdRWXpleHZwXzgwZzRuYWxaZXRyZHB3Tm5UTFVBaWh5bXh1b0R3am1hUEhMUk5CSWN4UWVIQWE0aHFfQllRVVdSQ2Y2WTAyY1JRZ0ZyYnh3UQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 6698,
    "word_count": 1043,
    "gnews_title": "Stock Market Holiday 2025: Is Trading Open On BSE, NSE On Budget Day, February 1st? - Goodreturns",
    "published_date": "26/01/2025",
    "publisher": "Goodreturns",
    "topic": "NSE India trading"
  },
  {
    "title": "India Smallcap Gauge Narrowly Misses Bear Market as Rout Extends",
    "body": "Markets Facebook X LinkedIn Email Link Gift Facebook X LinkedIn Email Link Gift Gift this article Add us on Google Contact us: Provide news feedback or report an error Confidential tip? Send a tip to our reporters Site feedback: Take our Survey New Window Facebook X LinkedIn Email Link Gift By Ashutosh Joshi and Abhishek Vishnoi January 28, 2025 at 10:05 AM GMT+5:30 Updated on January 28, 2025 at 4:17 PM GMT+5:30 Bookmark Save Translate Sign up for the India Edition newsletter by Menaka Doshi – an insider's guide to the emerging economic powerhouse, and the billionaires and businesses behind its rise, delivered weekly. A months-long selloff in Indian stocks is showing few signs of abating, as a gauge of smallcap shares stretched its losses from a September peak to 20% before dip-buying helped it pare some decline.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-28/india-s-smallcap-stock-index-plunges-20-from-september-high",
    "original_url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNRl85UmdMZVRKcUo0cWp5c0tIWTJZeGdubmZHVmI0ZW5GdmxyMDBGcUsyc2VKbnp0WUcyQ0trMkVZR0dJT3dKRUZRZ2lzeW9yM0V6cTB6TkN5MmRyR3gzWnhxbkR1LWFlVDFpT1hud2FpTVVoSWhlbjZzZWpBVmdtZ3cyOF9iaFF6ang4c2RFbFhoc3hGYV95ek9YSXV4QjZXdGRjdk9rZHZqOHV6Nmw4?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 825,
    "word_count": 138,
    "gnews_title": "India’s Smallcap Stock Index Plunges 20% From September High - Bloomberg.com",
    "published_date": "28/01/2025",
    "publisher": "Bloomberg.com",
    "topic": "NSE India trading"
  },
  {
    "title": "Union Budget 2025: Is stock market open on February 1? Find out if trading will be allowed or not",
    "body": "Union Budget 2025:Union Budget 2025: Finance Minister Nirmala Sitharaman will present the Union Budget on February 1, which falls on a Saturday. Typically, the stock market is closed on Saturdays, as the trading days are Monday to Friday. However, in view of the budget, the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) have announced that the stock markets will be open on the day of the budget. On this day too, trading will be done like normal days. Notably, this is not the first time such an occurrence has happened. The markets were also open on February 1, 2020, and February 28, 2015, when the Union Budget was presented. According to the news, a special trading session will be held on Saturday for the Union Budget 2025. The equity markets will operate from 9:15 am to 3:30 pm, while the commodity derivatives markets will extend their trading hours until 5:00 pm. As per the rules, pre-market trading will take place from 9:00 am to 9:08 am, followed by regular market hours. Financial Express reports indicate that the T0 session is excluded due to the settlement holiday. Trades conducted on Friday, January 31, will be settled on the following Monday, February 3. Trading will proceed as usual, with active participation in major segments like equity, commodity derivatives, and equity derivatives. The Multi Commodity Exchange of India Limited (MCX) will also hold live trading sessions on February 1, in line with the Union Budget presentation. The trading platform will be accessible to market participants, assisting them with real-time risk management and hedging needs. MCX will remain open for normal trading from 9 am to 5 pm. The stock market experienced a decline following the 2024 budget announcement. This was primarily due to the government's decision to increase capital gains tax and impose higher taxes on trading derivatives, which led to a 0.13 per cent drop in the Nifty. Also Read:Stock market opening bell: Sensex, Nifty record minor gains in early trade | details here Also Read:Gold, silver rates today | Check latest prices in Mumbai, Delhi, Kolkata and Chennai on January 30",
    "url": "https://www.indiatvnews.com/business/news/union-budget-2025-is-stock-market-open-on-february-1-find-out-if-trading-will-be-allowed-or-not-2025-01-30-973758",
    "original_url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxObks3RXVNajdmRUhVdXM2NzRmVkc0bUV6bEtraXVmaS1GR3VVOTl4eTNTZGxHa1RwRldlMzlsaHo2TXJETVl6MFZrcTNVT3lIcnNzRzFEaEhjS05JcDJNV1lRMzhiN3Zmdnozc1BydF9aNUM3N3U1OGpRQ0RZUXV2Nm5MWXlrU2E4aEhsMlNVbFppLUFudkxoMl9MZmNqNS1zOUVRazlEbFNYY2kyVWxWTzJRQWlBWjNDd3NhT1RyQUJBZlNERXU3Tjd2N0IzU21aZndOVHdSNG5YZ1p0MzVEZmRtTXNveVYzUnMw0gHwAUFVX3lxTE5qQ0hza0xRZ0h4aTBkc2J2dDU1N3R0Z1Fnek5URlNOdlRvSTRIaXAyb0dYc1dDUjZ3b1NiTGxwMXpDTVBudHVQVG5iQ0R3ejFhLXVFSEtGSlBpQWlCRTZaRUlEbUlKRkhQNmIzczExclFGUkN2OUpNY3E1OWhvdHRWUUNzMllrWHA5UUJoLWVOdGlRQ0NhZEFIZnZyc0V5U19PZWQxYi1nc3VFRXlMaFk1T2w0VTdiUjgtbzBaZTY5dktFVHltbmxTa0luX0xXXzNqcS1ZV1NRZVVYSXFxTGRYTWNZUUZLa3hmcGJod2hUeA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2131,
    "word_count": 352,
    "gnews_title": "Union Budget 2025: Is stock market open on February 1? Find out if trading will be allowed or not - India TV News",
    "published_date": "30/01/2025",
    "publisher": "India TV News",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Today: All You Need To Know Going Into Trade On Jan. 28",
    "body": "ADVERTISEMENT Stock Market Today: All You Need To Know Going Into Trade On Jan. 28 The NSE Nifty 50 ended 263.05 points or 1.14% down at 22,829.15, and the BSE Sensex ended 824.29 points or 1.08% down at 75,366.17 on Monday. Chinmay Vasdev 28 Jan 2025, 07:46 AM IST i 28 Jan 2025, 12:19 AM IST 28 Jan 2025, 07:46 AM IST Save The NSE Nifty 50 ended 263.05 points or 1.14% down at 22,829.15, and the BSE Sensex ended 824.29 points or 1.08% down at 75,366.17 on Monday (Representative image. Source: Envato) Show Quick Read Summary is AI Generated. Newsroom Reviewed Markets in Japan were trading lower, trailing losses on Wall Street on concerns over artificial intelligence's growth. The Nikkei 225 was 0.83% down at 39,234.02 as of 7:05 a.m. On Monday, the S&P 500 and Nasdaq Composite ended 1.46% and 3.07% down, respectively. The Dow Jones Industrial Average ended 0.65% higher. Brent crude was trading 0.19% higher at $77.23 a barrel as of 6:57 a.m., according to Bloomberg data. The Bloomberg Spot Gold was trading 0.13% at 2,744.32 an ounce. The GIFT Nifty was trading 0.06%, or 14 points, higher at 22,934.50 as of 7:09 a.m. The Indian benchmark stock market indices settled at the lowest level in over seven months on Monday as they extended losses to a second session in a row. The NSE Nifty 50 ended 263.05 points or 1.14% down at 22,829.15, and the 30-stock BSE Sensex ended 824.29 points or 1.08% down at 75,366.17. The two frontline indices posted their lowest level since June 5, 2024. Market-cap of the Nifty 50 companies fell by Rs 2.4 lakh crore to Rs 182.07 lakh crore. The NSE Nifty Bank index also declined to the lowest level in over seven months during the session. The index ended 0.63% down at 48,064.65. Earnings To Watch Major Earnings To Watch: Bajaj Auto, Bharat Heavy Electricals, Cipla, Colgate-Palmolive (India), Exide Industries, GMR Airports, Hindustan Zinc, Hyundai Motor India, JSW Energy, Mahanagar Gas, Piramal Pharma, SBI Cards and Payment Services, Star Health And Allied Insurance Co, Som Distilleries & Breweries, TVS Motor Co. and V-Guard Industries. Earnings To Watch : Ami Organics, Apar Industries, Apcotex Industries, Arvind, Bosch, CG Power and Industrial Solutions, CSB Bank, Emudhra, Great Eastern Shipping Co, Greenply Industries, Home First Finance Co., Ideaforge Technology, IFB Industries, IIFL Capital Services, Le Travenues Technology, JM Financial, JSW Infrastructure, Jubilant Ingrevia, Kirloskar Pneumatic Co, Lloyds Metals And Energy, Mahindra & Mahindra Financial Services, CE Info Systems, Motilal Oswal Financial Services, Novartis India, Nucleus Software Exports, PDS, PTC India Financial Services, Rites, Route Mobile, RR Kabel, Share India Securities, Shyam Metalics And Energy, SIS, Baazar Style Retail, Suzlon Energy, Syrma SGS Technology, Tatva Chintan Pharma Chem, TCI Express, TTK Prestige, TVS Holdings and UTI Asset Management Co. Facebook X (was Twitter) Earnings Post Market Hours Coal India Q3 Earnings Revenue down 1% to Rs 35,779.74 crore versus Rs 36,153.97 crore. Ebitda down 5% to Rs 12,317 crore versus Rs 12,971 crore. Ebitda margin at 34.4% versus 35.9%. Net profit down 17% to Rs 8,506 crore versus Rs 10,253 crore. Piramal Enterprises Q3 Earnings Revenue down 1.1% to Rs 2,449 crore versus Rs 2,476 crore. Ebitda down 10.8% to Rs 1,075 crore versus Rs 1,205 crore. Ebitda margin at 43.9% versus 48.7%. Net profit to Rs 38.6 crore versus a loss of Rs 2,378 crore. 360 One WAM Q3 Earnings Net profit up 12.6% to Rs 276 crore versus Rs 245 crore. Total income up 4.7% at Rs 934 crore versus Rs 893 crore. Petronet LNG Q3 Earnings Revenue down 6.1% at Rs 12,227 crore versus Rs 13,024 crore. Ebitda up 3.7% at Rs 1,247 crore versus Rs 1,202 crore. Margin at 10.2% versus 9.2%. Net profit up 2.1% at Rs 867 crore versus Rs 849 crore. Sanghi Industries Q3 Earnings Revenue up 36.9% at Rs 259 crore versus Rs 189 crore. Ebitda at Rs 30.3 crore versus loss of Rs 22.8 crore. Ebitda margin at 11.7%. Net loss reduced to Rs 97 crore versus loss of Rs 202 crore. Emami Q3 Earnings Revenue up 5.3% to Rs 1,049 crore versus Rs 996 crore. Ebitda up 7.6% to Rs 339 crore versus Rs 315 crore. Margin to 32.3% versus 31.6%. Net profit up 8% to Rs 279 crore versus Rs 258 crore. Bajaj Housing Finance Q3 Earnings Net profit up 25.4% to Rs 548 crore versus Rs 437 crore. Net Interest Income up 24.9% to Rs 806 crore versus Rs 645 crore. Net interest margin at 3.5% versus 3.6% (YoY) Indraprastha Gas Q3 Earnings Revenue up 1.6% to Rs 3,759 crore versus Rs 3,697 crore. Ebitda down 32.2% to Rs 364 crore versus Rs 536 crore. Margin at 9.7% versus 14.5%. Net profit down 33.7% to Rs 286 crore versus Rs 431 crore. Tata Steel Q3 Earnings Revenue down 3% to Rs 53,648 crore versus Rs 55,312 crore. Ebitda down 5.7% to Rs 5,903 crore versus Rs 6,264 crore. Margin at 11% versus 11.3%. Net profit down 36.4% to Rs 327 crore versus Rs 513 crore. Kaynes Tech Q3 Earnings Revenue up 29.8% to Rs 661 crore versus Rs 509 crore. Ebitda up 34.7% to Rs 94 crore versus Rs 70 crore. Ebitda margin at 14.2% versus 13.7%. Net profit up 47.2% to Rs 66 crore versus Rs 45 crore. Aditya Birla Sun Life AMC Q3 Earnings Net profit up 7.2% to Rs 224 crore versus Rs 209 crore. Total income up 14.9% to Rs 483 crore versus Rs 421 crore. Prudent Corporate Advisory Services Q3 Earnings Revenue down 0.4% to Rs 285 crore versus Rs 286 crore. Ebitda down 4.1% to Rs 65.9 crore versus Rs 68.7 crore. Margin at 23.1% versus 24%. Net profit down 7% to Rs 47.59 crore versus Rs 51.09 crore. Astec Lifesciences Q3 Earnings Revenue up 84.8% to Rs 93.9 crore versus Rs 50.8 crore. Ebitda loss of Rs 5.8 crore versus loss of Rs 18.3 crore. Net loss of Rs 40.4 crore versus loss of Rs 24.3 crore. KRN Heat Exchanger Q3 Earnings Revenue up 69.8% to Rs 111 crore versus Rs 65.6 crore. Ebitda up 34.8% to Rs 15.8 crore versus Rs 11.7 crore. Margin at 14.2% versus 17.9%. Net profit up 74.6% to Rs 13.7 crore versus Rs 7.9 crore. Mahindra Logistics Q3 Earnings Revenue up 14.1% to Rs 1,594 crore versus Rs 1,397 crore. Ebitda up 41.1% to Rs 73.7 crore versus Rs 52.2 crore. Ebitda margin at 4.6% versus 3.7%. Net loss at Rs 7.2 crore versus a loss of Rs 16.4 crore. Updater Services Q3 Earnings Revenue up 9.2% to Rs 695 crore versus Rs 636 crore. Ebitda up 32.5% to Rs 46 crore versus Rs 34.7 crore. Ebitda margin at 6.6% versus 5.5%. Net profit up 48.1% to Rs 30.8 crore versus Rs 20.8 crore. Union Bank of India Q3 Earnings Net interest income up 1% to Rs 9,240 crore versus Rs 9,168 crore. Gross NPA at 3.85% versus 4.36% (QoQ). Net NPA at 0.82% versus 0.98% (QoQ). Net profit up 28.2% to Rs 4,604 crore versus Rs 3,590 crore. RailTel Corp Q3 Earnings Revenue up 14.9% to Rs 768 crore versus Rs 668 crore. Ebitda down 6.5% to Rs 121 crore versus Rs 130 crore. Ebitda margin at 15.8% versus 19.4%. Net profit up 4.7% to Rs 65.1 crore versus Rs 62.1 crore. Federal Bank Q3 Earnings Net interest income rises 15% to Rs 2,431 crore versus Rs 2,123 crore. Net NPA at 0.49% versus 0.57% (QoQ). Gross NPA at 1.95% versus 2.09% (QoQ). Net profit down 5.1% to Rs 955 crore versus Rs 1,007 crore. Prataap Snacks Q3 Earnings Revenue up 8.9% to Rs 444 crore versus Rs 408 crore. Ebitda loss of Rs 5.4 crore versus a profit of Rs 34.7 crore. Net loss of Rs 37.9 crore versus a profit of Rs 10.8 crore. New India Assurance Q3 Earnings Total income down 4.2% to Rs 10,230 crore versus Rs 10,676 crore. Underwriting loss at Rs 1,458.17 crore versus Rs 1,366.63 crore. Net premium at Rs 9,070.33 crore versus Rs 8,986.77 crore. Net profit down 51.7% to Rs 344 crore versus Rs 713 crore. ALSO READ Q3 Results Updates: Tata Steel Posts Surprise Profit, IOCL Profit Surges, Coal India Sees Decline Opinion Q3 Results Updates: Tata Steel Posts Surprise Profit, IOCL Profit Surges, Coal India Sees Decline Read More Stocks To Watch Infosys : Announces collaboration with Street Child to establish seven digital learning centers in crisis-affected areas of Ukraine. Arvind SmartSpaces : To develop a 440-acre mega industrial park in Ahmedabad with top-line potential of Rs 1,350 crore. Bank of Baroda : Enters business transfer agreement with Bank Dhofar to transfer Oman branch’s business. HeidelbergCement India : Refuses comment on market rumors regarding acquisition talks with UltraTech Cement. Wipro : Enters agreement with FrieslandCampina to provide IT services over a five-and-a-half-year engagement. Oriental Rail : Secures Rs 575 crore order from Indian Railways to supply 33 rakes of multi-purpose wagons. Tata Power : TP Solar receives Rs 455-crore contract to supply 300 MWp of solar modules to Maharashtra State Power Generation. IIFL Finance: Bharat Aggarwal resigns as business head-unsecured lending. 360 One WAM : Approves Rs 1,774 crore acquisition of Batlivala & Karani Securities India and Rs 110 crore acquisition of Batlivala & Karani Finserv. Azad Engineering: The company secured a purchase order from Bharat Heavy Electrical Ltd for the supply of advanced, high-complex rotating airfoils for supercritical turbines. The deal value has not been disclosed. Sammaan Capital : Closed QIP with Rs 150 per share issue price, allocating 8.67 crore shares to QIBs. Petronet LNG: Wins order for sale of 250 KTA Propylene and 11 KTA Hydrogen from Petrochemical Complex at Dahej to Deepak Phenolics. ITC: ITC Hotels receives approval for listing on exchanges, effective Jan. 29. ALSO READ Buy, Sell Or Hold: HAL, Birla Corp, Tata Motors, Hyundai, KPI Green Energy — Ask Profit Opinion Buy, Sell Or Hold: HAL, Birla Corp, Tata Motors, Hyundai, KPI Green Energy — Ask Profit Read More Trading Tweaks Record Date Interim Dividend: Tips Music (Rs 3), Wipro (Rs 6), Zensar Technologies (Rs 2) Price Band Changes (From 10 to 5): Avalon Technologies, K.P. Energy, Purvankara Price Band Changes (From 20 to 10): Netweb Technologies F&O Cues Nifty January futures fall 1.22% at 22,846.25 at a premium of 17.1 points. Nifty January futures open interest falls 10.64% Nifty Jan. 30 max call open interest at 24,000 and max put open interest at 22,000. Securities in F&O ban period: Indiamart Intermesh, Manappuram Finance, Mahanagar Gas and Punjab National Bank. ALSO READ Your Guide To FII Positions For Jan. 28 Trade Opinion Your Guide To FII Positions For Jan. 28 Trade Read More Money Market The Indian rupee closed weaker against the US dollar on Monday, as it weakened by 13 paise to settle at 86.34 against the greenback. The domestic currency had opened on a weaker note, depreciating by 14 paise to 86.35 against the dollar, according to Bloomberg data. ALSO READ Trade Setup For Jan. 28: Nifty 50 Faces Resistance At 23,000 Level Opinion Trade Setup For Jan. 28: Nifty 50 Faces Resistance At 23,000 Level Read More Watch LIVE TV , Get Stock Market Updates, Top Business , IPO and Latest News on NDTV Profit. Feel free to Add NDTV Profit as trusted source on Google. OUR NEWSLETTERS Sign Up By signing up you agree to the Terms & Conditions of NDTV Profit ADVERTISEMENT",
    "url": "https://www.ndtvprofit.com/markets/stock-market-today-all-you-need-to-know-going-into-trade-on-jan-28",
    "original_url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPMnQ3V0c4V2ZTYkhYSHlvZDhGeUxld3ptZ0gzM2swOUNPYk1xZDkwdkRidWR1ck1EbUVvbDdPSmU1bG83UkE4bW05VUt3SVJlZVNHQ1RoMndhellZaUZQeVZZSHI4aVpzQ0VXb0REcXNrQV9BZ1dOQ21iTElwRS1MRUpMS2RKUnM4akY1RWR2U1lZdkk3WWZOVTVKRnhlaHdBWG1Z0gGoAUFVX3lxTE9WWkpmbms0ckpZQmF0cHc0Ulg1dEpYcmhrLWVHMnpVck1GTXltdkNYeTAxQjdXbkpLNnYxaVFabWZaY2ROVmJIRnNKUEZZQlUzV0NaMXBuQTIyRU5vRnd1M1FxMmxHemM4OGUzLUpJOExQVGhLSmxSU3h2VWI0MzJxRUpodFhINzFkN1ktN2NESEhKaEZwdlVkX180dThUVW03RWJZVGpZUg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 10989,
    "word_count": 1909,
    "gnews_title": "Stock Market Today: All You Need To Know Going Into Trade On Jan. 28 - NDTV Profit",
    "published_date": "28/01/2025",
    "publisher": "NDTV Profit",
    "topic": "NSE India trading"
  }
]