[
  {
    "title": "Bloomberg",
    "body": "To continue, please click the box below to let us know you're not a robot. Please make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review ourTerms of ServiceandCookie Policy. For inquiries related to this message pleasecontact our support teamand provide the reference ID below. Get the most important global markets news at your fingertips with aBloomberg.comsubscription.",
    "url": "https://www.bloomberg.com/news/articles/2021-02-24/india-s-top-stock-bourse-halts-trading-after-telecom-disruption",
    "original_url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQOWNIa2t5NFZRcE5JOWdDNTFTZW5rRXg2WWxzLW9HaENPN1hZbDRQeEJhS0J1bUVZdGR2SUFfY3BrcVBJT3VjSlNHdXptZ2xGSGZ0YnJZd0o2MGdlUGQxQUpuVlhtWHBpOWluSm9rZmliY1k5dDBFd2wxT2xqY0JVMjNwaXV0bWl2cVJqVmhqbmxyNEhoTHhnY1YzajhPcUt4MVBCU2NVZ1QzcklIczdxeFdnVEU?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 457,
    "word_count": 70,
    "gnews_title": "India’s Top Stock Exchange Halts Trading After Telecom Disruption - Bloomberg.com",
    "published_date": "24/02/2021",
    "publisher": "Bloomberg.com",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE suspends trading due to technical glitch, indices frozen",
    "body": "NSE indices frozen, tweets brokerage firm Zerodha The National Stock Exchange on Wednesday suspended trading on the platform following a technical glitch. Several brokerage firms and retail traders said that Index price feed for NSE indices was frozen due to unknown reason. \"There is an issue with live ticks for NSE indices (Nifty 50, Nifty Bank and others) across brokers. We are in touch with NSE to have this fixed,\" brokerage firm Zerodha said in a tweet. Retail traders also complained of some issue with live ticks for NSE indices. NSEIndia later tweeted that engineers are working on restoring the systems as soon as possible. \"In view of the above, all the segments have been closed at 11:40 and will be restored as soon as issue is resolved,\" it tweeted. \"NSE has multiple telecom links with two service providers to ensure redundancy. We have received communication from both the telecom service providers that there are issues with their links due to which there is an impact on NSE system,\" another tweet by NSEIndia reads. Earlier on Tuesday, the National Stock Exchange announced changes in index maintenance guidelines, criteria and methodology. From March 31, there will be changes to revision in the index reconstitution date, stock capping, quarterly rebalancing of shares and investible weight factors, and calculation of Price to Earnings (P/E) ratio for indices. There will also be changes to calculation of dividend yield per cent for indices.",
    "url": "https://www.indiatvnews.com/business/markets-nse-indices-trading-suspended-technical-glitch-latest-news-687002",
    "original_url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPZ2dwWkNLOFVHMVBEM2d0V3JXVWtOT1BpWWVkNk1lWFpTS0tvWlQ2ZzVBd0RCc1hzRTRqYktOOXFGZ1FMcFEwT2IyanZaMXYxR0dYcUlOUlBXRU9fc3p3R2tfV0VsZEZQdzJyc0ZucEg0bmhaNy12MVlEMlpBQVdRRks1dk44YzdnMWN0Z0xVTTQ5WlhJZmxLWDgtRFdId2Y4NjhoY29vV0xFWXJmSzRB0gG0AUFVX3lxTE53QTd5MVdoaVBZNDBsSGN1d1BvMy0wVVF1N1JmLW5IbjY2WkRBeE00aDlJMDZHZ0M0XzVKbDF3a01YYnVzSTlsMjhKS2RmbUpPaHQ0MkhsYThXWGFBZVFld3JLSjQwbzV5Y1ptRkF6TndHSUpwSW9UWTBGVWUwVF90bjY2QloxWHBMRnduTU1mal85R3ZKXy1fMGxxNW1kX0tZSzFKeTQ2aF9BaU1faVo0V000Yw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1467,
    "word_count": 238,
    "gnews_title": "NSE suspends trading due to technical glitch, indices frozen - India TV News",
    "published_date": "24/02/2021",
    "publisher": "India TV News",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE IFSC to introduce trading in US Stocks",
    "body": "IFSC As one of the largest and fastest growing economies , India has been a major consumer of International financial services (IFS). The 2007 report of the committee set up by the Ministry of Finance (popularly known as the Percy Mistry Committee Report) had estimated that even under conservative assumptions, purchases by Indian households and firms of IFS will be nearly $50 billion by 2015, and could exceed $120 billion by 2025. Thus, with the objective of bringing back to India the international financial service business generated from India, and gradually emerge as an international financial services hub at the regional and global level, Government of India operationalized India’s maiden International Financial Services Centre (IFSC) at GIFT Multi Services SEZ in April 2015. IFSCA The International Financial Services Centres Authority Act was passed in December 2019 and the IFSCA commenced its operation as a unified regulator in October 2020. The IFSCA has been vested with the combined powers of four domestic regulators namely RBI, SEBI, IRDAI and PFRDA and has a mandate to develop and regulate financial institutions, financial services, and financial products within the IFSCs in India. The strategic objectives of IFSCA are as follows: To position the IFSC as a leading internationally recognized centre with trusted business and tax regulation, and judicial & dispute resolution system. To become a gateway for global capital flows into and out of India. To emerge as a regional/global hub for international financial services. NSE IFSC to introduce trading in US Stocks NSE International Exchange has announced that trading in select US Stocks will soon be facilitated through the NSE IFSC platform. The offering will be in the form of unsponsored depository receipts. IFSCA has facilitated the same under the Regulatory Sandbox. The entire trading, clearing, settlement and holding of US Stocks will be under the regulatory structure of IFSC Authority, stated an official release here Monday. This initiative is a first-of-its-kind at IFSC where Indian retail investors will be able to transact on the NSE IFSC platform under the Liberalized Remittance Scheme (LRS) limits prescribed by the Reserve Bank of India (RBI), it added. The business model offered by NSE IFSC will not only provide an additional investment opportunity to the Indian investors but also make the entire process of investment easy and low-cost. Investors will be provided with an option to trade in fractional quantity / value when compared to the underlying shares traded in US markets. The proposed framework will make US stocks affordable to Indian retail investors. NSE IFSC Clearing Corporation Limited (NICCL) is to offer its robust risk management framework, facilitate clearing and settlement of all trades in depository receipts and provide settlement guarantee in respect to all trades executed on the NSE IFSC platform. Furthermore, all the trades will be covered under the investor protection framework at NSE IFSC. Source https://indianexpress.com/article/india/nse-ifsc-to-introduce-trading-in-select-us-stocks-7446415/",
    "url": "https://www.investindia.gov.in/team-india-blogs/nse-ifsc-introduce-trading-us-stocks",
    "original_url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOeFJBRjVhSm5sVXVBS29tT1Uxb0l6Y0tHYnNZd3BYVUcwMXdHVlVkbFN6Q2t6WHh2SWF1TmEyUjBMVUxTWjlmMjFhVWhlTFNZLUxuZ1ZqYVNNT3I4T3J2dEllY0lRY2VaU0VoaEpicmFvNHplVFp0STBtT0NMendZTnU0RVo1QUdVN2l5Sg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3134,
    "word_count": 474,
    "gnews_title": "NSE IFSC to introduce trading in US Stocks - Invest India",
    "published_date": "10/09/2021",
    "publisher": "Invest India",
    "topic": "NSE India trading"
  },
  {
    "title": "How many trading days are in 2021?",
    "body": "The National Stock Exchange of India (NSE) and the Bombay Stock Exchange (BSE) are the two principal stock exchanges in India. The list of holidays of NSE and BSE consists of national and some regional holidays. Check the open and close timings along with the open and closed days of the stock exchange market in the year 2021. Out of 365 days in the year 2021, 104 days are weekend days (Saturday and Sunday) when the stock exchanges stay closed. Apart from the weekends, there are 13 holidays in 2021. The list of National Stock Exchange (NSE) holidays for 2021 includes the national holidays and the regional public holidays. NSE has five working days a week, i.e., from Monday to Friday. The exchange remains closed on all Saturdays. While the starting bell of the exchange is at 9:15 am, the closing bell is at 3:30 pm. Bombay Stock Exchange (BSE) is the oldest stock exchange in India and is the third biggest stock exchange in the whole world. BSE was conceptualized in the year 1875, and it gained popularity for the faster processing of transactions. Bombay Stock Exchange or BSE is open for trading from Monday to Friday and is mostly closed on Saturday and Sunday. However, if Diwali falls on a weekend i.e at the time of Muhurat Trading, certain platforms may remain open for a specific time. This year the Muhurat Trading shall be held on November 04, 2021 (Diwali - Laxmi Pujan). The Bombay Stock Exchange will remain closed on 13 days in 2021. Republic Day 2021 on Tuesday, January 26th, was the first off-day of BSE, there are twelve more holidays in the year 2021. The next holiday of Bombay Stock Exchange is Maha Shivratri Day and will be observed on Thursday, March 11, 2021. Morning trading shall take place between 10:00 a.m. and 05:00 p.m. Evening trading shall take place between 05:00 p.m. and 11:30 p.m. Modification and order entry begins at 09:00 am on all business days. Modification and order entry closes at 09:08 a.m. on all business days. Restricted physical market or normal market commences at 09:15 on all business days. Restricted physical market or normal market commences at 15:30 on all business days. Morning block deal window starts at 08:45 am and closes at 09:00 am. Afternoon block deal window starts at 02:05 pm and ends at 2:20 pm. The trading session is closed between 15:40 and 16:00. The trading hours can be extended, reduced or advanced according to need. Read:Madhya Pradesh Government holiday list 2021: Check here Read:When is Attukal Pongala: Date, significance and all you need to know Read:How many Mondays are in 2021?",
    "url": "https://www.indiatoday.in/information/story/how-many-trading-days-in-2021-kr12-1765455-2021-02-03",
    "original_url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOQ0R2RU5rWnhuSWl1VWFsM0JWbTNuSldXUGl4WllUZUJDQjlfMkozdXFwZm9Xbm5nUzlfeUVYMnlJMWxTdlE3Y3Y4aDM5aEI5SXFTb0lHS1pqY3RBWXY1RzNuMFh5SjNTOVhnRjJPbkRXRE9rM2JnbTVyYURpMS1zYkpOY1hCSUVaMGxfQzd6VmVjMUlIc2JmMTJ2Q1N4Z9IBowFBVV95cUxPMUhDWlN2azhvZkNEUG41V1o3SGRuVVZNSU5jXzR4aHZEVTZQMGQ0cFZIYnFhaDE5ZzR1OWxXSGhjblJKWE9rR3RLN3ZJT1J3eWNjdVdCVGxNejZjd1IxdFk2ZUJJUzFQLXFZcnQxZEpfUFNROUJsWkgySnRfRTU3UVppNEtBRVNBN01HNFF1aE12cUpKVUtsa2tsaXJOSXBYaE5F?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2577,
    "word_count": 444,
    "gnews_title": "How many trading days are in 2021? - India Today",
    "published_date": "03/02/2021",
    "publisher": "India Today",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE VS BSE | How NSE Beat BSE to Become India's Top Stock Exchange",
    "body": "Stock exchanges are the powerful platforms or marketplaces that allow us to invest or trade in securities. Most beginners in the stock market have a doubt regarding the exchange they should transact in— whether it should be BSE or NSE. In this article, we dive into the two prominent stock exchanges of India. We shall also analyse the factors that helped NSE become our country’s largest stock market exchange. TheBombay Stock Exchange(BSE) was established way back in 1875. Located in Dalal Street, Mumbai, it is the oldest stock exchange in Asia.There are more than 5,400 companies listed on the BSE. Its benchmark index, theS&P BSE Sensex, is widely tracked by investors across the globe. The Sensex (Sensitive Index) tracks the performance of 30 of the largest and most actively traded stocks on the BSE. As of 2020,BSE is the 10th largest exchange in the worldin terms of the cumulative market capitalisation of all companies listed on its platform. TheNational Stock Exchange(NSE) was incorporated in 1992. It is also located in Mumbai. NSE is ranked the third-largest stock exchange globally in terms of the total number of trades in equity shares.There are more than 1,600 companies listed on the NSE. It is the first bourse in India to implementelectronic or screen-based trading. TheNifty 50is NSE’s benchmark index that represents the weighted average of 50 of the largest companies listed on its platform. Both NSE and BSE provide a platform for companies to raise funds efficiently.The exchanges allow investors to trade in equities, currencies, debt instruments, derivatives (F&O), and mutual funds. Moreover, they provide services such as risk management, clearing and settlement, and investor education. The exchanges operate under the strict guidelines of the Securities and Exchange Board of India (SEBI). For more than a century, BSE had complete dominance over stock trading in India. To break this monopoly and improve transparency in the capital market, our government decided to create the NSE. It wasIndia’s first computer-driven stock exchangeand was promoted by some of the leading financial institutions at that time. NSE was given the right to set uptrading terminalsacross the country, while BSE was not allowed to do so. [Trading terminals are intermediary software that allows investors and traders to place buy/sell orders without having to call their brokers]. Meanwhile, it took a few years for BSE to receive permission for the same. Thus, NSE was able to capture a significant portion of share trading across India. They used state-of-the-art technologies to ramp up the performance of trading systems.NSE was the pioneer of automated and paperless trading in the Indian market. It set up the firstdepository— the National Securities Depository Ltd (NSDL), which initiated the demat revolution in the country. NSE was also the first stock exchange to establish a clearing corporation (NSE Clearing Limited), which helps reduce trading and settlement risks in the market. With the arrival of NSE, investing and trading in stock markets became highly transparent, efficient, and less costly. Ever since NSE was established in 1992, there has been fierce competition between the two bourses for attracting more trading volumes. Higher volumes would ultimately allow exchanges to obtain more revenue. More importantly, it would lead to betterliquidity, an aspect that is vital while trading in shares and derivatives. Higher liquidity allows traders to quickly and easily buy or sell shares at the exact price specified by them. As a result of its revolutionary offerings,NSE has the highest average daily turnover for equity shares than any other stock market in India. The turnover for an exchange refers to the overall value of shares traded during a certain period. Let’s look at an example. On July 12, 2021, around 15.76 lakh shares of Reliance Industries were traded on the BSE. At the same time, ~39.6 lakh shares of RIL were traded on the NSE— more than double! Since NSE has high trading volumes, the price a buyer offers per share (bid price) and the price the seller is willing to accept (ask price) will be fairly close to each other. This helps intraday and swing traders enter and exit a trade at the exact price specified by them and realise their targets. For those who are not aware of whatderivatives tradingreally is, here’s a quick explanation: A derivative is an instrument whose value is derived from an underlying asset. The underlying can be a stock, commodity, index, etc. Derivatives are used by large institutions or traders to hedge risk and to speculate on price changes in the underlying asset. Futures and options (F&O) are the most common types of derivatives trading. An agreement (or contract) can be formed between a buyer and seller to buy/sell a predetermined quantity of the underlying asset at a specified price on a specified date. You can learn more about basic options termshere. Coming back to the point,NSE has always been the most liquid exchange for derivatives. It is the undisputed leader when it comes to futures and options (F&O) trading. This is clear when you compare the volumes (options chain) of F&O activated stocks on NSE and BSE. In most instances, there are zero contracts formed in BSE. On the other hand, NSE’s Nifty 50 and Bank Nifty are traded heavily in the stock market. Despite its exceptional growth, NSE lags behind BSE on one aspect: the brand. Sensex is still widely used across the world to measure the health of the Indian markets and the economy. To summarise, NSE is the preferred exchange for intraday, swing, and derivatives trading due to high liquidity. If you are a long-term investor, it does not really matter where you buy/sell shares. However, BSE gives access to more than 5,000 stocks across various sectors. There could be a minor/insignificant difference in the prices of scrips in NSE and BSE. The costs related to investing and trading are similar for both exchanges. Over the past few years, stock exchanges have come under the scanner due to frequent technical glitches. You may recall the four-hour-long halt in NSE’s trading system that occurred inFebruary 2021. The exchange informed that the instability of telecom links from two of its service providers had affected the functioning of its risk management system. Unfortunately, it resulted in heavy losses for investors. There was a complete lack of accountability from NSE. Recently, SEBI came out with a standard operating procedure (SOP) to curb technical glitches in stock market operations. NSE and BSE could face a penalty of up to Rs 2 crore or more if they fail to respond to technical disruptions within 30 minutes and restore operations within 45 minutes. Stock exchanges and other market infrastructure institutions (MIIs) will have to submit a root cause analysis report within 21 days of an accident. Let us hope such events do not occur in the future! Thanks for sharing such a good analysis Really a very good topic. Very good explanation. Honeykomb by BHIVE,19th Main Road,HSR Sector 3,Karnataka - 560102",
    "url": "https://www.marketfeed.com/read/en/how-nse-beat-bse-to-become-indias-top-stock-exchange",
    "original_url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQOW1MWnlOckZkMkEwcDJvTE9xQVVBcTVYYXZqdDlRSDA3c0VWQXRzZE1UTUVxRjRZTUJ6TVJFVmVNX1ZiaUpFTWRVV0c0MFNsWHhjN1Y0YjZrbDNqYllySURJaXRma19GUXphLWI2OHg1dkxMNndRaE9FVkl0NTJqVXR3MWNmSzE1VVR5OFU2WGc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7101,
    "word_count": 1155,
    "gnews_title": "NSE VS BSE | How NSE Beat BSE to Become India's Top Stock Exchange - marketfeed",
    "published_date": "20/07/2021",
    "publisher": "marketfeed",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE tech glitch: SEBI seeks explanation for not migrating to disaster recovery site",
    "body": "Markets regulator SEBI on Wednesday asked the National Stock Exchange (NSE) to explain why trading on the bourse did not migrate to a disaster recovery site after facing connectivity issues. NSE should carry out a root cause analysis of the reasons for the trading halt, a statement from SEBI said, adding that it was in constant touch with NSE officials all through the day and monitored the situation closely. Trading on NSE, India's largest bourse which handles over 90% of the volumes, came to a halt on Wednesday morning due to what the exchange termed as issues with telecom connectivity. Activity in some segments started facing glitches since around 10 am, within minutes of the markets opening at 0915 hrs, and all activity at NSE ground to a halt at 11.40 am. \"In view of the exceptional situation arising out of the trading halt, it was decided to extend the trading hours from 1530 hrs to 1700 hrs at NSE, BSE and MSEI,\" the SEBI statement said. The NSE should \"explain the reasons for trading not migrating to the disaster recovery site\" and asked it to submit a report at the earliest, according to an official statement. A disaster recovery system helps as a plan-B in times of distress to ensure that activity is not affected. Trading across segments was halted at 11.40 am on Wednesday due to \"issues with the links with telecom service providers\", according to the NSE. The bourse said it depends on two telecom service providers for connectivity, and both failed simultaneously resulting in the outage. \"The NSE was also advised to keep the market participants updated with the evolving developments,\" it said. In an unprecedented move, the bourses extended their trading hours till 5 pm as against the usual end of trade at 3.30 pm hrs, probably to make up for lost volumes. However, even after extended trading hours, the overall volumes could not touch the usual averages, NSE data showed. In the equities market, the value of securities traded on Wednesday stood at Rs 45,837 crore, as against an average daily turnover of Rs 72,472 crore in January in the cash segment. Similarly, in the equity derivatives segment, the total futures and options turnover stood at Rs 30.59 lakh crore on Wednesday, as against Rs 40.32 lakh crore on Tuesday. In June 2020, NSE's bank option segment prices were not reflecting on the terminal linked to the exchange. In September 2019 too, the bourse's system faced a trading outage as investors were unable to place orders in the final minutes of trade. Jimeet Modi, founder and chief executive at Samco Ventures, a brokerage, said there is a precedent of complete annulment of trades on Muhurat trading day on BSE Futures and Options segment in 2011. Commenting on Wednesday's outage, he said, \"The biggest question in this whole issue is why was the entire market shut just because index feeds were not refreshing? Feeds for underlying contracts were fine and so was order matching, so why shut down the entire market? \" \"SEBI and NSE need to quickly look at alternatives here if this isn't getting fixed,\" he added. Tata Communications and Bharti Airtel take care of NSE's connectivity. However, there was no statement from the companies. The NSE's 50-share benchmark Nifty gained 1.86% to close at 14,982 points on Wednesday. BSE's 30-share benchmark gained 2.07% to 50,781 points.",
    "url": "https://www.thenewsminute.com/money/nse-tech-glitch-sebi-seeks-explanation-not-migrating-disaster-recovery-site-144128",
    "original_url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQNElrQ3pIQ2FLX2dWa2c2b2k2RVNRSWFBZ0tOR2NoYUoyTWJGZWVMaUlURkdnOWp4ZjFodTFPZXlsNDFlSzdPRGtNQWx3WXlLVjhYQzlJME5zcVdESU51c0JmUUFvUUFBRWhhOGZ4UVd4WTlzSmdLN2lqczZjT1prdE9JZWoxQXpEUlc5c3pxcnZibWw5MENWNUcwbHdkSHhTOWFsdk5JZjE3dUM4NW5vdG02clg4OE0xY2fSAccBQVVfeXFMTXVUNWlmT1FfMlJNa2lLeTVMa2x1SGstUWVOVHFnYXh3d0U1MURhdHozNFBDTlE0MTRoWVJrQ0NLR0ZENUsyTU8xajktMnI0bXBUTU1Ob3pxWW1pZ1gxZHZ6TXBlOUxFX2VlVmhrTVdBdVM3N2ZMX1k4T2RNRzBNVkp1SlA3S09JWEp3SnNtSlA3QmFidVpwLWQxSGZ4bHNWWG5qT3lPV0RvcFo2eFQxYnBWbmt1S1FPOW8yUDFFWTRFdlRYZHlZYw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3341,
    "word_count": 564,
    "gnews_title": "NSE tech glitch: SEBI seeks explanation for not migrating to disaster recovery site - The News Minute",
    "published_date": "25/02/2021",
    "publisher": "The News Minute",
    "topic": "NSE India trading"
  },
  {
    "title": "Glitch disrupts NSE trading for 4 hours in longest such outage",
    "body": "Stocks turned in dramatic gains of nearly 2% in a late surge on Wednesday, capping a turbulent day that saw trading on the National Stock Exchange (NSE), India’s largest, disrupted for nearly four hours because of a technical glitch. The outage, the longest such in the country, prompted NSE and its main rival BSE to extend trading hours until 5pm on Wednesday to allow investors to close their positions ahead of Thursday’s expiry of monthly derivatives contracts. Many investors couldn’t as brokerages squared off open positions to mitigate risks. NSEaccounts for 80% of India’s trading volume in derivatives. Also Read|India’s tricky options in the Myanmar muddle The first signs of a problem were noticed about an hour into trading at 10.06am as traders complained that NSE’s benchmark Nifty index, as well as the Nifty Bank Index, had stopped updating. After about an hour of confusion, at 11.40am, the exchange halted trading in all segments, including derivatives and cash, citing ‘issues’ with the telecom links of its two service providers, which it claimed caused the system to stop updating prices. As trading resumed at 3.45pm, in a special session, stocks surged, confounding investors with the sheer velocity of the rally. Analysts said the rally was prompted by investors and brokerages trying to square off trades. BSE continued normal trading in all segments through the extended trading day. After trading came to a halt on NSE, the exchange notified traders that it received communication from its telecom service providers that there are issues with their links. “We are working on restoring the systems as soon as possible. In view of the above, all segments have been closed at 11.40am and will be restored as soon as the issue is resolved,” an NSE spokesperson said in a statement in the afternoon. Brokers, however, were puzzled as to why trading could not be switched over to NSE’s backup site in Chennai and the unusual time taken by the exchange to communicate to investors. The backup site is a replica of the primary site and is aimed at ensuring trading activity does not stop even if there is a technical glitch. The Securities and Exchange Board of India (Sebi) has advised NSE to carry out a detailed analysis of the circumstances that caused the snag. Market participants and brokerages said NSE could have handled the situation better. Traders said those with open positions in the derivatives segment were on tenterhooks till NSE communicated about a resolution plan at 3.30pm. Many customers who trade in the futures and options (F&O) segment on NSE could not exit, and brokerages squared off positions by 4pm. “While the extended trading session helped many F&O customers exit their positions, it created confusion among customers whose positions had been squared off,” said Zerodha, an online brokerage with the highest number of retail clients. If NSE had informed brokers of a potential reopening or extension of trading hours, at least by 3pm, brokers would not have had to take risk-mitigation measures and square off positions on BSE, Zerodha said. “Unfortunately, because there were no updates, we had no other choice. The last-minute notification of the trading extension at 3:17pm came a little too late,” Zerodha said. Bharti Airtel, one of the telecom service providers to NSE, has received no communication from NSE, said a person aware of the matter. “Airtel is awaiting NSE’s RCA (root cause analysis) of the technical snag. Based on RCA, the company will move forward and respond accordingly,” said a person aware of the matter. The BSE Sensex rose 1,030.28 points, or 2.07%, to 50,781.69. The 50-share index Nifty gained 1.86% to 14,982. “Volumes on NSE were expectedly lower than the recent average. However, volumes on BSE at₹40,700 crore were the highest since March 2017, due to diversion of trades,” said Deepak Jasani, retail research head, HDFC Securities. “We have taken the matter seriously and have sought a report from Sebi at the earliest,” a finance ministry official said under condition of anonymity. Asit Ranjan Mishra and Ishita Guha in Delhi contributed to the story. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/glitch-disrupts-nse-trading-for-4-hours-in-longest-such-outage-11614213355286.html",
    "original_url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPSUpIZGhvQjNZbDd0SmdrRDRjVF9KekozUkpDcEtSSDRPaE5VTm9yYkJRZGZvN2NFQ3JrNzRsQ1JjeXJNOXhIUWh6U003b1dRWTI4clh0Zm5RbWhEWFhvX0VVaC1UQi0telk4Um83V19CUmNDbzV6M0g4ZUU0b0FnQjloNTBpSFVHRjMyQlc4RW9lSW92SE9qakdDQUV2VFNxVVNLcnB5c08tZktqXzhZYXBLdi1LVU5GSXBtemk5VFdPblhUTmRwZXJfY3HSAdIBQVVfeXFMTjgycVdXZ0kyWU8zMVZuMHU1aFBhYXpiaWp6c0o2R2dqa1hlRzRTQmxXSjZrSFBtOTBPelVjRmZaN2laWmFVVmxuQXJubFBWWXJVU2pfTXlzbUpwS19lZ3lNVnVCd3ppU0Z2c0p0VXZJZ3dRcXJvS0RiY1ZRYWUwU19NbkZrVnRTbWI0cXJJalhyVGFndVNrTV9IaE5xOEtPODNsVkFMRWRsTlhVLW92N0JzTzYtOTMzZXpDcmluTks2MXkyTHhkQlZjMkQwcGR3THln?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4361,
    "word_count": 710,
    "gnews_title": "Glitch disrupts NSE trading for 4 hours in longest such outage - Mint",
    "published_date": "25/02/2021",
    "publisher": "Mint",
    "topic": "NSE India trading"
  },
  {
    "title": "Three market giants have posed an open challenge to students",
    "body": "Subject : Email WhitelistingBody : Hi, I'd like to receive all communications from The Ken. These are one-time fixes to ensure that you don’t miss out on anything interesting. We currently limit the number of free gift subscriptions per subscriber. You’ll get more when you renew your subscription. In the meantime, if you want to tell someone about The Ken, gift them a story. To track your gifted subscription, go to yourAccount Settings We’ve emailed your gift link. Want us to send some more? 0of 0Subscriptionavailable It began as just another day on the bourses, but ended as anything but. Within an hour of the stock market opening on 24 February, the first signs of trouble appeared. A little past 10 AM, the exchange feeds of the National Stock Exchange of India (NSE) for its widely tracked indices, including the Nifty, stopped across brokerages. Trading continued for about 90 minutes on India’s premier stock exchange before it was abruptly halted. What followed was an unprecedented four-hour closure—the longest outage in NSE’s 29-year history. The chaos and confusion this unleashed was compounded by the lack of communication from the exchange until it was too late. The extended trading session announced just minutes before the market’s usual closing time was little comfort for many traders who had to suffer losses for no fault of their own. Their intraday positions on NSE had been closed by brokers on the rival BSE (formerly Bombay Stock Exchange) a few minutes earlier to prevent penalties, had NSE not re-opened for trading. The losses, outrage, and embarrassment the outage caused put NSE firmly on the backfoot. Even Finance Minister Nirmala Sitharaman said that it cost the government “immensely”. The exchange blamed instability in telecom links and a vendor making inappropriate changes to technical equipment; these claims are being closely scrutinised. Written byAnand Kalyanaraman",
    "url": "https://the-ken.com/story/how-nse-india-turned-from-solution-to-problem/",
    "original_url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1hdV9VUUF3VVZSaE9ZZTEyUGVueU9uRG8tRWpLdHVoTldtZ1p0MWN6WWNiMmUyTkhfZl9zb1hOUDZsNVRHaWR0bTV0TFhLaHVqWEZmekItc3ZQSjhqMmhIZXUtVWJCQXVkZWQza2FZWU1GdEpybEFJY0hfc3k?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1914,
    "word_count": 306,
    "gnews_title": "How India’s National Stock Exchange turned from solution to problem - The Ken",
    "published_date": "01/04/2021",
    "publisher": "The Ken",
    "topic": "NSE India trading"
  }
]