[
  {
    "title": "Eid-e-Milad 2025 Share Market Holiday: Are NSE and BSE open or closed today, September 5?",
    "body": "Eid Milad-un-Nabi NSE-BSE Holidays 2025:As traders and investors prepare for the forthcoming trading sessions, many are curious whether the Indian stock market is open or closed today. Milad-un-Nabi, also known as Mawlid or Eid-e-Milad, is a significant Islamic holiday that commemorates the birth anniversary of the Islamic Prophet Muhammad. Additionally, the Prophet also passed away on that same day, and Muslims worldwide observe the day by reflecting on the Prophet’s teachings and life. According to the National Stock Exchange (NSE) and BSE’s stock market holiday calendars, trading on the BSE and NSE will be operational as usual today, indicating that today is not a stock market holiday. The Indian stock market will remain open for regular trading on Friday, and according to the calendar, there are no additional holidays in September, except for the mandatory Saturday and Sunday closures. AfterGaneshChaturthi2025, there arefivemorestockmarketholidays thatwillbeobservedthisyear, which will fall in the upcoming months of October, November and December, as listed below: Mahatma Gandhi Jayanti / Dussehra:October 2, 2025 Diwali Laxmi Pujan:October 21, 2025 Diwali Balipratipada:October 22, 2025 Prakash Gurpurb Sri Guru Nanak Dev:November 5, 2025 Christmas:December 25, 2025 Even though October 21, 2025, is a trade holiday for Diwali Laxmi Pujan, the exchanges will run a special Muhurat trade session to commemorate prosperity and fresh beginnings in keeping with the festive mood. The timings will be notified later via a circular. Stay updated with the latest -",
    "url": "https://indianexpress.com/article/india/eid-e-milad-2025-nse-bse-share-market-holiday-september-5-10231215/",
    "original_url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQU0Vrb0dDTDgzMWdBd09Ma2oyYm84MVJPMlA3Mk5MbVRBenMxOGM2TEV5RmNyZHNtTjFlb2ZBR05ZZjktMnNQNURKdzFJQzEwMEpCYzJkTGctcjVuSE9UY1R2SWZNWW9Qb0F5VW9MOHE3UkVOUVVnYUpCbkwyVGd2VC14dDNEaUVoMEVhU2NoVGxVcWpwanprZllsU3pXS2hRTFB0MWJXOV8zVU3SAbIBQVVfeXFMT1lXOHhTTGJscGNpT2FTSllPeWNSY05nM0J3Z3BrZ2RVOXROVlJFWnZoeXJpQ3BXUVJmWm05NFdEZ3ZNa3VPOWl6MEVzNU9leWxrT3NwM0ZpdjBkRUtRR1E4Y3ZQWm4tMXNLMWhlMWhVLWNSUHhmMU9pQnpHU0huSHJENE1qanllVDdJMkFpYkJiN2l3S1RHb3U2cDk5Y3Z3eVFVWUNKMnlFdUV3UGF1dE1wZw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1579,
    "word_count": 234,
    "gnews_title": "Eid-e-Milad 2025 Share Market Holiday: Are NSE and BSE open or closed today, September 5? - The Indian Express",
    "published_date": "05/09/2025",
    "publisher": "The Indian Express",
    "topic": "NSE India trading"
  },
  {
    "title": "Share Market Timings in India",
    "body": "Last Updated: 26 Sep 2025 To effectively trade or invest in the financial markets, you need to have the proper knowledge about the stock market timings in India. All over the country, theshare markettimings are the same. Therefore, once you get to know what the stock market timings are, you can buy, sell, or invest in shares from any part of the country during that time. These timings are also the same whether you want to trade on any of the two major stock exchanges in India, namely the BSE and the NSE. The regular market trading hours are from 09:15 AM to 03:30 PM. There’s a pre-opening session before 09:15 AM and a post-closing session after 03:30 PM, conducted after India stock market hours. Here is the Indian stock market opening time and closing time, along with the sessions that take place during the course of the day. used to evaluate buy and sell orders to determine the opening price. The pre-opening session starts at 09:00 AM and goes on till 09:15 AM. It’s further divided into three sections. During one of these time slots, you can place orders to buy or sell shares for a limited period. Let’s look at the details of the pre-opening session below. You can use these 8 minutes to place an order to buy or sell various shares on the stock market. You can also change or cancel any orders you have placed. Once the regular market starts at 09:15 AM, the ones executed during this part of the pre-opening session take priority in the queue of orders. You can’t place new orders, change existing orders or cancel orders during these 4 minutes. This section is required to carry out price matching by comparing supply and demand. It is used to calculate the prices at which various shares will be traded when the market opens at 09:15 AM. This 3-minute window of time is like a connection section between the pre-opening session and the normal trading hours. It behaves like a buffer to ease the transition into the regular trading session. Again, during these 3 minutes as well, you cannot place, modify, or cancel any orders. This is known as the continuous trading session. It runs from 09:15 AM to 03:30 PM. You are able to buy and sell stock freely during this session, and you are able to place buy or sell orders for stock as well as modify or cancel those buy or sell orders without any restrictions. An order-matching mechanism is adopted within the window. Every sell order is thus against a buy order at the same stock price, and every buy order is against the buy order at the same stock price. This session begins when the regular trading session comes to a close at 03:30 PM. The post-closing session, which runs up to 04:00 PM, consists of two sections. In these 10 minutes, the closing prices of stocks are calculated by taking the weighted average of the stock prices traded between 03:00 PM and 03:30 PM. The closing prices ofindiceslike Sensex and Nifty are calculated by considering the weighted average prices of all the securities that are listed in that index. In this 20-minute section, you can still place buy and sell orders. But the orders are confirmed only if there are sufficient numbers of buyers and sellers in the market. Here’s how you can invest in the stock market step by step: Pick a broker or trading app. Complete your KYC and registration. Add money to your account using bank transfer or other payment options. Check company details, market trends, and reports. Beginners can start with blue-chip stocks, mutual funds, or ETFs. Buy stocks through your broker or app. Begin small and increase slowly. Invest in different sectors to reduce risk. Track the market to keep your stocks aligned with your goals. Stock market timings define the hours during which trading activities take place. Markets operate in sessions. These include pre-market, regular trading, and post-market periods. Let’s analyse theequity market time in Indiain detail: Stock market closing times in India are divided into two key trading sessions: morning and afternoon. These sessions define when investors can engage in trading before the market shuts for the day. – Opening Time: The India stock market start time is 9:15 AM IST. – Closing Time: 12:30 PM IST. – The market sees high activity as global trends influence early trades. – Opening Time: 12:30 PM IST. – Closing Time: The Market closes at 3:30 PM IST, marking the end of share market trading timings in India. – Investors make final trades before the closing bell. Additionally, different exchanges may have variations in the India stock market trading time, especially for post-market and after-hours trading Aftermarket orders give investors a chance to trade even after the stock market closes. This is useful when big news or announcements come after hours. In India, brokerages accept these orders between 4 PM and 9 AM for the next day’s market open. This way, investors can react to overnight developments, secure better prices, or adjust their portfolios. It allows more flexibility and helps them prepare strategically for the next trading session. On most public and national holidays, the Indian stock market stays closed. But there is a special one-hour session called Muhurat trading on Diwali. This tradition exists because Diwali is considered an auspicious day for wealth and prosperity. The exact timing of this session changes each year and is announced in advance. Many investors participate during this hour, often using share trading apps, to mark the beginning of their financial year with positive investments. Being aware of share market timings in India is vital to earn profits, especially if you pursueintraday trading. All you need is anonline Demat accountandtrading accountto get started on your journey of trading or investing in the share market. You can open an online Demat and trading account with any one of the many depository participants in India. Invest wise with Expert advice By continuing, I accept theT&Cand agree to receive communication on Whatsapp The trading market close time each day is at half past three in the afternoon, during regular sessions running from Monday to Friday. The Indian share market trading time is from 9:15 AM to 3:30 PM, Monday to Friday. There is also a pre-opening session from 9:00 AM to 9:15 AM. The right time depends on the economy and your financial goals. It’s best to research or ask a financial expert before investing. Yes, the market timings are the same for both NSE and BSE. You can trade on both exchanges during the same hours. Yes, you can place orders after hours. They will be carried out when the market opens the next day. No, trading is closed on Saturdays, Sundays, and public holidays. You can only trade on weekdays. Invest wise with Expert advice By continuing, I accept theT&Cand agree to receive communication on Whatsapp Invest wise with Expert advice By continuing, I accept theT&Cand agree to receive communication on Whatsapp IIFL Customer Care Number(Gold/NCD/NBFC/Insurance/NPS)1860-267-3000/7039-050-000 IIFL Capital Services Support WhatsApp Number+91 9892691696 Wednesday, 1 October 2025, 4:02:16 PM 2025, IIFL Capital Services Ltd. All Rights Reserved IIFL Capital Services Limited - Stock Broker SEBI Regn. No: INZ000164132, PMS SEBI Regn. No: INP000002213,IA SEBI Regn. No: INA000000623, SEBI RA Regn. No: INH000000248, DP SEBI Reg. No. IN-DP-185-2016, BSE Enlistment Number (RA): 5016ARN NO : 47791 (AMFI Registered Mutual Fund Distributor) This Certificate Demonstrates That IIFL As An Organization Has Defined And Put In Place Best-Practice Information Security Processes.",
    "url": "https://www.indiainfoline.com/knowledge-center/share-market/share-market-timings-in-india",
    "original_url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPTUlSTWUzTGV3SWhSRDYtdzdTR0VrcG9zQloxTWZhdGNxRGRVSS1Xczk0dEhlcTNOZndyelFTdjlkLWM3OEQ2M3JSZGdxLVdIaHRkQUdERUtEa21FanhXMldaUHp1QUhPaUMzclVDczI0NkZkZVpodEh3ZkR2UjQ3Tkw0VGVCc0tGUmltbzZaeVBURm8?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7587,
    "word_count": 1262,
    "gnews_title": "Share Market Timing in India: NSE & BSE Opening & Closing Time - India Infoline",
    "published_date": "26/09/2025",
    "publisher": "India Infoline",
    "topic": "NSE India trading"
  },
  {
    "title": "Is the Indian stock market closed today for Eid-e-Milad-un-Nabi?",
    "body": "Stock market holiday:As Eid-e-Milad, which marks the birth anniversary of Prophet Muhammad, is being celebrated today, September 5, investors may get confused whether the Indian stock market will be open or closed for trading. According to thestock market holiday calendarshared by the National Stock Exchange (NSE) and BSE, trading activities on the BSE and NSE will remain open today, which means today is not a stock market holiday. The Indian stock market will be open for trading during for regular trading on Friday. As per the calendar,in the month of September, there are no additional holidaysapart from the weekends. Considering that, the Indian stock market will be closed for trading on eight days in September. The next stock market holiday will now fall in the month of October. According to the stock market holiday calendar, NSE and BSE will remain closed for trading for five days during the week over the next three months. In October, the stock market will be closed for trading on three days. The first holiday in October will fall on October 2 for Dussehra and Gandhi Jayanti. Thereafter, BSE and NSE will be closed for trading on October 21 and October 22 for Diwali Laxmi Pujan and Balipratipada. Meanwhile, in November and December, there is one market holiday each for Prakash Gurpurb Sri Guru Nanak Dev and Christmas, respectively. Here's a look at stock market holidays in the rest of 2025: The Indian benchmark indices, after a strong rally in early trade,ended on a flat note on Thursday, as losses in Reliance Industries and IT stocks weighed. While the Goods and Services Taxes (GST) Council approved a shift to a two-rate structure from the existing four and cut levies on everyday items, boosting auto and FMCG stocks, concerns around US tariffs lingered. The NSE Nifty 50 ended 0.08% higher at 24,734, and the BSE Sensex gained 0.19% to 80,718.01. In early trade, both indices had jumped 1.1%. \"In-line outcome of GST rationalisation and ongoing tariff threats from the US exerted a negative impact on the market today. Given that the US is India's largest export destination, accounting for 2.2% of the GDP, the repercussions are inevitable. Companies are exploring ways to maintain exports to their existing clients through strategies like cross-country billing and setting up manufacturing units abroad. However, exports are expected to slow down and hinder new growth opportunities,\" said Vinod Nair, Head of Research, Geojit Investments Limited. On the brighter side, the GST rate cut is expected to significantly boost domestic consumption demand, countering the adverse effects of diminished export competitiveness, he added. Disclaimer:This story is for educational purposes only. The views and recommendations expressed are those of individual analysts or broking firms, not Mint. We advise investors to consult with certified experts before making any investment decisions, as market conditions can change rapidly and circumstances may vary. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/is-tomorrow-a-stock-market-holiday-on-account-of-eidemilad-11756983664223.html",
    "original_url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOMXZaY3Vyd2dfcElNQXJmMkFxcUQwOVVfOVNTaEstTjdndDd0V05icmdnNThvTTY4bGF4YU1GRWdodzlMWGo2X255R01zZ0tUcUZRRlR3UFA5QWxyWmU0YXBGcG5aVGJtZV9EQlRFLVF0TGRESGJPZ0hIY1N6WW9QTFZ0YlNQY2dIYVZEakZNRWRWeW5zdnpqcm5lcVZIUE5OUUo4MExfcUlvQkszY01ybjNaR0h4YzJuMDlReDhWT281MTFwMjdv0gHMAUFVX3lxTE1SZFJGdjZ5T2xXRGdsUXdBbzBjS2xTelVCdGlGQ0JtckdmbGQ0UDlUbzBoNTNvZFY1M2pnRlY1Ujc4WkVqRklNN3Z6d2N2LVFOdloybEFFSkdhaU1PRXpDUXVYVmwwM3hYNkFkaVNNdzRvLW9sVHlJSkVFVWJ1Ync5UE91dmcxbzIzencyZE9GM0dyZmY1dE5VeVlMTWpkOWZJN3l0b2lrdFdVQU44Z05LNS1GZUlfcGRDNmFRWjhaU2hxbzdwRDVBbGFydg?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3206,
    "word_count": 508,
    "gnews_title": "Is the Indian stock market closed today for Eid-e-Milad-un-Nabi? - Mint",
    "published_date": "05/09/2025",
    "publisher": "Mint",
    "topic": "NSE India trading"
  },
  {
    "title": "Closing Bell: Sensex drops 600 pts from day's high, Nifty slips below 24,600 on first Tuesday expiry",
    "body": "September 02, 2025·15:30 IST Closing Bell | The market reversed course after a strong start, with the Nifty slipping below 24,600 and giving up nearly 200 points from the day’s high. While the midcap index pared some gains, it still managed to end in the green. Market breadth stayed positive with an NSE advance-decline ratio of 2:1. September 02, 2025·15:51 IST Market Close | Sensex, Nifty reverse gear after early rally What started as a strong session turned into a sharp reversal, with the Nifty closing below 24,600 after shedding nearly 200 points from the day’s high. Midcaps cooled off but still ended in positive territory, thanks to a broadly upbeat market breadth reflected in a 2:1 advance-decline ratio on the NSE. Gains in FMCG, metals, PSU banks, and realty helped cushion the fall, even as autos, pharma, and IT stocks came under pressure. We wrap up today's edition of the Moneycontrol live market blog, and will be back tomorrow morning with all the latest updates and alerts. Please visit https://www.moneycontrol.com/markets/global-indices for all the global market action. September 02, 2025·15:48 IST Market remains in a sell-on-rise mode until it moves back above 24,850: Rupak De, Senior Technical Analyst at LKP Securities September 02, 2025·15:45 IST Domestic equities reversed early gains amid F&O expiry: Vinod Nair, Head of Research, Geojit Investments September 02, 2025·15:40 IST Closing Bell | Nifty FMCG index top sectoral performer of the day September 02, 2025·15:36 IST Closing Bell | Broader markets underperform benchmarks September 02, 2025·15:33 IST Closing Bell | Power Grid, NTPC top gainers on BSE Sensex; Kotak Mahindra, ICICI Bank top drags September 02, 2025·15:30 IST Closing Bell | Sensex drops 600 pts from day's high, Nifty slips below 24,600 on first Tuesday expiry The market reversed course after a strong start, with the Nifty slipping below 24,600 and giving up nearly 200 points from the day’s high. While the midcap index pared some gains, it still managed to end in the green. Market breadth stayed positive with an NSE advance-decline ratio of 2:1. September 02, 2025·15:25 IST M&M, Tata Motors shares fall up to 2% amid buzz of GST hike on EVs priced from Rs 20-40 lakh The tax panel has proposed to increase the GST rate to 18 percent from the current 5 percent for EVs priced between Rs 20 lakh and Rs 40 lakh, Reuters reported....Read More September 02, 2025·15:19 IST Stock Market LIVE Updates | Sinclairs Hotels unveils heritage style resort in Udaipur September 02, 2025·15:10 IST BEML, Cochin Shipyard, other defence stocks surge up to 5%: Key triggers at play The sharp rise in the share prices pushed the Nifty India Defence index up 1.6% in the afternoon. ...Read More September 02, 2025·15:02 IST Markets@3 | Sensex down 200 pts, Nifty slips below 24,600 amid expiry related swings At 15:01 hrs IST, the Sensex was down 199.42 points or 0.25 percent at 80,165.07, and the Nifty was down 46.45 points or 0.19 percent at 24,578.60. About 2271 shares advanced, 1466 shares declined, and 112 shares unchanged. September 02, 2025·14:59 IST Stock Market LIVE Updates | Landmark Cars expands footprint in Hyderabad, fortifies pact with M&M September 02, 2025·14:52 IST Sensex down 700 pts from day's high, Nifty below 24,550: Weak global cues, other reasons behind sharp market fall Profit booking and Nifty weekly expiry also weighed on the investor sentiment during the afternoon trade of September 2...Read More September 02, 2025·14:46 IST Stock Market LIVE Updates | Price shockers of past 3 days: Agni Green, Pritish Nandy, Rajshree Sugars September 02, 2025·14:37 IST GST Diwali Dhamaka: 2-slab tax model, rate tweaks on agenda at Sept 3-4 meeting The meeting comes two weeks after Prime Minister Narendra Modi announced the big GST bonanza in his Independence Day speech from the iconic Red Fort...Read More September 02, 2025·14:30 IST Stock Market LIVE Updates | Nifty FMCG top sectoral performer; auto, pharma stocks sulk September 02, 2025·14:24 IST Stock Market LIVE Updates | RIL, Eternal, HDFC Bank most active stocks at this hour September 02, 2025·14:14 IST Gold rate today: Yellow metal extends bull run, check the latest prices in your city on September 2 Gold rate today: Gold's October contracts on the MCX opened at Rs 1,04,850 per 10 grams today, as against the previous close of Rs 1,04,785 per 10 grams....Read More September 02, 2025·14:07 IST Markets@2 | Sensex erases gains, down 200 pts, Nifty below 24,600; banking stocks drag At 14:05 hrs IST, the Sensex was down 243.51 points or 0.30 percent at 80,120.98, and the Nifty was down 62.95 points or 0.26 percent at 24,562.10. About 2207 shares advanced, 1489 shares declined, and 115 shares unchanged. September 02, 2025·13:57 IST Apollo Tyres, MRF, other tyre stocks rally up to 5% on hope of lower GST rates The Automotive Tyre Manufacturers Association asked the government not to treat it on par with luxury goods...Read More September 02, 2025·13:48 IST Nalco, DLF, other metal and real estate stocks rise up to 5%: Fed rate cut hopes, 4 other reasons behind rally The Nifty Metal index rose 1.3 percent to hover around 9,426, and the Nifty Realty index gained 1.33 percent to 891.50, as seen at 12.10 pm....Read More September 02, 2025·13:41 IST Sensex Today | Bata board approves introduction of a Voluntary Retirement Scheme for West Bengal unit September 02, 2025·13:33 IST Centre extends export obligation period in major relief for chemical exporters The Advance Authorization Scheme allows importers to bring in duty-free raw materials for export production without adhering to QCOs, which ensures seamless export operations....Read More September 02, 2025·13:24 IST Stock Market LIVE Updates | Banking sector weighs on Nifty 50 September 02, 2025·13:13 IST boAt IPO: SEBI approves confidential DRHP of parent Imagine Marketing boAt, known for its headphones and smart watches, confidentially filed for an IPO in April...Read More September 02, 2025·13:03 IST Stock Market LIVE Updates | Stocks at 52-week low September 02, 2025·13:02 IST Markets@1 | Sensex up 300 pts, Nifty above 24,700; Metal stocks lead rally At 13:01 hrs IST, the Sensex was up 340.77 points or 0.42 percent at 80,705.26, and the Nifty was up 110.25 points or 0.45 percent at 24,735.30. About 2546 shares advanced, 1131 shares declined, and 94 shares unchanged. September 02, 2025·12:46 IST Gold’s share in global reserves hits 30-year high amid weakening dollar Central banks boost gold holdings amid historic demand and waning dominance of the U.S. Dollar, with the momentum likely to continue....Read More September 02, 2025·12:34 IST Stock Market LIVE Updates | Most active stocks on the Nifty 500 index September 02, 2025·12:25 IST Nifty trades higher on first Tuesday expiry, Sensex gains while all sectors shine in green Investors should wait and watch for developments to unfold amid global uncertainties, noted experts, adding that investments can be focused on domestic consumption plays....Read More September 02, 2025·12:17 IST Stock Market LIVE Updates | Broader markets outperform September 02, 2025·12:05 IST Manappuram, IIFL Finance, other gold financier stocks rise up to 3% as precious metal hits lifetime high The rising gold prices bodes well for gold financiers, as it increases the value of the collateral while issuing loans, reducing the risk of default....Read More September 02, 2025·11:57 IST ITR filing: Can one claim tax rebate on short term capital gains manually for FY25? Some tax experts argue that since the law is currently on the taxpayer’s side, the 87A rebate can indeed be claimed manually for STCG. Others say not to include to avoid tax notices in future. ...Read More September 02, 2025·11:53 IST Peak XV Partners' Harshjit Sethi quits amid leadership churn He is the latest to quit after Shailesh Lakhani, Piyush Gupta and others left over the past year or so. ...Read More September 02, 2025·11:42 IST Sensex Today | Sun TV shares can rise 54% in three years, Avendus Spark says, banking on IPL turnaround September 02, 2025·11:36 IST Stock Market LIVE Updates | Stocks that have hit their 52-week high September 02, 2025·11:25 IST MC Exclusive: “Early success blindsides you”: Saurabh Mukherjea on mistakes, lessons learnt, and favourite Indian investors The founder of Marcellus reflects on how his investing approach has shifted over the past three years, after his early conviction in staying invested in high-priced, high-quality stocks came under pressure...Read More September 02, 2025·11:17 IST Stock Market LIVE Updates | Advances outpaces declines September 02, 2025·11:09 IST Sugar stocks rally up to 20% after govt allows ethanol production from sugarcane juice, molasses The government had restricted production of ethanol from sugarcane juice, syrup and all types of molasses in the current marketing year amid a drop in sugarcane supplies....Read More September 02, 2025·11:01 IST Markets@11 | Nifty above 24,700, Sensex up 400 pts September 02, 2025·10:58 IST Sensex Today| Rategain Travel introduces MCP Integration for booking engine September 02, 2025·10:49 IST Sensex Today| Tata Steel has 1.73 mln shares traded in a block September 02, 2025·10:43 IST Sensex Today| Mukka Proteins in pact to buy stake in Fabbco September 02, 2025·10:38 IST Sensex Today| Glenmark Pharma US to launch Eribulin Mesylate Injection September 02, 2025·10:23 IST Sugar stocks rally up to 12% after govt allows ethanol production from sugarcane juice, molasses The government had restricted production of ethanol from sugarcane juice, syrup and all types of molasses in the current marketing year amid a drop in sugarcane supplies....Read More September 02, 2025·10:14 IST Sensex Today| L&T Finance has 1.3 mn shares traded in block September 02, 2025·10:10 IST AB Capital appoints Vishakha Mulye as the MD and CEO for five years Vishakha has been credited for envisioning the ‘One ABC, One P&L’ strategy which has been central to Aditya Birla Capital’s transformative journey. ...Read More September 02, 2025·09:51 IST Rupee opens 5 paise higher at 88.15/USD despite US tariff uncertainty The dollar index, which measures the greenback’s strength against a basket of six major currencies, rose to 97.818 in morning trade from 97.771 at the previous close....Read More September 02, 2025·09:47 IST Sensex Today: Sugar Stocks Rally as Govt Lifts Curbs on Ethanol Production Sugar stocks surged as much as 12 percent after the government removed restrictions on ethanol production from sugarcane juice and sugar syrup. The move is part of India’s broader push to promote ethanol blending in fuel while safeguarding sugar supplies for domestic consumption. Shares of Balrampur Chini, Bajaj Hindusthan, Shree Renuka Sugars and Dhampur Sugar rallied sharply in response. September 02, 2025·09:38 IST Sensex Today| ADIA exits One MobiKwik Systems; sells entire 2.1% stake for Rs39 crore September 02, 2025·09:36 IST Sensex Today| Dr Agarwal's has 1.65 mln shares change hands in a block trade September 02, 2025·09:32 IST Sensex Today| Ola Electric has 0.6% of equity change hands in 18 block trades September 02, 2025·09:30 IST Sensex Today| Vertis Infra has 21.54 cr shares changed hands in 15 blocks September 02, 2025·09:28 IST Sensex Today| Eternal has 6.91 mln shares traded in block September 02, 2025·09:25 IST Sensex Today: Reliance Seen as Key Winner From China’s Industrial Reforms: Morgan Stanley Reliance Industries Ltd. is poised to gain the most from China’s efforts to curb overcapacity across several industries, alongside its own streamlining initiatives, Morgan Stanley said in a note dated September 1. Analysts led by Mayank Maheshwari highlighted that billionaire Mukesh Ambani’s conglomerate stands as “the largest beneficiary of China’s anti-involution focus across energy and solar supply chains.” The brokerage retained its overweight rating on the stock and raised its 12-month price target to Rs 1,701 from Rs 1,602, signaling a potential upside of 26 percent from Monday’s close. September 02, 2025·09:20 IST Sensex Today| Markets Open Higher; Reliance Leads Early Gains Indian markets opened marginally higher on Tuesday. The Sensex rose 0.18 percent, or 142 points, to 80,500, while the Nifty advanced 0.18 percent, or 40.4 points, to 24,666.95. Among the top gainers, Reliance Industries climbed 1.5 percent, followed by Eternal and Bajaj Finance, which gained 1.1 percent and 0.7 percent, respectively. September 02, 2025·08:58 IST Sensex Today| Views from VK Vijayakumar, Chief Investment Strategist, Geojit Investments Global geopolitics and power equations are changing at a fast and furious pace. India-US relations have deteriorated and normalcy appears difficult in the near future. More actions from the unpredictable US administration are likely. The consequences on the Indian economy and markets cannot be ascertained now. Investors should wait and watch for developments to unfold. Meanwhile, investments can be focused on domestic consumption plays which are on sound footing. There are clear signs of the Indian economy bouncing back as reflected in the Q1 GDP numbers. September 02, 2025·08:52 IST Currency Check| Rupee views by Anil Kumar Bhansali Head of Treasury and Executive Director Finrex Treasury Advisors LLP Indian rupee fell to 88.33 its lowest till date yesterday but recovered and closed flat due to probable RBI intervention. The opening today is at 88.14 while generally the market looks biddish on the dollar till the closing is below 87.95. RBI is presently the only supplier in the market while we await for IPOs and other big inflows to come in to protect the rupee from further depreciation and take it higher. For the present dips have to be bought while exporters who have sold may wait for higher levels to further sell or let it stop out below 87.95. September 02, 2025·08:51 IST Sensex Today| Views from Darshan Desai, CEO Aspect Bullion & Refinery Gold prices hit a record high on continued expectations of a U.S. Federal Reserve rate cut and ongoing weakness in the U.S. dollar. Steady inflows into precious metal ETFs and sustained central bank purchases are helping prevent any significant downward correction, even in the absence of strong immediate catalysts. Notably, central banks now hold more gold than U.S. Treasuries for the first time in three decades, which underscores the continued demand. Unless a major negative event emerges, gold prices are likely to stay elevated. September 02, 2025·08:49 IST Nestle ousts CEO over office affair and taps Nespresso boss The named Philipp Navratil, who heads the Nespresso coffee brand, as his replacement....Read More September 02, 2025·08:38 IST SEBI re-introduces intraday limits for Index Options trading from October 1, with stricter monitoring SEBI aims to ensure that India’s derivatives market, one of the largest and most active in the world, continues to grow on a foundation of robust risk management and transparent regulation....Read More September 02, 2025·08:30 IST Gold, silver ETFs surge on hopes of Fed rate cut; momentum likely to continue amid festival season Among gold ETFs, Nippon India Gold BeES rose 1.49 percent to Rs 86.61, while HDFC Gold ETF advanced 1.59 percent to Rs 89.43. SBI Gold ETF and ICICI Prudential Gold ETF gained 1.67 percent and 1.77 percent, respectively. ...Read More September 02, 2025·08:23 IST Trade setup for September 2: Top 15 things to know before the opening bells The Nifty 50 reached close to the 100-day EMA (24,630), which is crucial for a further upward move toward the 24,700–24,800 levels. Sustaining above this level can drive the index toward the 25,000 mark. However, a decisive fall below the 24,420 level could open the door for a retest of the August low of 24,330, according to experts....Read More September 02, 2025·08:18 IST Global Markets| Crude Oil Climbs; WTI Gains Over 1.5% Oil prices firmed on Tuesday, with Brent up 0.56 per cent at USD 68.53 a barrel and WTI gaining 1.58 per cent to USD 65.02. September 02, 2025·08:16 IST GLOBAL CUES| Gift Nifty signals gap up start #1 Asia markets mostly rise as investors assess SCO summit amid new tariff concerns #2 GIFT Nifty signals gap up start #3 US futures trade mixed #4 U.S. markets were closed for Labor Day holiday #5 Gold rises; silver hits 14- year high #6 Oil higher amid worries over rising output September 02, 2025·08:14 IST Global Markets| Tariff Uncertainty Keeps Asia-Pacific Markets in Check Asia-Pacific markets traded mixed on Tuesday as investors weighed the Shanghai Cooperation Organisation summit and a US court ruling that struck down most Trump-era tariffs. Japan’s Nikkei 225 rose 0.31 per cent, South Korea’s Kospi gained 0.45 per cent and China’s Shanghai Composite inched up 0.04 per cent, while Australia’s S&P/ASX 200 slipped 0.41 per cent. September 02, 2025·08:13 IST Markets on Monday| Sensex ended 600 pts higher, Nifty near 24,650; Auto, IT, metals shine At Monday close, the Sensex was up 568.09 points or 0.71 percent at 80,377.74, and the Nifty was up 198.25 points or 0.81 percent at 24,625.10. About 2681 shares advanced, 1,320 shares declined, and 173 shares were unchanged. September 02, 2025·08:05 IST Good morning and welcome to the live coverage of all the action from D-Street. Stay tuned to this blog for all live updates from the market in India and around the world. You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/stock-market-live-updates-gift-nifty-hints-a-positive-start-asian-markets-trades-high-liveblog-13510143.html",
    "original_url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNZlVBT2dpMGptTDh6SXB3SmhuRmx1THNEbDVaSWN3VFZ4YzFac1ZRZU9zVGphLXlzSUJXczhTMXgtbTgxOHZFb3paU3ZUanRNUmdQTEZXSTBVTmpjYnNXaW9Pd1VieGpVQlBxQ1BwYXBDMzJYZHcxeTdMelByT3lJX1h6a0VIRUhuaGhNZlZqOTA2NHplY1ZyM1N4eU9tVFRyMVJ4X2w0cVdYZ2F5ZzdDVnVzUkYxVkRWQ2FwLXRJN21fUjNFOG90bWNWXzVxWENvY2djSE5oQjFwNWx5SU16MlJnSGJHNjdaY0p6YTV6TjPSAfYBQVVfeXFMTllSbVJkaDJWMmVNTjJRUFNjUlg4a2VTNW5XczM5RldlU2NEVWkxTThlWGRQYUE5RFBOcTdxcW5XcUJqS3dZbXBFVWhtUGxaV1JHVkFBUm8ySUkzSklZTmhpNEl0Tl93S3hLdHFfa0cxVUtLSzJqWEpucnlPNEdvUXBwTGZJa1N3YjZwRnFlTUxTanFpU0p1ZlZuVlNfY2sxblhIMjJiS3dBYXRDUmdZeTBoVmp5akl0ejFDWWNhcTd0eTdDUE5zbkNFZldjUXU4ekNLSFo1MGVydk1FdGN0THBMSXlMak9XU3R3SGJHeWZVTzVFdzFB?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 17469,
    "word_count": 2796,
    "gnews_title": "Closing Bell: Sensex drops 600 pts from day's high, Nifty slips below 24,600 on first Tuesday expiry - Moneycontrol",
    "published_date": "02/09/2025",
    "publisher": "Moneycontrol",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock market highlights: Sensex ends 555pts up, Nifty at 24,625; SMIDs, Auto, Consumer Durables gain",
    "body": "Stock market close highlights: On the BSE, M&M, Tata Motors and Trent were the top gainers while Sun Pharma, ITC and Hindustan Unilever were among the major laggards. Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published: Sep 01 2025 | 7:59 AM IST MPC outcome: RBI keeps repo rate unchanged at 5.5%, revises real GDP forecast to 6.8% Trump-Netanyahu meeting: Trump’s 20-point Gaza peace plan explained | Israel-Hamas | Gaza war Quantum, AI & beyond: How IBM sees the Future of Business | TechTalk with Pranjal Sharma Bihar final electoral roll, Rahul Gandhi on Ladakh violence, Balochistan bomb blast & more",
    "url": "https://www.business-standard.com/markets/news/stock-market-live-updates-september-1-nse-bse-sensex-today-nifty-ril-shares-india-china-talk-trump-tariffs-gst-meet-125090100061_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMijwJBVV95cUxPZkJpYVpqdUFYRDlJZEIyNzJKYUhUVlZBTTVwd0I4cDk0aHlkc2tNWC1xQkp2WnktYmdnMF9pYWlXN0hUMmNlbk9fTFZyWUlWUXJxUHNJclJ2NnpTUWlUUkxSQS1jeGk3dzFnM1hMaXF3dGhFZjQ2aFhac0ROQzcxVUlSNEpuRi1LWXZBRlkwalpxdGR6ZFNpR29tajk2aFNaTzZoUXRaeGlPZXBKM2VkUTBUX0FLQW10N0o2dU1NU1VMT1pXaHYxMFNCS3NxODV6NUhlTDNiYXgyOEZ2R0hLOUp1eVltMDVZaE1OLW1kQ1FOVWhLOUxWZy1YWFdWdU1FdXNuQ0N4X015eXNYSHlN0gGUAkFVX3lxTFBHZGtkY28wU3BuVmhyQy0xQXdER2tjMVI1M0JWMXgtVl8tR3h2WUczbnVSRTFDUnljMVFkam1DbUE3VTBJNVEtZHZIR0pmMkdpVXRqMXBMaDMtaU9NdFotUWlJWTRFaXNOblFsTU5IN3M0N2ZSOS1KSTV1RlJSUzVZR2hFaVhHaEwyaUhELUlMZnhGMDNaWkJ5THVwbnJuUXpTaXJCbmNaT3BrMVptM0Z4M2lMNFg3OWtBWG9TaTZka0dOYXlaYWhBa2k5aWd6Q21sdHNvekVhemo1UzRyZ2xfbmFCdE1OUFJyMFpaekZuZ2tuZUdFRFg1U3ZqNnFhQXA0aGJYc1FVaGpwVFRCTGpNX0c0Zw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 658,
    "word_count": 111,
    "gnews_title": "Stock market highlights: Sensex ends 555pts up, Nifty at 24,625; SMIDs, Auto, Consumer Durables gain - Business Standard",
    "published_date": "01/09/2025",
    "publisher": "Business Standard",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Update: Is There Trading On NSE, BSE This Monday, September 8? Check",
    "body": "Both NSE and BSE will remain open on September 8, with trading beginning as usual at 9:15 AM, unaffected by the festive celebrations. New Delhi:India’s festive season kicked off in September with Eid-e-Milad and Onam being celebrated across different parts of the country. Despite the festivities, stock market operations have continued without disruption. However, a bit of confusion did arise among traders and investors over whether the markets would remain open on September 8, after the RBI shifted the earlier-declared money market holiday from September 5 to September 8. Both NSE and BSE will remain open on September 8, with trading beginning as usual at 9:15 AM, unaffected by the festive celebrations. Add Zee News as a Preferred Source Yes, but only the money market. The Maharashtra government has shifted the money market holiday from September 5 to September 8, which was earlier aligned with Eid-e-Milad. This change was made to keep settlement cycles smooth on September 5. However, equity markets will remain unaffected. Trading will continue as usual on September 8 and on all other weekdays for the rest of September 2025. (Also Read: Notification On Handling Goods Stocked Under Higher GST Slabs Soon) Because of the Eid-e-Milad settlement holiday on September 8, mutual fund transactions will see slight changes in processing. Any purchase or redemption requests made after the cut-off time on September 5 in liquid or debt schemes will now be processed on September 9. Transactions like allotments and redemptions set for September 8 will be settled a day later, on September 9. The only exception is equity schemes, which will be processed as usual on September 8. Redemption fund payouts, however, will not take place on September 5 or September 8. (Also Read: Govt Launches Angikaar 2025 Campaign Under Pradhan Mantri Awas Yojana Urban 2.0) - October 2 – Markets closed for Gandhi Jayanti. - No separate holiday for Dussehra, since it also falls on October 2 this year. - October 22 – Markets closed the day after Diwali, as per the usual schedule. In the last two months of 2025, markets will close on two occasions. November 5 will be a holiday to mark Guru Nanak’s Birthday, and on December 25, trading will remain shut for Christmas. Christmas is one of the rare days when stock markets across the globe also stay closed. Just like every year, a special Muhurat Trading session will be held on Diwali day, October 21, 2025. The session will run for one hour, from 6:15 PM to 7:15 PM, during the auspicious time of Lakshmi Puja. Though largely symbolic, Muhurat Trading is considered a lucky time to invest, and many traders and investors participate to mark the beginning of a prosperous year. Stay informed on all thelatest news, real-timebreaking newsupdates, and follow all the important headlines inindia newsandworld Newson Zee News. Anupama Jha is a dedicated and passionate journalist specialising in the business section. With a keen eye for detail and a deep understanding of the financial world, she helps readers navigate the... Read more By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts",
    "url": "https://zeenews.india.com/economy/stock-market-update-is-there-trading-on-nse-bse-this-monday-september-8-check-2955994.html",
    "original_url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQaGhzZU1oV2lzTk1xZ1UzQ3pmSDhCcTJ2TEh6dkJ0YnExNXBmVVluYkZNcnlPTi1zY09IbE9ub3BTN0ZEc0pyQ0NoQmpjOHhvamFtT3BCQWJjSTN6WWd3bGFSWFBSajZtdmtqYUJPTzhQdEQwNzlFV1JLREJoc2ItX3ZGZWtqTVl4V2RqY3E0THdqbEU0NWFOcWFDMGl1dW5GTDVvQlVId3NVVFBBX2gzY1RyMnNBTkVZTm03S0hfMjUwUdIBxwFBVV95cUxORDNNbS1ibDBmRG1zUm9kbEN4REhEM0Z0VzJCZ1A0bHJNU3d6Tk9YQUpiZ1lLa0RTV0xpakNPNEhwRDQ3TW5oeVJselJjYXBJRU5XLWZuQzBPTzZZR1RNSTdiYklWSl9VN2tJZXJVczRGRXBWbUdxRG9IbnRibzR2ZFVYZlhHYTA5aEV5Z1Bjcmd0aGJ6dGF2TWx6dE82aUtoeS1RV1dlWjZFZnI3NEdwQ2hiVnBaMUdCNG1QTTFFMC1kalB2dUVR?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3248,
    "word_count": 533,
    "gnews_title": "Stock Market Update: Is There Trading On NSE, BSE This Monday, September 8? Check - Zee News",
    "published_date": "05/09/2025",
    "publisher": "Zee News",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Holiday: Are BSE, NSE open or closed today for Eid-e-Milad 2025?",
    "body": "ETMarkets.com Indian stock exchanges will operate as usual today, September 5, despite the observance of Milad-Un-Nabi. Trading follows a fixed holiday calendar, and Milad-Un-Nabi is not listed as a full-day market holiday. The commodity segment will also remain open, with no break in either the morning or afternoon sessions. Also known as Eid-e-Milad, the day marks the birth anniversary of Prophet Muhammad, the founder of Islam. It is observed in the third month of the Islamic calendar, Rabi-ul-Awwal. However, today will be a settlement holiday , meaning that settlement and transactions carried out on Thursday will be shifted to Monday. What is a settlement holiday? Unlike a trading holiday, when the stock exchanges NSE and BSE are shut and investors cannot buy or sell shares, on a settlement holiday the exchanges remain open for trading, but clearing and settlement of trades do not take place because banks, depositories such as NSDL and CDSL , or the RBI are closed. In simpler terms, trades get executed, but the pay-in and pay-out of funds and securities are deferred to the next working day. Stock market holidays 2025: Full list Equity markets have a total of 15 trading holidays in 2025, of which 10 have already passed. The remaining 5 are for Mahatma Gandhi Jayanti and Dussehra on October 02, Diwali or Laxmi Pujan on October 21, Diwali Balipratipada on October 22, Prakash Gurpurab on November 05, and Christmas on December 25. It should be noted that a special Muhurat Trading session will be conducted on October 21, which marks the beginning of the Hindu Samvat year. The timings of Muhurat Trading have not yet been announced and will be notified in due course. Stock market outlook Indian markets received a big boost from the government following the simplification of the GST regime. Various goods and services will now be taxed under two key rates—5% and 18%—with certain sin and luxury goods placed under a special 40% slab. However, the markets did not reflect much enthusiasm on Thursday as most of the news was already priced in. Benchmark indices experienced a choppy trading session, ending with marginal gains. The broader markets underperformed the benchmarks, with the Nifty Midcap 100 and Smallcap 100 indices declining by 0.6% each, reflecting a risk-off sentiment among investors toward non-index constituents. Overall, analysts expect Nifty to consolidate in the range of 24,400-25,000 amid stock-specific actions. \"Immediate support is placed at 24,400-24,337 levels, being the confluence of recent lows and the key retracement area. A breach below this range will signal an acceleration of the decline toward the key support area of 24,000-23,800 levels in the coming week,\" Bajaj Broking said in a note. (Disclaimer: Recommendations, suggestions, views, and opinions given by the experts are their own. These do not represent the views of The Economic Times) Add as a Reliable and Trusted News Source Add Now! (You can now subscribe to our ETMarkets WhatsApp channel ) ( Originally published on Sep 04, 2025 ) Read More News on nse bse settlement holiday nifty gst reforms nsdl cdsl (What's moving Sensex and Nifty Track latest market news , stock tips , Budget 2025 , Share Market on Budget 2025 and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today . Top Trending Stocks: SBI Share Price , Axis Bank Share Price , HDFC Bank Share Price , Infosys Share Price , Wipro Share Price , NTPC Share Price ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Maruti’s 2nd attempt to dislodge Hyundai in UVs; but is it easy? Why efficiency is eroding capitalism, not boosting it INR10 lakh crore value unlocked. Who made the most of startup IPOs? Accenture job cuts flash a warning for Indian IT employees Stock Radar: This largecap Sensex stock trading in broadening formation; check target & stop loss Buy, Sell or Hold: Morgan Stanley remains overweight on Kotak Bank; Nomura recommends buy on HUL 1 2 3 View all Stories",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-are-bse-nse-open-or-closed-tomorrow-for-milad-un-nabi-2025/articleshow/123698930.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNazgyaXk1My15SnhxSFhyVzhsNnlGRm1JSV96UV82UXZ2ODRubDcyV1IzTGNHa1dwY1N6ajJHQzlwUVVTSHRZbGRXMFJqZ1d3WlhWbkZ0MVhTT3hZNXhWbDlJYkJlWWNNRFB2Y1hNZTE1cnJwVzFsTnJKQnpVV05tbU1Rbk5EWTloc2tCUGQ4ZWJscFJ1V2JiV093VWNpN2huZFVtekYzRTRoQUVwWU42Zm9KX0tUMHdMUEV4dy1BSFI2RXJyMzk0RXQtSWxYNG4xdjhpajBPQ3lyR2hjSnVFRHVBMWxfQzQ50gHuAUFVX3lxTE03dHJkVmx5NmJCdHFkVEVfNEg1eGo5czZaY1JiczhES09xV2NzNXZIUnFHRzRydkVrZk9lcUt5ck1aSUJUY3NNWVpTM3Z1NjJfeUpxbEE2VG5ScVBUNFdFbDd5c3c4aFl0STlTT0VZd05rNC1HQURKeGlsSWRfT2hSLVJpSkNQNUxtcGV2UktvSnAzU3Vyc2NUc0Q4UnFCcDkySGZCZ1h6RHhIQnVUbXdjaERlcXBwTlhYYnkwbkVVVEpsSUdOMGVzSjMwbWJicHE0NE9rdkVrVjhiOVJIa0JicTJRZzFiaEs0LXRoZmc?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4223,
    "word_count": 695,
    "gnews_title": "Stock Market Holiday: Are BSE, NSE open or closed today for Eid-e-Milad 2025? - The Economic Times",
    "published_date": "05/09/2025",
    "publisher": "The Economic Times",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE, BSE To Conduct 1-Hour Diwali Special Trading On October 21",
    "body": "NSE, BSE To Conduct 1-Hour Diwali Special Trading On October 21 The symbolic trading session will be held between 1:45 pm and 2:45 pm, the stock exchanges said in separate circulars. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email Last year, the special Muhurat trading session was held from 6 pm to 7 pm. New Delhi: Stock exchanges NSE and BSE will conduct a special Muhurat trading session on Tuesday, October 21, to mark the festival of Diwali, the bourses announced on Monday. The symbolic trading session will be held between 1:45 pm and 2:45 pm, the stock exchanges said in separate circulars. Last year, the special Muhurat trading session was held from 6 pm to 7 pm. The new session also marks the beginning of a new Samvat (Vikram Samvat 2082) -- the Hindu calendar year that starts on Diwali -- and it is believed that trading during the 'Muhurat' or auspicious hour brings prosperity and financial growth for the stakeholders. The market will remain closed for regular trading on Diwali, but a special trading window will be open for one hour. The exchange announced that the pre-opening session will take place from 1:30 pm to 1.45 pm. Market analysts noted that Diwali is considered an auspicious occasion to begin new ventures, and many investors believe participating in the Muhurat trading session brings prosperity throughout the year. However, with the trading window limited to just an hour, the markets often witness heightened volatility. Analysts added that the significance of the session lies more in its symbolic value than in immediate profitability. Trading would take place across various segments like equity, commodity derivatives, currency derivatives, equity futures & options, and securities lending & borrowing (SLB) in the same time slot, according to separate circulars issued by the bourses. Add NDTV As A Trusted Source (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Diwali Muhurat Trading 2025 , Diwali Muhurat Trading , Diwali Stock Markets",
    "url": "https://www.ndtv.com/india-news/nse-bse-to-conduct-1-hour-diwali-special-trading-on-october-21-9323332",
    "original_url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOSU1aaFV4bmNlT3MxNzE5RURXak5Pd091TnE3eVByUE1QWXhxVFctWHZDTzc2dGZUNm50VE1EYWJtT2VGZ05tN05HYmJxTkFDQXhyMjl0UFFLLWh6b2VxZXFzOVlnTWR2Nm5jTFc4YW5vYzFubVFESHRDTEhpT0pTWFFSUy1jMVViODJ0OTlIUWg0M0tabTlHc2hzTkpiN0FhQXc2YtIBrAFBVV95cUxPWDJJTll6OWhNUkxrMjdQeUtpLVcwV1BfaUl0R0JzV3ctNHVnUkc2VmNrX0RnR0sxck41bzZMbmRHTk5zbDdLbUxuT281UmNQUTllWlB0X0laNGFVd0hjVW82aS11aHdZcWNYRzBiaWFYUy1HZFRaWENGQ2lDYXJXS3ZjdVFvdlVmblMyZWQyekhPdjZxMVRQdmc5MjdPQS1yTlZEcFZqNzZNQl8t?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2178,
    "word_count": 359,
    "gnews_title": "NSE, BSE To Conduct 1-Hour Diwali Special Trading On October 21 - NDTV",
    "published_date": "22/09/2025",
    "publisher": "NDTV",
    "topic": "NSE India trading"
  },
  {
    "title": "Number of companies listed in NSE and BSE across India FY 2008-2025",
    "body": "In financial year 2025, a total of ********** Log in or register to access precise data. Get access now companies were listed in the National Stock Exchange (NSE) and the Bombay Stock Exchange (BSE) across India. This was an increase compared to the previous year. Read more Show all numbers Log in or register to access precise data. Advertisement Advertisement",
    "url": "https://www.statista.com/statistics/731969/india-number-of-companies-listed-in-nse-and-bse/",
    "original_url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNTmlLWXp3YXJlQXB2QWJQaUFmR2o3bmNQSGpFRU9uVGxxVk1MZkFXY2RUcjJFVkJud1ZQMHFIYTZpTXNQVEUxSy1JZ05RdzhMWjhMVnNWY1BTa3NFdHd1NVBjQjNVOGEwcnBSR0FYaXdVZ05yZXFuTWV4Z1BEZlNKM2ZTQXNKa2xVS01vbmFCTkIzemU0ZVE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 362,
    "word_count": 60,
    "gnews_title": "Number of companies listed in NSE and BSE across India FY 2008-2025 - Statista",
    "published_date": "11/09/2025",
    "publisher": "Statista",
    "topic": "NSE India trading"
  },
  {
    "title": "Share Market Highlights 17th September 2025: Stock markets rally for 2nd day amid US trade talk optimism, Fed rate cut hopes",
    "body": "Financial growth of business was evident in investment graph, where an upward arrow on chart indicated increased profit, success. financial, growth, graph, investment, money, profit, business, arrow. istock photo for BL | Photo Credit: Jinda Noipho S tock Market today | Share Market Highlights - Find here all the highlights related to Sensex, Nifty, BSE, NSE, share prices and Indian stock markets for 17th September 2025. September 17, 2025 16:12 Indian Rupee Closing Figures: Rupee rises 25 paise to close at 87.84 against US dollar Rupee rises 25 paise to close at 87.84 against US dollar Indian rupee strengthens against US dollar on Fed rate cut hopes, positive equities, and US-India trade talks. September 17, 2025 15:47 Stock Market live today: Hyundai Motor India signs long-term wage settlement with official employees’ union Hyundai Motor India signs long-term wage settlement with official employees’ union Hyundai Motor India Ltd and UUHE sign a mutually beneficial wage settlement agreement for 2024-2027, setting new industry standards. September 17, 2025 15:47 Stock Market live today: Stainless steel maker Mangalam Worldwide set to migrate to NSE mainboard Stainless steel maker Mangalam Worldwide set to migrate to NSE mainboard Mangalam Worldwide transitions to NSE mainboard, emphasizing sustainable growth, global presence, and integrated stainless-steel manufacturing. September 17, 2025 15:42 Stock Market Closing Bell: Sensex climbs 313.02 points to settle at 82,693.71; Nifty up 91.15 points to 25,330.25 September 17, 2025 15:41 Stock Market live today: TVS ILP’s facility in Hosur gearing up to meet festive season demand for Ather TVS ILP’s facility in Hosur gearing up to meet festive season demand for Ather TVS ILP supports brands during festive season with Grade-A BTS facilities, boosting EV sales and streamlining distribution. September 17, 2025 15:36 Stock Market live today: LIC has informed that Jaideep Chaudhuri, Vice Principal, Zonal Training Centre, Jamshedpur has been re-designated as Principal, Zonal Training Centre, Jamshedpur September 17, 2025 15:28 Stock Market live today: US Fed rate cut: How will it impact Indian stock market? US Fed rate cut: How 25 vs 50 bps cut will impact Indian stock market? Market participants are closely watching the outcome of the US Fed’s policy meeting today, September 17, 2025. The domestic market has been buoyed by optimism over India-US bilateral trade talks, amid other global and domestic cues. September 17, 2025 15:20 Stock Market live today: Standard Scigenics Private Limited has been formed as subsidiary company of Standard Glass Lining Technology September 17, 2025 15:19 Stock Market live today: JSW Steel board has approved the acquisition of M Res NSW, through the Company’s subsidiary JSW Steel board has approved the acquisition of additional economic interest in M Res NSW, through the Company’s wholly owned subsidiary JSW Steel (Netherlands) B.V. for an aggregate consideration of $60 Million. Stock traded at Rs 1,110.20 on the NSE September 17, 2025 15:16 Stock Market Live Updates: LTIMindtree partners with Shopify to launch an AI Commerce Center of Excellence. LTIMindtree traded flat on the NSE at Rs 5,420.50 September 17, 2025 15:10 Stock Market Live Updates: SBI completes divestment of 13.19% stake in Yes Bank to SMBC SBI completes divestment of 13.19% stake in Yes Bank to SMBC SBI receives ₹8,889 crore from Yes Bank divestment, boosting Q2FY26 income; SMBC acquires 13.19% stake in YBL. September 17, 2025 14:33 Stock Market Live Updates: TCS, Qualcomm to set up co-innovation lab in Bengaluru TCS, Qualcomm to set up co-innovation lab in Bengaluru TCS and Qualcomm partner to create innovative Edge AI solutions for various industries in Bengaluru lab. September 17, 2025 14:11 Stock Market Live Updates: Mangalam Worldwide secures NSE Main Board approval Mangalam Worldwide Limited (MWL), a fully integrated stainless-steel manufacturing company, has received final approval from the National Stock Exchange of India (NSE) for the transition of its equity shares on the Capital Market Segment (Main Board) of the exchange from its SME Platform (Emerge). The migration to the NSE Main Board will be effective from tomorrow i.e., September 18, 2025 September 17, 2025 14:09 Stock Market Live Updates: UGRO Capital board approved NCDs worth Rs 50 cr. Shares traded at Rs 171.07 on the NSE, down 1% September 17, 2025 14:09 Stock Market Live Updates: Avantel has received a maintenance contract worth of Rs.1.94 Crore Shares traded flat on the NSE at Rs 176.84 September 17, 2025 13:52 Stock Market Live Updates: L&T Finance launches festive two-wheeler loan schemes; offers No Cost EMI and prompt payment rebates L&T Finance Ltd. (LTF), one of the leading Non-Banking Financial Companies (NBFCs) in the country, has announced attractive loan offers for its Two- wheeler Finance customers. The Company has introduced three new offerings, namely, No Cost EMI, Prompt Payment Rebate, and the EMI Lite Festive (buy in 2025, pay in 2026) scheme aiming to provide a fillip to the festive buying spirit. Under the No Cost EMI scheme, customers can finance their purchase without incurring interest charges on the loan amount; the only associated fee is a nominal documentation charge. The Prompt Payment Rebate scheme is available to customers who select a minimum repayment tenure of 36 months, offering a waiver of the final EMI upon successfully repaying the EMIs for 35 months through central clearance. Finally, the EMI Lite Festive scheme allows customers to pay only the interest portion of their EMI for the first two months of the loan term, with no principal amount included in their monthly payment during this initial period, thus making it a buy in 2025 and pay in 2026, making festivals more affordable. Speaking about the new launches, Mr. Sudipta Roy, Managing Director and CEO at LTF, said, “With an advanced version of ‘Project Cyclops’ now live in our Two-wheeler Finance business and the revised GST slabs for bikes and scooters effective this month, we believe this is an opportune time to launch attractive schemes for our customers. Our Two-wheeler Finance business is one of the top three fulcrum products. As one of the leading financiers in this segment, having a prime-dominant portfolio and a best-in-class zero DPD (Days Past Due) record vis-à-vis the industry, we foresee that these offers will drive a substantial surge in demand and strengthen our leadership position.” Mr. Jinesh Shah, Chief Executive – Urban Secured Assets & Third-Party Products at LTF, said, “With over 75 lakh customers served in urban India, we have a profound understanding of the market’s needs. This allowed us to craft a spectacular array of enticing two-wheeler loan offerings that truly benefit our potential customers. Supported by our well- diversified footprint and a network of over 10,000 sourcing points, we are confident that customers will seize this exceptional opportunity to own a two-wheeler and fulfill their aspirations with us as their preferred financier. We anticipate a surge in demand for Two-wheelers given the strong support of lower GST by the government and we are ready for the increased customer inflow at our partner dealer outlets to help fulfill their dreams.” The festive schemes will be valid for customers availing loans until November 30, 2025. In addition, LTF has been offering the best interest rates to deserving customers and offers customers a quick turnaround time of 5 minutes to decide on a loan, aided by a best-in-class digital process wherein no documents are required physically from customers. The Company has also launched its latest TV commercial (TVC), ‘Just Zoom Two-wheeler Loans’, with the tagline ‘Bumrah Ki Speed Par,’ featuring its brand ambassador, Jasprit Bumrah. An Integrated Marketing Campaign (IMC) leveraging a mix of media buyouts will be launched across 13 markets in the country. September 17, 2025 13:39 Stock Market Live Updates: Power Grid wins bid for inter-state transmission project Power Grid Corporation of India has been declared as the successful bidder under Tariff Based Competitive Bidding to establish Inter-State Transmission System for the project namely “Inter-regional (NR-WR) Transmission System strengthening to relieve the loading of 765 kV Vindhyachal-Varanasi D/c line” on Build, Own, Operate and Transfer (BOOT) basis. Shares flat on the NSE at Rs 286.65. September 17, 2025 13:38 Stock Market Live Today: Pavna Industries inks MoU with Tamil Nadu Govt for auto-components facility Pavna Industries has signed a Memorandum of Understanding (MoU) with the Government of Tamil Nadu (GoTN) to set up a state-of-the-art auto-components manufacturing facility at the Future Mobility Park in Shoolagiri, Krishnagiri District, Tamil Nadu. Shares rose over 2% on the NSE to Rs 41.40 September 17, 2025 13:27 Share market live today: Akzo Nobel shares flat on the NSE at Rs 3,393.50. CCI approved JSW Paints acquisition of up to 75% shareholding in the company. September 17, 2025 13:27 Stock in focus: Vedanta shares rise nearly 2% to Rs 469.25 as NCLAT overturns NCLT’s rejection of Talwandi Sabo demerger scheme Vedanta shares up nearly 2% on the NSE to Rs 469.25. NCLAT has set aside NCLT order rejecting Talwandi Sabo demerger scheme. September 17, 2025 13:24 Stock in focus today: Premier Explosives stock climbs 9% to Rs 593.55 after Telangana board revokes factory closure order Premier Explosives stock rallied 9% on the NSE to Rs 593.55. Telangana Pollution Control Board revoked closure order for the company’s factory in Telangana. September 17, 2025 13:21 Share market live today: Marico shares decline 1% to Rs 715.05 amid Income Tax survey on tax evasion allegations. Marico shares down 1% on the NSE to Rs 715.05, following reports of Income Tax Department’ survey operation at various business premises of the Marico group on charges of tax evasion. September 17, 2025 13:15 Stock market live today: Lupin gets FDA approval for Lenalidomide Capsules, shares flat at Rs 2,056 Lupin has received approval from the United States Food and Drug Administration (U.S. FDA) for its Abbreviated New Drug Application for Lenalidomide Capsules, 2.5 mg, 5 mg, 10 mg, 15 mg, 20 mg and 25 mg. Shares flat on the NSE at Rs 2,056. September 17, 2025 13:14 Share market live today: Top gainers of defence index GRSE (+7%), Zen Tech (+5%), Data Patterns (+4.5%), Cochin Shipyard (+3.79%), Unimech (+3.76%) September 17, 2025 13:14 Stock in action: Markolines Pavement Technologies has received work order from its client NCC Limited. September 17, 2025 13:02 Corporate actions: Sarveshwar Foods’ Rights issue was oversubscribed by 1.35 times. September 17, 2025 13:00 Stock market live today: Knowledge Marine & Engineering approves equity shares and convertible warrants issuance worth Rs 284.80 cr Knowledge Marine & Engineering Work board has approved issuance of equity shares on preferential basis aggregating up to Rs 270 cr, and issuance of convertible warrants aggregating to Rs 14.80 cr. September 17, 2025 12:46 Stock market live today: Coal Ministry proposes regulator-led coal trading platforms Coal Ministry proposes Coal Exchange Rules 2025, regulator-led market oversight Draft Coal Exchange Rules 2025 propose regulator-led oversight by the Coal Controller to ensure transparency, prevent cartelisation, and boost competitive coal trade September 17, 2025 12:24 Stock in focus: State Bank of India divests stake in Yes Bank for Rs 8,888.97 crore; shares up over 1% to Rs 842.05 State Bank Of India has informed the Exchange about Divestment of stake in Yes Bank Limited (YBL) by State Bank of India (SBI) to Sumitomo Mitsui Banking Corporation (SMBC). The Bank has received Rs.8,888.97 crore from the acquirer. SBI shares rose over 1% on the NSE to Rs 842.05 September 17, 2025 12:24 Share market live today: TVS Motor Company integrates India’s first EV smartwatch, shares flat at Rs 3,515.60 TVS MOTOR COMPANY AND NOISE PIONEER INDIA’S FIRST EV SMARTWATCH INTEGRATION TVS Motor Company shares flat on the NSE at Rs 3,515.60 September 17, 2025 11:49 Stock market live today: Jyothy Labs launches ‘Dr. Wool’ liquid detergent, shares flat at Rs 325.20 Jyothy Labs has launched new product viz. ‘Dr. Wool’, Liquid Detergent, under its Fabric Care Category. Shares traded flat on the BSE at Rs 325.20 September 17, 2025 11:46 IPO Live today: Shringar House of Mangalsutra stock declined to Rs 185.30 on the NSE after listing at Rs 188.50 against the premium of Rs 165. September 17, 2025 11:46 Stock in news: AstraZeneca’s asthma drug fails main goal of COPD study September 17, 2025 11:45 Stock in focus: Dreamfolks stock drops 5% to Rs 131.07 after discontinuing airport lounge services in India Dreamfolks stock locked in lower circuit on the NSE at Rs 131.07, down 5%. It has discontinued airport lounge services in India. September 17, 2025 11:34 Technicals: Natural gas futures eyeing for trend reversal Natural gas futures eyeing for trend reversal Natural gas futures chart indicates potential bullish trend reversal with key resistance at ₹278, offering trading opportunities. September 17, 2025 11:30 Stock market live today: Coal India shares edge higher after securing ‘preferred bidder’ status Coal India shares traded at ₹399.75 on the NSE after opening at ₹402 against the previous close of ₹395.80. The company had been declared as Preferred Bidder by Ministry of Mines, Government of India for Ontillu- Chandragiri REE Exploration Block pursuant to NIT dated 30.03.2025 issued by the Ministry of Mines. September 17, 2025 11:26 Stock market live today: TCS and Qualcomm collaborate to develop AI-driven smart, sustainable capabilities for industries. TCS traded flat on the NSE at ₹3,174.60 September 17, 2025 11:22 Gold, silver drops from all-time highs, as investors lock in profits before Fed decision: Augmont’s Renisha Chainani Renisha Chainani, Head of Research at Augmont, writes:Gold and silver dropped from all-time highs, as investors locked in profits before the Federal Reserve’s policy decision. · US retail sales grew more than anticipated in August, according to data released on Tuesday. However, a deteriorating job market and tariff-driven price increases could jeopardise the strength of spending going forward. · Markets are pricing in roughly 67 basis points of rate easing by year-end, with the Fed likely to lower rates by 25 basis points later today. Powell has been urged by US President Donald Trump to implement a “bigger” rate cut. · The Fed’s quarterly Summary of Economic Projections, which includes the “dot plot” prognosis for rates, will also be of interest to investors. · This week is anticipated to see policy easing by the central banks of China and Canada, while those in Japan and the UK are likely to stand pat. Technical Triggers · Gold Dec Futures seems to have topped out, and if it falls below $3710 (~₹109,600), then we could only see further profit booking up to $3650. But if it sustains above $3740 (~₹110,500), the next target would be $3800 (~₹113,500). September 17, 2025 11:08 Stock markets live today: Agarwal Industrial Corporation Ltd secured a tender from Indian Oil Corporation Limited (IOCL). Agarwal’s shares surged 4% on the NSE to ₹944.90. September 17, 2025 10:54 Stock market live today: Dev Accelerator shares surge to upper circuit after flat listing at ₹61 Dev Accelerator shares surge to upper circuit after flat listing at ₹61 Shares of Dev Accelerator made a flat debut on the stock exchanges, listing at par with its IPO price of ₹61. September 17, 2025 10:48 Nifty Bank Prediction Today – September 17, 2025: Nifty Bank futures: Intraday trend appears bullish Nifty Bank Prediction Today – September 17, 2025: Nifty Bank futures: Intraday trend appears bullish Traders can buy Nifty Bank futures (September) for a target of 55,800 September 17, 2025 10:48 Stock markets rally in early trade amid US trade talk optimism Stock markets rally in early trade amid US trade talk optimism Sensex and Nifty rally on positive India-US trade talks, with expectations of beneficial agreement and market growth. September 17, 2025 10:30 Stock market live today: Urban Company shares rally over 70% to ₹179 after strong debut Urban Company shares rally over 70% to ₹179 after strong debut Urban Company Ltd shares surge over 70% post IPO listing, attracting strong investor confidence in the booming home services sector. September 17, 2025 10:23 Commodities market live today: Crude oil futures decline as markets await Fed’s policy decision Crude oil futures decline as markets await Fed’s policy decision Crude oil futures dip as markets await US Federal Reserve decision, while European Commission plans to increase pressure on Russia. September 17, 2025 10:21 Stock market live today: RMC Switchgears has received a Letter of Intent (LOI) amounting to ₹59.12 crore from Jaipur Vidyut Vitran Nigam Limited. September 17, 2025 10:13 Currency market live today: Rupee rises 28 paise to 87.81 against US dollar in early trade Rupee rises 28 paise to 87.81 against US dollar in early trade The rupee appreciated 28 paise to 87.81 against the US dollar in early trade on Wednesday, tracking the broad decline in the greenback amid hopes of a US Fed rate cut. September 17, 2025 10:13 Economy watch: In a relief to importers & exporters, CBIC notifies amended regulations for finalisation of provisional assessment In a relief to importers & exporters, CBIC notifies amended regulations for finalisation of provisional assessment CBIC notifies changes in regulation for 'Finalisation of Provisional Assessment,' providing relief to importers and exporters. September 17, 2025 10:12 Sectoral outlook: Indian tyre industry to grow 12-fold in revenue at ₹13,000 crore till 2047: ATMA report Indian tyre industry to grow 12-fold in revenue at ₹13,000 crore till 2047: ATMA report Indian tyre industry set to grow 12-fold to ₹13,000 crore by 2047, driven by OEM demand, exports, and innovation. September 17, 2025 10:11 Commodities market live today: Gold, silver ETFs gain traction as sharp price rally woo equity investors Gold, silver ETFs gain traction as sharp price rally woo equity investors Investors flock to gold and silver ETFs as prices soar, offering cheaper exposure to precious metals with easy liquidity. September 17, 2025 10:08 IPO Updates: Urban Company Lists at Rs 162.25 on the NSE and at Rs 161 on the BSE Urban Company Share Price & IPO Listing Live: Shares list at 57.5% premium on NSE Urban Company Stocks Today, Urban Company IPO listing & share price live updates: Shares of Urban Company Ltd debut on bourses today. The most oversubscribed Rs 1,900-cr IPO received 103.63 times subscription on the last day of bidding. Listing date and price: September 17. Lists at Rs 162.25 on the NSE and at Rs 161 on the BSE Issue size: Rs 472 crore through sale new shares, and Rs 1,428 crore from sale of stakes by existing investors. Price Band: Rs 98-103 Anchor portion: Rs 854 crore Use of funds: The company plans to use funds raised through the fresh issuance for new technology development and cloud infrastructure, lease payments for its offices, marketing activities, and general corporate purposes. Catch live updates on IPO, subscription, price band, share price, GMP, listing price and more September 17, 2025 10:04 IPO Updates: Prosus NV doubles stake in Urban Company ahead of listing, becoming a major shareholder Prosus NV has more than doubled its stake in Urban Company Ltd. ahead of the Indian startup’s listing, and is now one of the firm’s biggest shareholders, according to Prosus India Ecosystem head Ashutosh Sharma. - Bloomberg Follow live updates on Urban Company listing: September 17, 2025 10:03 Stock market live today: Jindal Steel shares remain flat at ₹1,046; company bids for Thyssenkrupp’s steel division Jindal Steel shares traded flat on the NSE at Rs 1,046. Jindal Steel International made an offer for Thyssenkrupp’s steel division, the German company said Tuesday September 17, 2025 10:02 Stock market live today: US court sets February 2027 trial date in Infosys–Cognizant antitrust dispute US court sets February 2027 trial date in Infosys–Cognizant antitrust dispute US court sets trial date for Infosys and Cognizant trade secret dispute, with potential industry-wide implications. September 17, 2025 09:55 Stock in focus: Aditya Birla Fashion launches OWND! for Gen Z; shares rise 3% to ₹89.45 Aditya Birla Fashion and Retail Ltd. (ABFRL) announces the launch of OWND!, a bold new fashion brand designed for India’s Gen Z and youthful, trend-conscious consumers. Shares surged 3% on the NSE to Rs 89.45 September 17, 2025 09:55 Stock market live today: Larsen & Toubro wins ₹2,500-5,000 crore grid infrastructure orders; shares flat at ₹3,689.50 Larsen & Toubro’s Power Transmission & Distribution (PT&D) business vertical has won grid infrastructure orders worth Rs 2500-5000 cr in India and abroad. The orders include Distribution SCADA and Dynamic Reactive Power Compensation devices. Shares flat on the NSE at Rs 3,689.50 September 17, 2025 09:35 Stock market live today: Paytm launches Postpaid credit line on UPI in collaboration with Suryodaya Small Finance Bank Paytm (One 97 Communications Limited) has launched Paytm Postpaid as Credit Line on UPI, powered by NPCI, in partnership with Suryodaya Small Finance Bank. September 17, 2025 09:29 Stock market live today: India’s e-commerce logistics market growing faster than industry, to grow at 16% CAGR by FY30: JP Morgan India's e-commerce logistics market growing faster than industry, to grow at 16% CAGR by FY30: JP Morgan India's e-commerce logistics market to grow at 16% CAGR by FY30, driven by tier-2 city penetration and tech efficiencies. September 17, 2025 09:24 OPENING BELL: Sensex rises 157.37 points to 82,538.06; Nifty 50 up by 55 points to 25,294.10 Sensex traded 157.37 pts or 0.19% positive at 82,538.06 after opening at 82,506.40 against the previous close of 82,380.69. Nifty 50 increased by 55.00 pts or 0.22% to 25,294.10. September 17, 2025 09:10 Stock market live today: Jio BlackRock sees India’s mutual fund industry tripling by 2032 Jio BlackRock sees India’s mutual fund industry tripling by 2032 BlackRock Inc. and Mukesh Ambani's Jio venture aim to reshape India's financial industry with digital platforms and innovative strategies. September 17, 2025 09:00 IPO update Live: VMS TMT and Euro Pratik Sales offer new investment opportunities IPO Offering (by SBI Securities) * VMS TMT: The company is engaged in the manufacturing of Thermo Mechanically Treated Bars (TMT Bars) and deals in scrap and binding wires, which are sold within Gujarat and other states. The company will offer shares for bidding on Wednesday. The price band is set from Rs 94 to Rs 99 per share. The Rs 148.5-crore IPO is entirely a fresh issue. The company raised Rs 26.73 crores from anchor investors. * Euro Pratik Sales: The company is engaged in the business of decorative wall panel and decorative laminates industry as a seller and marketer of Decorative Wall Panels and Decorative Laminates. The public issue was subscribed to 0.43 times on day 1. The bids were led by qualified institutional investors (0.26 times), non-institutional investors (0.89 times), retail investors (0.33 times), employee reserved (1.23 times). September 17, 2025 08:59 Share market live today: Stocks to Watch today: Sept 17 By SBI Securities Jindal Steel: The company offers to buy Thyssenkrupp Steel Europe - Neutral in short term * Gujarat Fluorochemicals: Promoter Devansh Trademart sells up to 13 lakh shares at an offer price of Rs 3,500 apiece, 5.3% discount to the current market price – Slightly negative to neutral in short term * Lupin: USFDA ends the inspection at Nagpur facility with 6 observations. USFDA conducted an inspection at the Nagpur facility from Sept. 8-16 - Negative in short term * Amber Enterprises: The company opens a QIP issue of Rs 1,200 crore, approves floor price of Rs 7,790.88 per share. The floor price is at a discount of 6% of the current market price - Positive in medium term * Avantel: The company received a purchase order worth Rs 9.9 crore for the supply of Satcom Products from Garden Reach Shipbuilders - Positive in medium term * TVS Holdings: The board is to meet on Sept. 22 to consider issuance of cumulative non-convertible redeemable preference shares via bonus - Neutral in short term * Bluedart: The Arm received a show cause notice for a demand worth Rs 420 cr from the commissioner of GST & Central Excise. Show Cause Notice demands recovery of Tax Dues from April 2021 to March 2023 - Neutral in short term * Tech Mahindra: LIC raises stake in the company to 10.84% from 8.84% via market purchases - Neutral to positive in short term * Bharat Electronics: The company received additional orders worth Rs 712 cr since the last disclosure on Sept. 1 - Positive in medium term * Mahindra Lifespace Developers: The company has been chosen as a partner for redevelopment projects of two housing societies in Chembur, Mumbai. The redevelopment project offers gross development potential of Rs 1,700 cr - Positive in medium term Morning Update – 17th September 2025 Ashapura Minechem: Overseas arm executed a long-term agreement with the China railway to jointly develop Boffa bauxite deposit in Guinea. China railway will support Ashapura in its mining operations, local logistics and port handling & infrastructure services - Positive in medium term * Dr Reddy’s Laboratories: The company launched Novel Molecule Tegoprazan in India. Tegoprazan is a novel patented molecule for Acid-Related gastrointestinal diseases - Positive in medium term * Coal India: The company was declared as the preferred bidder by the Ministry of Mines for Ontillu-Chandragiri rare earth element exploration block - Positive in medium term * Nectar Lifesciences: The purchaser mutually agrees with the company to extend the expected completion date of the slump sale to or before Oct. 20, 2025 - Neutral to positive in short term * HCL Tech: The company launched AI-First Martech Platform HCL Unica+ in India - Positive in short to medium term * Premier Explosives: Telangana Pollution Control Board revokes closure order for the company’s factory in Telangana. Telangana Pollution Control Board approved the resumption of production activities - Positive in medium term * One Mobikwik: In a recent incident on Sept. 11 and 12, some registered merchants and users in Haryana colluded to claim unauthorized monetary settlements from the company. In response, a legal enforcement agency proactively placed a debit freeze on and a lien mark on all bank accounts where the unauthorized funds were credited. The estimated net impact is Rs 26 cr, and the company is actively working to recover these amounts - Neutral in short term * SJS Enterprises: The company signed an agreement with Hong Kong’s BOE Varitronix to collaborate for manufacture of automotive displays in India - Positive in medium term * Krystal Integrated: The company received a Rs 168 cr sanitation services contract from the director of medical education in Andhra Pradesh - Positive in medium term * Piramal Enterprises: The company merged with Piramal Finance and dissolved without being wound up - Neutral in short term * Quality Power: The company received Rs 11.5 cr order for the supply of reactors for STATCOM project - Positive in medium term * Akzo Nobel: CCI approves JSW Paints acquisition of up to 75% shareholding in Akzo Nobel India - Positive in short to medium term * Vedanta: NCLAT sets aside NCLT order rejecting Talwandi Sabo demerger scheme - Neutral in short term * Authum Investment: The company is in an investment agreement with Serovia Pharma to subscribe to 18.95 lakh compulsorily convertible preference shares in Serovia Pharma by investing nearly Rs 300 cr - Positive in medium term * Tata Communicators: The company’s non-operating arm in the Netherlands has undergone winding up & has been liquidated - Neutral in short term Angel One: The company incorporated the associate company Angel one Livwell Life Insurance - Positive in medium term * Globe Civil: The company received a letter of intent for the project worth Rs 13.1 cr for construction of sports complex at NIT Delhi - Positive in medium term * Maharashtra Seamless: CCI conducts inquiry at the company’s New Delhi and Gurgaon offices from Sept. 15-16 - Neutral in short term * Insolation Energy: The company incorporated a step-down arm NRJG Green Infra as a special purpose vehicle to set up solar power plants - Neutral in short term * NLC India: The company received a letter of intent from the Chhattisgarh Government for Semhardih and Raipura Phosphorite and Limestone blocks - Positive in medium term * Railtel Corp: The company received a letter of acceptance for an order worth Rs 57.5 crore from Bihar Educational Infrastructure Development Corp - Positive in medium term * Roto Pumps: The company received Rs 7.25 crore order from GPS Renewables - Positive in medium term September 17, 2025 08:54 Stock market live today: Centre unveils draft Civil Drone Bill 2025, proposes strict rules on safety, insurance Draft Drone Bill 2025 mandates registration, safety features, and insurance for operators Centre’s draft Drone Bill 2025 proposes mandatory registration, safety features, insurance, and stricter penalties, replacing the Drone Rules of 2021. September 17, 2025 08:53 Stock market live today: Insurers not to get ITC benefit towards GST paid on commission on individual health, life policies Insurers not to get ITC benefit towards GST paid on commission on individual health, life policies CBIC clarifies no Input Tax Credit for insurance commissions, hotels with room tariff < ₹7,500, and other GST updates. September 17, 2025 08:50 Share market live today What sectors to watch? TEXTILE STOCKS-POSITIVE CLOSURE OF USA TRADE NEGOTIATION MEET+PM MODI TO LAUNCH TEXTILE PARK IN INDORE+FRESH LONGS PHARMA/IT/GEMS/AUTO ANCILLARY/SHRIMP-POSITIVE TRADE NEGOTIANS+FASTRACK OF FTAS+SHORT COVERING SEEN IT-UPMOVE MAY COME ON FED MEET RESULTS-IF 50BPS RATE CUT COMES (25BPS IS FACTORED IN)-HELPS IN CLIENT BUDGET INTEREST RATE SENSITIVE STOCKS-ON RATE CUTS FED+FESTIVE SEASON+STRONG LONGS RAILWAYS/DEFENSE/BUILDING MATERIAL THEME-TECHNICAL SETUP STRONG September 17, 2025 08:49 Global markets update: Major U.S. listed stocks result calendar 17.09.2025 General Mills, Inc (Pre market) (Sector- FMCG) September 17, 2025 08:49 Stock market live today: Economic Calendar – 17.09.2025 11:30 U.K. CPI y/y (Expected: 3.8% versus Previous: 3.8%) 13:00 EURO ECB President Lagarde Speaks 14:30 EURO Final CPI y/y (Expected: 2.1% versus Previous: 2.1%)} 18:00 U.S. Building Permits (Expected: 1.37M versus Previous: 1.35M) 23:30 U.S. Federal Funds Rate (Expected: 4.25% versus Previous: 4.50%) 00:00 U.S. FOMC Press Conference September 17, 2025 08:49 Stock market live today: Jindal Steel proposes acquisition of Thyssenkrupp Steel Europe in strategic move for market expansion Jindal Steel International has proposed to buy Thyssenkrupp Steel Europe, which is one of Europe’s largest steel producers. The offer was disclosed by Thyssenkrupp AG’s CEO, Miguel López, during a meeting with the company’s Supervisory Board. This marks a potential strategic shift for the European steel sector, as Jindal aims to gain a stronger foothold in the continent. Thyssenkrupp Steel Europe specializes in high-grade flat steel products, including carbon steel, electrical steel, and packaging steel. It operates major facilities in Germany (e.g., Duisburg) and is a key player in green steel initiatives, with products like bluemint®️ (low-CO2 steel). However, the unit has faced ongoing challenges, including high energy costs, global competition, and profitability issues, prompting Thyssenkrupp to seek partners or buyers. Jindal Steel’s Motivation as an Indian steel giant with access to raw materials and expertise in sustainable (“green”) steel production, Jindal sees this acquisition as a way to expand into Europe. It could leverage Thyssenkrupp’s established market presence and technology for low-carbon steel, aligning with global decarbonization trends. September 17, 2025 08:48 Stock market live today: India’s data center market surges with digital growth and AI adoption India’s data center market is booming, driven by digital growth, AI, and cloud adoption. Valued at ~$8B (2026 projection), it features domestic and global players with major hubs in Mumbai, Chennai, Delhi-NCR, Bengaluru, Hyderabad, and Pune. Top 10 Data Center companies in India (2025), based on capacity, facilities, and market presence. 1. Nxtra Data (Airtel): ~200 MW, 10+ facilities; colocation and cloud services. 2. STT GDC India: 16+ facilities; hyperscale, AI-ready, sustainable. 3. CtrlS Datacenters: Tier-4 certified; 8 facilities, expanding to 5M sq ft. 4. AdaniConneX: Hyperscale leader; Chennai, Hyderabad, Noida campuses. 5. Yotta Infrastructure: AI-focused; Greater Noida, Panvel data parks. 6. NTT Global Data Centers: 13 campuses; edge computing, cloud integration. 7. Web Werks (Iron Mountain): 40 MW; Mumbai, Chennai expansions. 8. Sify Technologies: Cloud and connectivity; listed on NASDAQ. 9. Equinix Inc.: Carrier-neutral colocation; Mumbai, Chennai focus. 10. Tata Communications: 99.95% uptime; global network integration. Note: Hyperscalers (AWS, Azure, Google Cloud) and Reliance Jio also play key roles. Sustainability, AI, and edge computing are key trends. September 17, 2025 08:48 Stock market live today: Fund Flow Activity: 16th September 2025 Turnover: (NSE + BSE) Cash Volume: 91048.46 + 7679.71 Total: 98728.17 F&O Volume: 134821.1 + 3861510.6 Total: 3996331.7 Provisional Cash FII/FPI: NET BUY: +308.32 (11,942.44 - 11,634.12) DII: NET BUY: + 1,518.73 (11,643.46 - 10,124.73) September 17, 2025 08:47 Sectoral outlook: Life insurers anticipate ₹10,000 crore loss from GST changes Life Insurers Predict ₹10,000 Crore Loss From Gst Changes And May Request Irdai To Allow Gst Costs To Be Spread Over Policy Duration - Cnbctv18 (Insurance Co. to remain in focus) September 17, 2025 08:46 Stock in focus: TECH MAHINDRA: LIC RAISES STAKE IN CO TO 10.84% THROUGH MARKET PURCHASES September 17, 2025 08:46 Stock market live today: Morning Market Outlook by Ponmudi R, CEO of Enrich Money Bullish Reversal Potential for Nifty The Nifty indices have flashed early signs of a bullish reversal after decisively closing above 25,150—surpassing the lower high (LH) formed on August 21. Tuesday’s close at 25,239 confirms a fresh swing high (H), potentially invalidating the earlier lower-high pattern. This move is supported by a higher low (HL) at 24,404 from the August 29 candle, reinforcing the case for sustained momentum. If the index holds above these levels, the previous high at 25,669 now stands as a key resistance. A breakout could pave the way for a fresh higher high (HH) near 25,800. On the downside, 25,150 has flipped into short-term support, while the psychological 25,000 remains a critical cushion for investors. Bank Nifty Outlook Bank Nifty has delivered a strong technical signal, breaking out above the descending broadening wedge’s resistance slope at 54,900—indicating the downtrend from July to September may have ended. After carving out a lower low at 53,561, the index is now trending higher toward the crucial resistance at 56,156, the last lower high. A breakout above this level could mark a decisive long-term trend reversal and boost investor confidence in the banking space. Until then, the possibility of consolidation remains. Key supports are placed at 54,905 (August 8 low) and 54,777 (yesterday’s floor), offering a base for stability. Fundamental Outlook US markets closed on a cautious note yesterday, as investors braced for the Federal Reserve’s upcoming interest rate decision, with uneven employment data fueling uncertainty amid ongoing trade discussions. European equities ended the day lower, shaken by ambiguity surrounding US policy directions and escalating geopolitical concerns that weighed on sentiment. Asian markets opened with a generally subdued performance today, reflecting Wall Street’s hesitance and concerns over potential tariff hikes, though select regions showed resilience. Indian markets are expected to open slightly softer but remain supported by robust domestic sectors like technology and banking, with optimism tied to the Fed’s anticipated actions potentially sparking a recovery. September 17, 2025 08:45 Stock market live today: Morning Market Views by Hariprasad K, Founder - Livelong Wealth Fundamental Views Gift Nifty is hovering around 25,300, hinting at a positive to flat start. However, global cues remain cautious as Wall Street closed lower ahead of the US Fed’s policy announcement. The Federal Reserve is widely expected to deliver its first rate cut of 2025, but investors are closely watching for guidance on further easing. Asian markets opened lower, mirroring the global wait-and-watch sentiment. Volatility remains muted with India VIX at 10.27, suggesting low fear in the market. Dreamfolks Services will be in focus after announcing the discontinuation of airport lounge services in India, a move expected to have a material business impact Technical Views Nifty 50 closed at 25,239, continuing to display strong short-term bullish momentum as the index trades above both its 9-day and 15-day EMAs. A bullish crossover, with EMA 9 crossing above EMA 15 which further strengthens the upside view. Momentum Indicators are also confirming this uptrend. RSI stands at 63.84, firmly in the bullish zone but still shy of the overbought threshold (70+), indicating room for further upside. MACD remains positive with the line above its signal line and a green histogram, reflecting strong buying momentum. Price has also broken above a key descending trendline, confirming a bullish breakout. September 17, 2025 08:45 Stock market live today: Prashanth Tapse, Senior VP (Research), Mehta Equities on today’s market outlook Prashanth Tapse, Senior VP (Research), Mehta Equities Nifty appears bullish ahead of the widely expected 25-basis point Fed rate cut on 17 September, with the street already positioning for the move. The benchmark index looks set to extend its constructive rally into Diwali and the New Year, supported by a series of Fed cuts. Technically, strength will be confirmed only above 25,670 (high of 30 June), with key support at the 21-DMA of 24,853. The bias remains risk-on as long as Nifty holds above 24,853. Bullish charts include HBL Engineering, JSW Energy, and Prestige Estate. Top pick: HBL Engineering (CMP 909), buy at 890–900, stop 833, targets 923/953 and 1,150. September 17, 2025 08:44 Stock recommendations: Nomura’s coverage on Prestige Estates Projects with a ‘Buy’ and target price of Rs 1,900 Doing all things right: Transforming into a pan-India player, while building a solid annuity-plus-hotel portfolio Action: Initiate coverage at Buy with a target price of INR1,900, implying 17% upside. We initiate coverage on Prestige Estates Projects with Buy rating, as: 1) we believe the company’s pan-India growth strategy is superior to peers, and a strong scale-up is likely, particularly in Mumbai and the Delhi National Capital Region (NCR), driven by both mid-income township and luxury projects; 2) superior execution should help scale PEPL’s annuity and hotel EBITDA 4-5x over the next 4-5 years; and 3) cheaper valuations given the stock currently trades at a ~40% premium to NAV, lower than Godrej Properties (Reduce; pan-India player with similar pre-sales) at 108%. Moreover, we believe PEPL will beat FY26E pre-sales guidance of ~INR260bn by +10%, with upside risk. Our TP of INR1,900 is based on SOTP (Fig. 52). Downside risks: a slowdown in the Bangalore real estate ( RE) market or weaker-than-expected leasing of annuity assets. September 17, 2025 08:43 IPO Live today: India’s most sought-after IPO of 2025: Urban Co. set for market debut today Urban Co IPO 2025: India’s most oversubscribed listing debuts in Mumbai today Urban Co, India’s most oversubscribed IPO of 2025, lists in Mumbai today. Shares trade 60% above issue price in grey market; strong debut expected. September 17, 2025 08:29 Global market updates: Wall St ends lower as investors turn cautious ahead of Fed rate decision S&P down 0.13%, Nasdaq down 0.07%, Dow down 0.27% September 17, 2025 08:28 Commodities market updates: Oil prices hold steady as markets await Fed rate decision Oil prices held steady in early trading on Wednesday, after rising more than 1% in the previous session on drone attacks on Russian ports and refineries, while traders awaited an expected rate cut from the U.S. Federal Reserve. Brent crude futures dropped 1 cent to $68.46 a barrel, while U.S. West Texas Intermediate crude futures also fell 1 cent to $64.51 a barrel. - Reuters September 17, 2025 08:26 Gold price trends: Gold steadies near record high as investors await Fed verdict Gold prices hovered near all-time highs on Wednesday as expectations for a Federal Reserve interest rate cut later in the day dented the dollar and U.S. bond yields, boosting demand for the precious metal. FUNDAMENTALS : Spot gold held its ground at $3,690.09 per ounce, as of 0115 GMT, after hitting a record high of $3,702.95 on Tuesday - Reuters September 17, 2025 08:02 Stock market live today: Madison India Capital exits Star Health with ₹299 cr stake sale; Premji Invest picks up shares Madison India exits Star Health with ₹299 cr stake sale; Premji Invest buys in Madison India Capital sold its ₹299 cr stake in Star Health, with Premji Invest buying a portion. Greenlam also saw a ₹231 cr block deal on the BSE. September 17, 2025 07:55 Stock market live today: Centre earns ₹3,300 cr from scrap disposal during cleanliness campaigns Centre earns ₹3,300 crore from cleanliness campaigns; launches portal for Special Campaign 5.0 The Centre has generated ₹3,300 crore from waste disposal since 2021. Special Campaign 5.0 will focus on cleanliness, efficiency, and governance reforms September 17, 2025 07:48 Stock market live today: Tata Group chief visits Solar Group’s Nagpur facility Tata Group Chairman N Chandrasekaran visits Solar Group’s ammunition facility in Nagpur Tata Group chief N Chandrasekaran visited Solar Group’s Nagpur explosives facility on Tuesday. The visit was courtesy only; no collaboration discussed September 17, 2025 07:26 Stock market live today: CBI files supplementary chargesheet in NSE co-location case against brokers CBI files supplementary chargesheet in NSE co-location scam, brokers under lens CBI files a supplementary chargesheet in the NSE co-location scam, naming brokers who allegedly gained unfair market access; earlier charges filed in 2022. September 17, 2025 07:18 WATCH: Today’s Stock Recommendation: September 17, 2025 September 17, 2025 07:17 Stock market live today: Coal India, HCL offer free ₹1 cr accident cover, hike mine fatality ex gratia Coal India, Hindustan Copper roll out ₹1 cr accident insurance for employees, enhanced ex gratia Coal India, HCL announce free accident insurance up to ₹1 crore and raise ex gratia for mine fatalities, boosting worker welfare in the mining sector. September 17, 2025 06:55 Trading Guide For September 17, 2025 - Intraday supports, resistances for Nifty50 stocks Day Trading Guide For September 17, 2025 - Intraday supports, resistances for Nifty50 stocks Intraday trade recommendations for Nifty50 stocks with entry, stop-loss levels based on Technical Analysis for September 17, 2025. September 17, 2025 06:55 Stock to buy today: Sundram Fasteners (₹1,055) – BUY Stock to buy today: Sundram Fasteners (₹1,055) – BUY Bullish outlook for Sundram Fasteners with strong support at ₹1,000, potential rise to ₹1,150, buy at ₹1,055. Comments Published on September 17, 2025",
    "url": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-live-updates-17th-september-2025/article70056755.ece",
    "original_url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPZ293MG1QYUJSa3BJT01ZcTUybEM0Vk4ydDJtWnlvZjRlOU5NV0NQT19nVXRkMU9aeHhTN1VWa29HUXJWVTlBQnpqSjlMQTJCZk1GTXlsTndoUmdGdGwzLWljVF9BQTVRMVVocUpPR0hxTFBULUhYalNwYURLb1hGS2N0cWtSSWFlTXo3Z0N3Ny1ueXhWcEJTTDR2RVU5X0YwSlpCcmxEQ1d4eldBcGtEbGQ0LXozMFZuVzhQMVBQZW_SAccBQVVfeXFMTTVXbXJzMXp2RlRuLUxKVXYydjhKNnVUVnU0cDZ1UVpJcEZlRnFpZkZaaEJvQ0FkN01WRFpsZWlkRElESmpSdk03S0ZwNmRIZmNuSWRUc1dQZmNpMU9ocmp3RTk1aEU0SVVfcW5RZzdkSEY5REtJdG5RclhkczByaWYwZEp1SlVCNEZ1Q0QtWTBFR2RvenBBUGFZTDFlMG11eE5qWGRGRkNrWTQ5TVh0d2ZUTlFmNFUtb001Rl9IQjV0M20xR2c5cw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 44040,
    "word_count": 6940,
    "gnews_title": "Share Market Highlights 17th September 2025: Stock markets rally for 2nd day amid US trade talk optimism, Fed rate cut hopes - BusinessLine",
    "published_date": "17/09/2025",
    "publisher": "BusinessLine",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Holiday: Are NSE, BSE open or closed today for Eid-e-Milad? Find out",
    "body": "As investors and traders prepare for the last trading session of the week, there is confusion about whether the stock markets - National Stock Exchange (NSE) and BSE - are open or closed today. This is because banks will remain closed in some parts of the country today, i.e. on September 5, 2025. According to the Reserve Bank of India's list of holidays, both public and private sector banks will remain closed on this day due to Eid-e-Milad un-Nabi and Thiruvonam (Onam) festivals. Eid-e-Milad-un-Nabi or Id-E-Milad, which marks the birth anniversary of Prophet Muhammad. Thiruvonam marks the last day of the auspicious Hindu festival of Onam, which is celebrated with great pomp in various regions of South India. Are Stock Markets Open Or Closed Today? While banks are closed in some states, the National Stock Exchange (NSE) and BSE will remain open today. According to the stock market holiday calendar shared by the NSE and BSE, trading activities will go as usual on Friday. According to the stock market holiday calendar, there are no additional holidays in the month of September, and they will remain closed only on weekends. Meanwhile, stock markets are expected to have a flat opening today, after yesterday’s gap-up opening, which was fueled by GST 2.0 optimism but later met with profit booking. Share Market Holidays 2025: Full List The stock markets will now remain closed on these days: Mahatma Gandhi Jayanti/Dussehra, Diwali Laxmi Puja, Diwali-Balipratipada, Prakash Gurpurb Sri Guru Nanak Dev, and Christmas.",
    "url": "https://www.indiatvnews.com/business/markets/stock-market-holiday-nse-bse-holidays-2025-id-e-milad-eid-e-milad-market-open-or-closed-check-details-2025-09-05-1006771",
    "original_url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxQcGpVdTY3aG5UZU9YMXh4TGdoQUdtQWpRLU5Nckw5bW9MVWRnU3F1OEtyeHpVdnpJMUdYVzJnekFIaS0tYUlrMzZRckNTVnotTkZqT0RyOFlHY0xlSnhhTC1veXdjM2pQajR3N1BNMU9HSjJ6WnlPaWVvendhc2Q4QUxoOVNmTFZaQ2tGSW9yOGx1S1RtVTJxZFk0Y3pXbGZuZG43Q1FEcWZ2YTZvb2hnRmZEMW9PUklUMEVfdjhKQUlWT3hHb3VEelg5ZDh3TmFoLXhhTTcxT3ZMOWdwQWVGbXRla3B3bHBETWdwTlZqWXViQ3NrR0E5TNIB_gFBVV95cUxOa2NpbWdWY2dVUlpWa0x2ODBTZ3VkdHpseDNCRkhIOWxFNGFzZU15QThfWnRPejljaS1rZDNkTi1qLTh5R0VXUGRzZm12VTJYWkhrRWF3dTR6YU02ekM3WXZ3WkhUSnNieDZSS2VoZWI1RFZLbTNuYnZ3ZUxaYjdOMURGME90bTNFSWF1UlFJMmIxT2FkOEl6STZKV3NPYjlpZGd2elJKRHFWTzJ0Sko2MEE5NnpZMW4wOFpOVFZmVmJQS0JxNXlvV2twS2I1bzlkOTVOQ05SRGJrMmhnNHh5bWNCbGRhYXJtQ1JtY1hIbldYRkhGV3F3cUF1ZUljUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1530,
    "word_count": 248,
    "gnews_title": "Stock Market Holiday: Are NSE, BSE open or closed today for Eid-e-Milad? Find out - India TV News",
    "published_date": "05/09/2025",
    "publisher": "India TV News",
    "topic": "NSE India trading"
  },
  {
    "title": "Diwali Muhurat trading: NSE schedules special Muhurat session for one hour in afternoon; check timings",
    "body": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More 9 animals that have mastered cave life, and are rarely spotted amidst civilization! Timeless Bollywood romances prove that love lives beyond lifetimes 9 animals with lifespans longer than humans Glowing skin juice: Drink this juice in Navratri for that ultimate glow 10 subtle signs of a truly clever person you should notice Affordable SUVs under Rs 15 lakh with panoramic sunroof: Maruti Victoris, Kia Syros & more Shraddha Arya’s top 10 stunning ethnic looks Navratri Day 1: Deepika Padukone, Shraddha Kapoor, and other Bollywood divas in their red festive flair Priya Prakash Varrier: Eight frames, infinite charms Regina Cassandra’s stunning pictures you can’t miss",
    "url": "https://timesofindia.indiatimes.com/business/india-business/diwali-muhurat-trading-nse-schedules-special-muhurat-session-for-one-hour-in-afternoon-check-timings/articleshow/124049185.cms",
    "original_url": "https://news.google.com/rss/articles/CBMilAJBVV95cUxOb2s3NTJ6MDBlRWdkMGN2dC05SmtfajMzZ2xBWWpLLThsblgxUmVrbDV6a2wyblVtM1R0UGdCUVZNN0tBNmRiRDRyZ0x1ZWhuQkQ2UV9LbGZQSUp0azMwZjhHenFSN3haQ25BUTBBWVBzdHJfYTdBUTVhTDJiVWNvdG5yWm52Vms1R1kzMU05TFVTZ2lxUmNzQndwWDRzVmJWdGxjUFRJSDVLZjVuc0JIVU96WDQ2eHlvWnhLM1VObGh1THdqcHVuNlRrRUFCOWdtQWxHQ29rWWYxS05iVlhIM1l2YUZ6UmF3aVJrdzdwN0EwNHBQSFBnZ1RJR04wMXRDVkZ1YnowUS15Y2h6YzVYaXVtei3SAZoCQVVfeXFMTUY4UU1OSmVfMXhLR1ZseE5zVVdITHpnVnZSRmY2dVpqS2NBQ3d4cEtpMmZIb3hDSGp1R0lISGtYNmU1djdDUkxNdHl5Rm5VNmZxTWs2a1Y2TG9MekdOVGNzVlBONlhzZWV3dS1nTno5QllPeDdLMVVmLVgyYnlZQmRnM3J0Mlp5SGU5TXY3eFV3RUpvWHVGTFRmVjA5ZE9Nd2I4MWREME56N2IwdWlUdG1Tb2RDTEE5X09ENnZ1ZGYxZ0E2cnNZSXlKSkpfd3ZXVmk1dFYyTG5EMU9ybUtoNjVxV1U2YUFjZ1VxRU9VUUJrZTdra1A5X0xSR0JKQmdHbUtMYk5xQVhnbVdoR3RwMjRiZkpyclpNYXZR?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1357,
    "word_count": 212,
    "gnews_title": "Diwali Muhurat trading: NSE schedules special Muhurat session for one hour in afternoon; check timings - The Times of India",
    "published_date": "22/09/2025",
    "publisher": "The Times of India",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Holiday: Will Nifty, Sensex Remain Open Or Closed For Id-E-Milad 2025 On Sept. 5?",
    "body": "ADVERTISEMENT Stock Market Holiday: Will Nifty, Sensex Remain Open Or Closed For Id-E-Milad 2025 On Sept. 5? Apart from the regular weekend non-trading days, no additional holidays are scheduled for September, as per the NSE calendar. NDTV Profit News 04 Sep 2025, 04:00 PM IST i 04 Sep 2025, 04:00 PM IST 04 Sep 2025, 04:00 PM IST Save The next trading holiday is scheduled on Oct. 2. (Photo source: NDTV Profit) Show Quick Read Summary is AI Generated. Newsroom Reviewed Id-E-Milad, marking the birth anniversary of Prophet Muhammad, will be celebrated across India on Sept. 5. However, stock markets will remain open on this day. As per the holiday calendar issued by the National Stock Exchange of India (NSE), no market holidays are scheduled in September. Thus, there is no holiday on Sept. 5. However, stock markets are closed for eight days in September during regular weekend non-trading days. The next market holiday falls on Oct. 2 on the occasion of Mahatma Gandhi Jayanti and Dussehra. ALSO READ Id-E-Milad 2025 Holiday: Are Banks Open Or Closed On Sept. 5? Details Here Opinion Id-E-Milad 2025 Holiday: Are Banks Open Or Closed On Sept. 5? Details Here Read More Stock Market Holidays In 2025 As per the NSE calendar, there are 14 trading holidays in 2025. The remaining holidays in the year are as follows: Oct. 2 – Mahatma Gandhi Jayanti/Dussehra Oct. 21 – Diwali Laxmi Pujan Oct. 22 – Balipratipada Nov. 5 – Prakash Gurpurb Sri Guru Nanak Dev Dec. 25 – Christmas Though Oct. 21 is a holiday for Diwali, a special 'Muhurat Trading' session will be held on that day. The timings for the Muhurat trading session will be notified by the BSE and NSE at a later date. Regular Stock Market Operations Trading on the equities segment happens on all days of the week (other than Saturdays and Sundays and holidays declared by the Exchange in advance). The market timings of the equities segment are given below: A) Pre-open session Order entry and modification Open: 9 a.m. Order entry and modification Close: 9:08 a.m. [With random closure in the last one minute. Pre-open order matching starts immediately after the close of pre-open order entry.] B) Regular trading session Normal / Limited Physical Market Open: 9:15 a.m. Normal / Limited Physical Market Close: 3:30 p.m. C) Closing Session The Closing Session is held between 3:40 p.m. and 4 p.m. D) Block Deal Session Timings Morning Window: This window shall operate between 8:45 a.m. and 9 a.m. Afternoon Window: This window shall operate between 2:05 p.m. and 2:20 p.m. The Exchange may, however, close the market on days other than the above-scheduled holidays or may open the market on days originally declared as holidays. The stock exchanges may also extend, advance, or reduce trading hours when they deem fit and necessary. ALSO READ September Calendar 2025: Teacher's Day To Navratri — Full List Of National And International Events Opinion September Calendar 2025: Teacher's Day To Navratri — Full List Of National And International Events Read More Watch LIVE TV , Get Stock Market Updates, Top Business , IPO and Latest News on NDTV Profit. Feel free to Add NDTV Profit as trusted source on Google. OUR NEWSLETTERS Sign Up By signing up you agree to the Terms & Conditions of NDTV Profit ADVERTISEMENT",
    "url": "https://www.ndtvprofit.com/markets/stock-market-holiday-will-nifty-sensex-remain-open-or-closed-for-id-e-milad-2025-on-sept-5",
    "original_url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOc3k3TTJkcXZwRVppUFBBWjBpZ19uckFmRGg4eUJSY1c5V3dvTEV0RU5FVEl3S3dyenJiS1RvZURPNTBmWmd5WXFVSEhiSFFSSFV5WWpvSllnX09OajlHTW90WDZiVDhIT1lSSHR4bU96elR1bVliUUMxWlpmb04wVzQtbUM1Q2tkaVZMTWUyRW01NlZDangyRHZUTkFINGFHQjAwOTYtWUpQSzFuQ1dEYVJRZHdFWEw3WnlhTWVJWjF0X1HSAcgBQVVfeXFMTUpwVmgtaXE4SEp6Z2Q5S1VyT25OYVRua2VXc29oRGVJbkxYa0pER18wU3ZqVlBZRE9CbXBUUm8ybkpDWVdkN1M2cnplR2xVakxaLU5DSXQ1MHZyeTZqcC1RNXR5bjE3SHFETjBrUkdtVnhaUXNEckVHbFdKNHdrRkx3MmlXZmFVblBwVkRlZlY5TjJPZUZ2ZXVZOEtqOXdTTHBsQ3dOMGJDWmtOWWxtaExRWWMtMkRmWXBPeEpFY1U5SUpqb2ZqQTk?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3278,
    "word_count": 554,
    "gnews_title": "Stock Market Holiday: Will Nifty, Sensex Remain Open Or Closed For Id-E-Milad 2025 On Sept. 5? - NDTV Profit",
    "published_date": "04/09/2025",
    "publisher": "NDTV Profit",
    "topic": "NSE India trading"
  }
]