[
  {
    "title": "NSE to conduct a special trading session on 1st February for Union Budget",
    "body": "In 2025, theUnion Budget, like every other year, will be presented on 1st February. However, this time around, it falls on Saturday, and markets are closed on the weekends. Let us look at the details. The National Stock Exchange (NSE) has released a circular that communicated that it will conduct a special session on Saturday, February 1, 2025, on account of the presentation of the Union Budget.The exchange will follow the standard market timing, which means a pre-open session to be held from 9:00 am to 9:08 am. After this, the market will remain open for trading from 9:15 am to 3:30 pm. It is a settlement holiday. It means that a T+0 settlement will not take place. No, this is not the first time exchanges will remain open when Union Budget Day fell over the weekend. In 2020, the exchanges conducted a live trading session on Saturday, February 1. Similarly, on 28 February 2015 (Saturday), the market remained open due to the presentation of the Union Budget. Here are some reasons why exchange keeps the market open: Finance Minister Nirmala Sitharaman will present the Union Budget for the eighth consecutive year. The Department of Economic Affairs, under the Finance Ministry, prepares the annual budget, showcasing the nation’s economic strengths. Additionally, the budget outlines the government’s plans for expenditure, taxation, and welfare initiatives. On February 1, 2024, FM announced theinterim Union Budget. The Nifty 50 ended lower by 0.13%. On July 23, 2024, the final Union Budget was announced by Nirmala Sitharaman. The Nifty 50 ended the session 0.12% lower after a volatile session. Conducting a special trading session is not new. Exchanges have historically opened for special trading sessions during significant events like Budgets or major economic announcements, maintaining consistency in market operations. Invest, Track, and Manage your Portfolio Anytime, Anywhere Invest, Track, and Manage your Portfolio Anytime, Anywhere",
    "url": "https://www.icicidirect.com/research/equity/finace/nse-to-conduct-a-special-trading-session-on-1st-february-for-union-budget",
    "original_url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPaklOVVRtQkZuVFJqd2ZSNmVMc1BuVHVPY2FLeG1Ub1pRdE5SUzBudFBOWGoweTFkeUQ5WWJPUWphZFZ3eDRPSWhaQTBXVmE1djltSDhBc0dlR09CUG5JZU9CaDRSRVhLYUI1bjJrYmFNbC1CQ3BieFF2TUd6TUFsNF9ZUEVqU0RTbmFQcFdBZUFtY0l5SGVVMmxOSmIyRGduUDJMLWZKbkdoRlIxdnJyalU0bzNTdV9jaGR5dV8yVklYZw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1963,
    "word_count": 310,
    "gnews_title": "NSE Will Conduct Special Share Market Trading Session on 1st Feb 2025 - ICICI Direct",
    "published_date": "02/01/2025",
    "publisher": "ICICI Direct",
    "topic": "NSE India trading"
  },
  {
    "title": "Are BSE, NSE closed on January 1 for New year 2025?",
    "body": "While most of the world welcomes the New Year with a laid-back holiday mood, sipping coffee and lounging in pyjamas, the Indian stock markets seem to march to a different beat. The Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) are operating as usual on January 1, 2025, despite it being New Year’s Day. Unlike many international stock markets that observe January 1 as a holiday, Indian stock exchanges are open for trading today. The official holiday calendar issued by NSE India does not include New Year’s Day as a non-trading day. Consequently, trading activities began at their regular times, with the pre-open session starting at 9:00 am and the full-day trading session running from 9:15 am to 3:30 pm. Investors can carry out their transactions just like on any other regular trading day. In India, the stock markets operate from Monday to Friday and remain closed on weekends, i.e., Saturdays and Sundays. The pre-open session, which allows for price discovery and order matching, begins at 9:00 am and lasts until 9:15 am. The main trading session runs from 9:15 am to 3:30 pm. Yes, US stock markets are closed today, January 1, 2025, in observance of New Year’s Day. According to the Securities Industry and Financial Markets Association, trading will resume on January 2. On December 31, US markets closed early to allow traders to welcome the New Year. Additionally, the US stock markets will remain closed on January 9, 2025, for a national day of mourning to honour former President and Nobel Laureate Jimmy Carter. The London Stock Exchange (LSE) is also closed today for New Year’s Day. Trading will resume on January 2, 2025. The LSE’s next scheduled closure will occur on April 18, 2025, for Good Friday. Several key international indices, including the Stock Exchange of Hong Kong, Euronext Paris, Tokyo Stock Exchange, and Shanghai Stock Exchange, are observing a holiday today. These markets will resume operations on January 2, 2025.",
    "url": "https://www.indiatoday.in/business/story/stock-market-holiday-bse-nse-closed-on-january-1-for-new-year-2025-stmp-2658057-2025-01-01",
    "original_url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQdVBMS0wydzFQLXpTMVNLTzdmSXplNURuZUREUnBDZEcwZzIwbVVrTWtzOFZqYVcwU2EzTmk5ZUJpdVZkVlN3c1FnRnZINm1NZXJ2bXg2YVFqYWRCbmdoNGJxVUlldWplUVc4cVRackRVOC16VXRkcC1NY3p6UmUwMC14b0ZsVzJRbTdqamU5T1h6eHRKVm9GR19DcEZUNnNsdGFsRTJYUmJPT3VZYzVPWEZ6QV9sR0tNYlBRNkxqWlhELTBJcjRaSXdrd9IB0AFBVV95cUxNSUEyYk1VWjhiemR3SE5MVklwYWNZUWJ1YXdObHlwdDU1Z3kyRUN4WFlpVmFXVy1Ca0tmVWdoZnA1aGt1ckw5YWpQOW5Da1lqclR3RWUxWUhQbjdGLUY4TXlYRF93NVRxZy02WV9oS0g1cDBCeDBvTmlJVU52VzVTOUhPcE9aTy1MRjVhb2ZtUnJjc0xJSEpWcXppdTN4dW4tN0ZNbTNvQ2o3aHVxVzZ0SVJyd0ZTUWJhZWpxVE9CZDNPQjNuRVNsVjZBZFBjdW1Q?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1972,
    "word_count": 326,
    "gnews_title": "Are BSE, NSE closed on January 1 for New year 2025? - India Today",
    "published_date": "01/01/2025",
    "publisher": "India Today",
    "topic": "NSE India trading"
  },
  {
    "title": "BSE and NSE closed today? Check what stock market holiday calendar says about January 1, 2025",
    "body": "Are the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) closed today on account of New Year’s Day? No, they are not. The benchmark indices of the Indian stock markets – Sensex and Nifty 50 – are operating as usual today, January 1, 2025. There is no trading holiday today. As per the official holiday calendar issued by NSE India, New Year’s Day, which falls on a weekday, is not listed among the non-trading days. This means that the pre-open trade will begin at the usual time of 9:00 am, and the markets will commence the day’s trading at the fixed time of 9:15 am. The markets will conclude the day’s trading with the 3:30 pm closing bell. What are the timings of Indian stock markets? The stock markets in India operate on five weekdays – Monday to Friday – and remain closed on weekends, i.e., Saturday and Sunday. The trading hours for the benchmark indices are from 9:15 am to 3:30 pm. On all regular trading days, the pre-open session is held between 9:00 am and 9:15 am. Are the US stock markets closed today? Yes, the US stock markets will not operate today on account of New Year’s Day. According to an official communication by the Securities Industry and Financial Markets Association, the US stock markets will begin trading for 2025 on January 2. Trading concluded early on December 31. After the January 1 holiday, the US stock markets will remain shut on January 9 to observe a national day of mourning for the demise of former US President and Nobel Laureate Jimmy Carter. Will the London Stock Exchange remain closed today? Like the US stock markets, the London Stock Exchange will also remain closed today. As per available data, the next scheduled closure of the LSE will be on April 18, 2025, on account of Good Friday. Other key international indices, such as the Stock Exchange of Hong Kong, Euronext Paris, Tokyo Stock Exchange, and Shanghai Stock Exchange, will also remain closed today. Discover the latestBusiness News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated! Festive dhamaka for online sales: Rs 60,700 crore in first week; Govt to ensure consumers benefit from GST cuts | MC Editor's Picks Find the best of Al News in one place, specially curated for you every weekend. Stay on top of the latest tech trends and biggest startup news. You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/bse-and-nse-closed-on-january-1-2025-check-what-stock-market-holiday-calendar-says-12901402.html",
    "original_url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxQbk13djd5cHJDWHFBc0RYa0xuTG1yU0RYRnhUeTRaY0JES1lmbnk0RzJHSFRFbmJKZk50RjhLdHN0bUVVd19TaXBKSW1Yb2lndWdJdnpYMmItUnIzRTE3TzlSY1laSEEtWUhrRk1HcWxpYjBlNjFRWmtGZTVXbTJlYUFCSFhrWjU2NW82YTEwSGxZaXgzX1RGSmQxWjQ4dE00U0ZGZ045WWZJSlBDLUdKVE4xWWZqLWxRMTkzdFRFTkR5QXRwQUxfYzF5WkM3VkVNM01mUUVLcmZETjF4UXEyedIB5gFBVV95cUxNbTJLRHFTMmZJZVJJWUdPZkhEX1ZsNGVKRHB6aWlRSUY4YWhEZWZac2VFQ2gzdXBWUkg4WjJmMmZkTWJ3Q1JJeGt1dHhXWmxoQ0daenZiTElqd0x0V2swOHh5TUUwbXl1LXNUUWtxNzFLRHhtd20zQ2ZIdUQzekJBQy0zVHgwcFdwaUlFUkItUDJWZkRMUjhRMDdFSk02emFrNGJlTHYzMlRmYW9ueDU1WERtMTJuQUt2bWJWVWtjQlF6NXJrVEFiWlVYbzJVVU5Qa3Z4UWFVdU9mSzVNVVZORW9XMWJ6QQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2430,
    "word_count": 412,
    "gnews_title": "BSE and NSE closed today? Check what stock market holiday calendar says about January 1, 2025 - Moneycontrol",
    "published_date": "01/01/2025",
    "publisher": "Moneycontrol",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Highlights: Nifty breaches 200 DEMA, indicates bearish sentiment. How to trade on Tuesday",
    "body": "As the Nifty index closed below the crucial 200 DEMA, technical indicators present a mixed outlook for the market. The Relative Strength Index (RSI) currently stands at 40.7, trending downward, indicating bearish momentum. In contrast, the Stochastic RSI showed a bullish crossover, hinting at a potential short-term recovery. This divergence in indicators suggests caution, as the market lacks a clear directional bias. Comments are moderated and will be allowed if they are about the topic and not abusive. Characters remaining (1500) Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-6-january-2025/liveblog/116977412.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQZHFLZlNidHJFcjJMNExvLVBiTTV2RFlkTjhDT0tRWFl0eG83STBXSXJTRkU5SXFhcEdOQUVxV1BJUEprclVhWjRYNVNpeFFMSHZrZ09ZWHFKbTNHNFppaGFZdGJjSTc5bmVKUmdmVWFSUHFmd2IwcWNkeW1BUzc3WkxsLW10SHVQWlJYdkdMVU5fTnVWZ1ZVazB5RDdPYkl1dHVSUi14UDdJZ0QzdElsRmRFMVpiRVQ3Mng5QVh3TzVwdzNJbS1uVWx1cmxUdC0tZy1qNTR30gHbAUFVX3lxTE5UMnJGUlN3YWVrVjJpYXlNU1RhOXl3S3NpdmlxRVRkRlNkWVpQM0VkMER2Mk56VVBVbjRkRXV2OURtcmhxa0NOTzlLTjk0OGJnczQzd0FocjgxYjBKcm1TdWtndldXb1ZxRWl2em82MTBWTVhxcmhHd081MVR1X29BTEcwbGZwdHN3d1Y2c1I1ajFaeHltNFVuUWlDTVdlS3laZzhaODcyU2NxWWxCOXpocnpOeUxGWEljSUJNdkhCXzAwZUN3NnhEcUYtYUd0aG1oRXR6bldOU2ZZUQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 734,
    "word_count": 114,
    "gnews_title": "Stock Market Highlights: Nifty breaches 200 DEMA, indicates bearish sentiment. How to trade on Tuesday - The Economic Times",
    "published_date": "06/01/2025",
    "publisher": "The Economic Times",
    "topic": "NSE India trading"
  },
  {
    "title": "Derivatives trading drops 38% on BSE, NSE in December due to Sebi curbs",
    "body": "Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 02 2025 | 4:11 PMIST Zubeen Garg death case: Festival organiser & manager arrested; what’s going on? RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US",
    "url": "https://www.business-standard.com/markets/stock-market-news/derivatives-trading-drops-38-on-bse-nse-in-december-due-to-sebi-curbs-125010200580_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxOY25CcU82cnBzTmN4RUxYQkhuV2lpd3BuTzVSb1RPMmo2YjE2NGJxTlFNNTVKenNXY205RmMwOGE4N1dURW1yaXJkU2lUQkNwVVA0UkVQejRLbVhOelRJUXFsWWJ4NG5ueHQzZFlUemhuaERrQW0xdDRVb3BxckdQWGh6cktSU05hRTZWWURBN2VwNmFKcVltSGxOdHg4M3FVMEJ2TkktcU1hUlA4b0Y0VjU2R2MtbklMME9STWNPT25HNERBLXkzdlJiTFl2dk43bGRWNHJFSmNZSEpmSFNoemIwRdIB6AFBVV95cUxNQVRGN1prVjdEbFhlUVJpV0JIcDN5VlFySGlpX2ItUlRKcjFyQUVVMXNUNXBsM0JDdzdqaHYwYllObzIwYW1vaVZWeXlNVk9RSG4yeHhkZXJtOEU0VHRodjZxVjBPOXNUVmRCUGM3ak01WXljSnBwMk1ULWxnS0JtZ0dUcWkwUmRueFdmOG80VGN6V05Fb0ZNQk1Bem42aHV1UThFaXl3NUdkOUw5VFVLSVhXdW9FZUhNdy1NMTFUZGJwUTVzQS1ycUxzUENUWXJJd2N6NEllNlpSR0YzS092OEgtbmtOWFJD?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 493,
    "word_count": 93,
    "gnews_title": "Derivatives trading drops 38% on BSE, NSE in December due to Sebi curbs - Business Standard",
    "published_date": "02/01/2025",
    "publisher": "Business Standard",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE to add 6 more stocks in F&O contracts from January 31",
    "body": "TheNational Stock Exchange of IndiaLtd (NSE) announced on Tuesday, January 7, that it will launch futures and options (F&O) contracts for six more securities starting January 31, 2025. This move aligns with the stock selection guidelines outlined by the Securities and Exchange Board of India (SEBI) in its circular dated August 30, 2024, and has been approved by the regulator. This decision is in line with the stock selection guidelines outlined by the Securities and Exchange Board of India (SEBI) in its circular dated August 30, 2024, and has been approved by the regulator. The securities newly added for F&O trading include Castrol India Ltd, Gland Pharma Ltd, NBCC (India) Ltd, The Phoenix Mills Ltd, Solar Industries India Ltd, and Torrent Power Ltd. Last month,NSEannounced the removal of futures and options (F&O) contracts for 16 securities. Starting from February 28, 2025, no new expiry contracts will be introduced for these securities. In November, the NSE added 45 new companies to its futures and options segment. Among the newcomers are Adani Energy Solutions Ltd., Adani Green Energy, Adani Total Gas Ltd., BSE Ltd., JSW Energy Ltd., FSN E-Commerce Ventures Ltd. (the parent company of Nykaa), and Zomato Ltd. The securities affected by this change include Abbott India, Atul Ltd, Bata India, Can Fin Homes, Coromandel International, City Union Bank, Gujarat Narmada Valley Fertilizers & Chemicals, IndiaMART InterMESH, Ipca Laboratories, Dr Lal PathLabs, Metropolis Healthcare, Navin Fluorine International, PVR INOX, Sun TV Network, and United Breweries. In November 2024, following the discontinuation of weekly contracts for Nifty Bank, FinNifty, Nifty Midcap Select, and Nifty Next50, the NSE modified the monthly expiry days for these four F&O contracts to Thursday, effective January 1, 2025. At present, Nifty Bank’s monthly and quarterly contracts expire on the last Wednesday of the month, while FinNifty contracts expire on Tuesdays. Nifty Midcap Select contracts have their expiry on Mondays, and Nifty Next50 contracts expire on Fridays. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/market/stock-market-news/nse-to-add-6-more-stocks-in-f-o-contracts-from-january-31-11736258544521.html",
    "original_url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPY1NDOXNYTThkUHl5MFczclR0Yk5IZWdCZS16VFFYQmhpWGt6U3psZHgyekJaUzEyb3ZTWEgxTzRQdTdCaFI3bV9vZDVYLVdLR25JWTFSMW9hbUN0cURDRDJFLURsNXZ3bDNOTWlMUFV3MDd2R2prQUZKX3lDVFlGR3FocHdjYUNEOXhGTWRvcV9jQXRNb1JBM0Fmb0k0cUhmQVJBYWRXMl9KV0dyOHhCSjFBVHBraWRVRGZ3bS11VXBheXRXcWfSAcsBQVVfeXFMTm9DY2dDaFhqUDR0TXpVSjd1cHhrVFV6aG5USU5xRExHOTlnNUJHT2lUTG5BVXZXRzgtSFJ3OGhnb3dZZlk2aEZwVEYwcW91SGk3VHhROEJkVFBlTGo1S05MVkFiQm5wcmw5NUZsQjdYOTh3OUdTSzhZSHh3aWJLWUQ0VnRqbUFNNmlPeWtWZ3RQTHFSSDNfdXFmV3lXeDY5WVJKVXkyV0dGT2NVQ21lZURnay16dkR6UVRNRnFGa0NPczM1SENaY0hmY0k?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2292,
    "word_count": 352,
    "gnews_title": "NSE to add 6 more stocks in F&O contracts from January 31 - Mint",
    "published_date": "07/01/2025",
    "publisher": "Mint",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE to introduce F&O contracts on 6 new securities from January 31",
    "body": "NSE to introduce F&O contracts on 6 new securities from January 31 The newly included securities for F&O trading are Castrol India Ltd, Gland Pharma Ltd, NBCC (India) Ltd, The Phoenix Mills Ltd, Solar Industries India Ltd and Torrent Power Ltd. By Jomy Jos Pullokaran January 7, 2025, 7:14:27 PM IST (Published) 2 Min Read The National Stock Exchange of India Ltd (NSE) on Tuesday (January 7) announced the introduction of futures and options (F&O) contracts on six additional securities, effective January 31, 2025. This decision follows the stock selection criteria prescribed by the Securities and Exchange Board of India (SEBI) in its circular dated August 30, 2024, and has received approval from the regulator. The newly included securities for F&O trading are Castrol India Ltd, Gland Pharma Ltd, NBCC (India) Ltd, The Phoenix Mills Ltd, Solar Industries India Ltd and Torrent Power Ltd. Also Read: NSE helps companies raise $19.5 billion in 2024, higher than every global market Last month, the National Stock Exchange (NSE) announced the exclusion of futures and options (F&O) contracts for 16 securities. Effective February 28, 2025, no new expiry contracts will be introduced for these securities. Among the affected securities were Abbott India , Atul Ltd, Bata India, Can Fin Homes, Coromandel International, City Union Bank, Gujarat Narmada Valley Fertilizers & Chemicals, IndiaMART InterMESH, Ipca Laboratories , Dr Lal PathLabs, Metropolis Healthcare, Navin Fluorine International, PVR INOX, Sun TV Network, and United Breweries . In November 20224, following the discontinuation of weekly contracts for Nifty Bank, FinNifty, Nifty Midcap Select, and Nifty Next50, the NSE revised the monthly expiry days of these four F&O contracts to Thursday, effective January 1, 2025. Also Read: MMTC gets warnings from NSE and BSE for stakeholders’ committee lapse Currently, Nifty Bank’s monthly and quarterly contracts expire on the last Wednesday of the month, while FinNifty’s expiry is on Tuesday. Nifty Midcap Select contracts expire on Mondays, and Nifty Next50 on Fridays. Continue Reading (Edited by : Shoma Bhattacharjee ) Check out our in-depth Market Coverage , Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18 , CNBC Awaaz and CNBC Bajar Live on-the-go! Tags NSE",
    "url": "https://www.cnbctv18.com/market/nse-to-introduce-futures-and-options-contracts-on-6-new-securities-from-january-31-19536071.htm",
    "original_url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNQnI2X1BvN01UNW5PVkdRVDk4TVlyTS1PSVNXc0pfbU55MlhlN21LQmdJYkhRMWZONENySGVzU05teTRsZjZSRVR5VUNEZUZHZ1laU2YxekpJQkRUQkgtVzc1eFc4ZE84TTVVZHdMOENQWnJXV0JzbktlWXdXa2JEanFQT0poTUxoTHVKTV81ZU9MSjQ5Y29ZVlg4UDl0LWFKWHllbTZ1MWNpTHJYenVJcUZqSEN1ZVY3TlJ1U3VRRTJZcjNvemfSAcsBQVVfeXFMUEhwUC1sZFRHRVNUc2duZ01JNE1GeWNkTjF3REZaZEt0ZXZCbDltejFoQjdkaFBMR0hFakJGZEJVNmNvT2lLV2pfazFHeHV4RmlMTjhiQ3dsa0VMXzExM2hWdnpjWTE5VjROejJCeHhEbmpQQlRDWXpoc2ZZMjdyZnNkWEZWa014RVNyYzQzSmVJSk5nckx3ek5DaURaTXlFLXBJU0Z2azBxTV94WG1Sb01sd0lianQxeHZOdFJSQXZRQUpXa0hwQnc3UzQ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2331,
    "word_count": 363,
    "gnews_title": "NSE to introduce F&O contracts on 6 new securities from January 31 - CNBC TV18",
    "published_date": "07/01/2025",
    "publisher": "CNBC TV18",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Crash Highlights: Sensex sheds 1,258 pts in broad sell-off, Nifty at 23,616; VIX up 15%",
    "body": "Stock Market LIVE Updates: Tech view Stock Market LIVE Updates: Expert view Stock Market LIVE Updates: Market expert view Stock Market LIVE Updates: A glance at broader market Stock Market LIVE Updates: Here's a look at Sensex gainers and loser at close Stock Market LIVE Updates: Here's a look at Nifty50 gainers and loser at close Stock Market LIVE Updates: Nifty50 finishes 388.70pts lower at 23,616.05 Stock Market LIVE Updates: Sensex closes 1,258.12 pts higher at 77,964.99 Stock Market LIVE Updates: Jai Corp, Zaggle, Kitex, CSL from BSE SmallCap freeze in lower circuits Stock Market LIVE Updates: Cipla launches CipAir mobile app for first-line asthma screening in India Stock Market LIVE Updates: Capital Infra Trust IPO opens on Jan 7: Check GMP, dates, other key details Stock Market LIVE Updates: 3 PM market update - Sensex, Nifty trade with deep cuts Stock Market LIVE Updates: CLSA 2025 India portfolio: TaMo, NTPC, Nestle, Britannia in; HDFC Bank out Stock Market LIVE Updates: HDFC Bank stock can dip to Rs 1,500 if breaks this support; key levels here Stock Market LIVE Updates: This PSU stock zoomed 43% in 2 days; market cap crosses Rs 50,000 crore Stock Market LIVE Updates: F&O Market: Union Bank, Dabur see short build-up as Nifty tumbles 300pts Stock Market LIVE Updates: Nykaa rises 5% on Q3 update; JM Financial keeps it among top new-age bets Stock Market LIVE Updates: CLSA 2025 India portfolio: TaMo, NTPC, Nestle, Britannia in; HDFC Bank out Stock Market LIVE Updates: Aegis Logistics soars 14% in weak market on heavy volume Stock Market LIVE Updates: 2 PM market update - Sensex, Nifty continue to trade lower Stock Market LIVE Updates: Arkade Developers adds 3 redevelopment projects, eyes turnover of Rs 2,150 crore Stock Market LIVE Updates: Demand buoyancy pushes services PMI to 4-month high of 59.3 in December Stock Market LIVE Updates: Two HMPV cases detected in Karnataka, states monitoring situation closely Stock Market LIVE Updates: HMPV virus, Trump inauguration, FII selling: Why Sensex crashed 1200 points Stock Market LIVE Updates: Mobikwik Q3 results: Should you buy stock ahead of nos? What analysts say Stock Market LIVE Updates: Mphasis share pops 3% as Jefferies initiates with 'Buy', sees 21% upside Stock Market LIVE Updates: 1 PM market update - Sensex, Nifty trade with deep cuts Stock Market LIVE Updates: Brigade Enterprises shares rise after acquiring 20 acres land in Bengaluru Stock Market LIVE Updates: Gensol Engg bags Rs 1,061.97-cr solar PV EPC and 3-yr O&M deal from PSU client Stock Market LIVE Updates: Airtel enhances network coverage in Prayagraj ahead of Maha Kumbh Stock Market LIVE Updates: ITC demerger: 7 hotel stocks with up to 15% upside potential as per charts Stock Market LIVE Updates: Page Industries elevates Karthik Yathindra to CEO role, effective from April 1 Stock Market LIVE Updates: Quick-service restaurant stocks in demand: Jubilant, Devyani rally up to 5% Stock Market LIVE Updates: 12 PM market update - Sensex, Nifty trade with deep cuts Stock Market LIVE Updates: ITC stock adjusts for hotel biz post demerger; check latest share price Stock Market LIVE Updates: Leo Dry Fruits IPO allotment today; check status, GMP, listing schedule Stock Market LIVE Updates: Happy Forgings board approves Rs 650-cr capex for heavy-weight components facility Stock Market LIVE Updates: Jubilant FoodWorks share rallies 4.5%, hits 52-week high post Q3 update Stock Market LIVE Updates: Ajooni Biotech to raise Rs 45 crore, with issue of 5 crore convertible warrants Stock Market LIVE Updates: NTPC Green shares gain 4% in trade; What's boosting upmove in stock? Stock Market LIVE Updates: Bajaj Finance share rises 3% on robust Q3 business nos.; brokerages upbeat Stock Market LIVE Updates: 11 AM market update - Sensex, Nifty trade lower Stock Market LIVE Updates: Here's why AU Small Finance Bank shares advanced 3% in trade today Stock Market LIVE Updates: Last day! Parmeshwar Metal closes today; Subscription rises 45x, GMP up 65% Stock Market LIVE Updates: Pritika Auto begins making components for leading int'l tractor manufacturer Stock Market LIVE Updates: Analysts bullish on Standard Glass Lining IPO; eye long-term potential Stock Market LIVE Updates: Titan extends gain post Q3 business update; stock rallies over 8% in 3 days Stock Market LIVE Updates: Weekly Outlook: Key levels to track on Sensex; Nifty headed towards 24,600? Stock Market LIVE Updates: ITC price adjusted by Rs 27 to Rs 455 on BSE; Rs 26 to Rs 455.60 on NSE Stock Market LIVE Updates: 10 AM market update - Sensex, Nifty maintain opening gains Stock Market LIVE Updates: Nifty Consumer Durables is top sectoral gainer Stock Market LIVE Updates: Index heatmap check Stock Market LIVE Updates: Broader markets trading with slight gains Stock Market LIVE Updates: Nifty opens at 24,045.80 Stock Market LIVE Updates: Sensex opens at 79,281.65 Stock Market LIVE Updates: Nifty rises 41 points in pre-open Stock Market LIVE Updates: Sensex up 76 points in pre-open Stock Market LIVE Updates: BSE, NSE to hold special session for ITC-ITC Hotels demerger: What we know Stock Market LIVE Updates: Angel One's ADTO climbs 10.8% YoY, drops 11.9% QoQ to Rs 39,347 bn in Q3FY25 Stock Market LIVE Updates: BSE, NSE to hold special session for ITC-ITC Hotels demerger: What we know Stock Market LIVE Updates: Weakening rupee may not be shot in the arm for India's pharma exporters Stock Market LIVE Updates: Auto component companies focus on new markets, products as growth slows Stock Market LIVE Updates: Govt to switch on massive subsidy to supercharge EV infrastructure Stock Market LIVE Updates: Healthy order books may lift bottom lines in capital goods sector in Q3 Stock Market LIVE Updates: Defence stocks lock and load for order-driven growth offensive in Q4 Stock Market LIVE Updates: Bajaj Finance's assets under management grew 28% in Q3 Stock Market LIVE Updates: Nykaa expects consolidated net revenue growth to be higher than mid-twenties Stock Market LIVE Updates: A break-tape stumble can't halt mutual fund AUM sprint to finish Stock Market LIVE Updates: Correction opens upside despite earnings cuts: Franklin's Rengaraju Stock Market LIVE Updates: Falling poverty claims in SBI report spark concerns about methodology Stock Market LIVE Updates: India's FY25 GDP growth likely to remain in 6.4-6.8% range: Experts Stock Market LIVE Updates: Stocks to Watch, Jan 6, 2025: Nykaa, HDFC Bank, Bajaj Finance, HUL, RIL Stock Market LIVE Updates: KEC, Tata Motors: Osho Krishan of Angel One picks 2 stocks to buy today Stock Market LIVE Updates: Markets Today - Dec PMI; FIIs; Wall Street up; Standard Glass Lining IPO Stock Market LIVE Updates: Asian markets mostly lower Stock Market LIVE Updates: US markets climb Stock Market LIVE Updates: Good morning readers! Track the latest live market updates here Don't miss the most important news and views of the day. Get them on ourTelegram channel First Published:Jan 06 2025 | 7:44 AMIST Zubeen Garg death case: Festival organiser & manager arrested; what’s going on? RBI keeps repo rate steady, PM Modi on 100 years of RSS, Cabinet approves 3% DA hike & more US government shuts down: Why did it happen and who gets hit the hardest? | Trump | US news US' tariffs on lumber and furniture: How it might be a big win for India | Trump tariffs | India-US",
    "url": "https://www.business-standard.com/markets/news/stock-market-live-updates-sensex-nifty-jan-6-nse-bse-standard-glass-ipo-gmp-today-125010600071_1.html",
    "original_url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNT3hNcWpEUnRiVUtUbGFDYUVCdG91Y1pLOXM3SFhlMFJfMnZ0T0J5MS13czM0MDBiN3JyZ0QyckgzUG9IWVVWUzZMVFlMZllyRzRlUUZSR3RJVlBpbVEtdnVBMGE1MWFfWFZwdGVJTThrdHJ2LU9TanJYc1ZCQnZFanlsTVQtODE3Q01ObVlLNHZWeGtEcVRMdk95UUhwZnhLTnFoOWNSWVRCRVpqSV9Ma2k1Z0dqZEdpVDNtWGpBN2xUeWFuM2hRSElzWlpLMEg2TEVVN1licmowaEdHVHRSR3Rn0gHnAUFVX3lxTE4yM05tTWFUWDBfWkt0OHJJRGUzQlRZWWRWamRsNXZpanpJMU1KamQxY3lFbXM0S1hwa0U1RjhlZm55cVRoWVJvai1MOV9VR2FLVTd4RktSYUdFdklPWWtqbFhBanRhZjBtUkYtYzFFZDdhNExwdng4MFIxMkx6RGR3bV9Qc2ZGdTJrVmdDVWFJeGJDXzNiQVBZWlF3MVlMVHVfSUhBc04xRzhtTmZTYU1GWUJVZ1Y5OWZUWVEtZ0taUkw2RURZdTdEaUdZdkotSXlJUS1hSjhjTWhDY1lCSVRFZFJ4X0dNMA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 7366,
    "word_count": 1201,
    "gnews_title": "Stock Market Crash Highlights: Sensex sheds 1,258 pts in broad sell-off, Nifty at 23,616; VIX up 15% - Business Standard",
    "published_date": "06/01/2025",
    "publisher": "Business Standard",
    "topic": "NSE India trading"
  },
  {
    "title": "Stock Market Holidays 2025 List: Dates when NSE and BSE will remain shut – Check trading holiday calendar",
    "body": "While major stock markets around the world observed a holiday on New Year’s Day, with no trading on January 1, 2025, the Indian stock markets remained open as usual on Wednesday. The Indian stock markets – the Bombay Stock Exchange (BSE) and the National Stock Exchange (NSE) – will observe their first holiday of 2025 on February 26, for the occasion of Mahashivratri. According to the official holiday calendar released by the BSE and NSE, the stock markets will remain closed on 14 days this year. These include major religious festivals such as Eid, Diwali, and Christmas, as well as national holidays such as Independence Day and Gandhi Jayanti. As financial markets gear up for a better run in 2025, here’s the complete list of BSE and NSE holidays: In 2025, the festival of Deepawali will be celebrated on October 21. As per the NSE, the schedule of 'muhurat trading' on Laxmi Pujan will be announced via a separate circular in October. Which trading holidays are falling on Saturdays and Sundays? The current holiday calendar includes only 14 non-trading days, as four gazetted holidays fall on either a Saturday or Sunday. In India, stock markets do not operate on weekends. The four holidays falling on weekends are as follows: Discover the latestBusiness News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated! Find the best of Al News in one place, specially curated for you every weekend. Stay on top of the latest tech trends and biggest startup news. You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/stock-market-holidays-2025-list-dates-when-nse-and-bse-will-remain-shut-check-trading-holiday-calendar-12901880.html",
    "original_url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxPRW5CZzc0Vk5VYjBuYUJsVDlNTkx1OXN0TXhIbzBIY2FWZWNtb3NPTTctUG5yY2Z3d3lnVlBDWTY0RjVuNkF1b19JVm1taHRveUZoV05RbTBlZ29Vb3MtZk5rd3czd3cyUWtHZ1BWb1FKUWdLNGxzX182WlRhcV8tTFlaMTlRemtTQl9LM2pTMWhwcTNRTUltcWwyRmxMS3oyeGVDMFZlSE9PYUtrVnBtOEVTd01TYmZLTGN1SjBONzduQXdDaEZWRzJMdkJSTUQ5eXk0SFhNUG5RUmREcDFKT2NTVEdtcWgyZlk4UzNLS0xJTzBJMGxtbkhVONIBgAJBVV95cUxPVjZLbXRHZkEzUHZWUFlOZlJ1UHdUZGtSaU1WR2lHUzg5RHpHbTljMC1hR0t2a0U1RXRRRXdFckJsSi1aZVFqVkJ2OTlXR2JMMEJGMUhQRDdNNXU1SUFTNGkwWGQyblN5aGxsUjRyVHlVQVdOclFjQXpnX2IwRVdfR2FIYmdqSUVrSERyRWJ3Z1BaTTIwakRPeXdlQnhhdkxJbFBua3lpS1k3dzdVMFdLT2luV3E5djVXU0R1aDY0dVRNdURON1R2SUk2ZmZ4MTBfbTdKTVFCb0FtRkhyWUZ1azJzRnRXOE1nUU5Xel9rTkl0TDJyVnY1bW1yODNYbTgx?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1607,
    "word_count": 261,
    "gnews_title": "Stock Market Holidays 2025 List: Dates when NSE and BSE will remain shut – Check trading holiday... - Moneycontrol",
    "published_date": "02/01/2025",
    "publisher": "Moneycontrol",
    "topic": "NSE India trading"
  }
]