[
  {
    "title": "Sebi fines NSE Rs 1,100 crore, bans two ex-MDs in brokers’ scam",
    "body": "Partha, senior assistant editor (markets) at The Times of India, Mumbai, covers the financial markets, mainly the stock market, mutual funds, banking and insurance sectors. He is a sports enthusiast. His hobby is philately.Read More 10 Most Affordable Cities in India to Buy a House The Pros and Cons of Investing in Value Stocks Most Visited Monuments in India Investing in Small-Cap Stocks: Top 10 Tips for Absolute Beginners 10 Ways to Earn Money Online by Selling Physical Products Richest Cricket Players Across the World 10 Things You Didn’t Know About Warren Buffett’s Investment Process Top 10 Benefits of Investing in Small-Cap Stocks Priyanka Chopra Net Worth: Know How Rich is Global Actress How to Make Money Online With Writing and Blogging? A SIP calculator is a simple tool that allows individuals to get an idea of the returns on their This financial tool allows one to resolve their queries related to Public Provident Fund account. When investing in a fixed deposit, the amount you deposit earns interest as per the prevailing... The National Pension System or NPS is a measure to introduce a degree of financial stability... Mutual Funds are one of the most incredible investment strategies that offer better returns... These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "url": "https://timesofindia.indiatimes.com/business/india-business/sebi-fines-nse-rs-1100-crore-bans-two-ex-mds-in-brokers-scam/articleshow/69121635.cms",
    "original_url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPbzFLYnJPWUxxVHc2YnA4QXpxcnpxWXRxclVfaVBLNEF4cnAtdGliWEhZX3Z0SDVXU3hhcjAxVEY5RHJRMVBnLWplbkppWlhwXzhaenZ2MV9PdktQSm5pNmpuZ2lNamJJeGVwTkhnVnRHWlE1U0hwcGJpUXY3Q1pHQTVLSk4xcVdVbXZpeDk4ek11TWpCcExjZzZnNUNXMzZvWVIxVlRldWxEYUJIWFFnRlIzbnh3V2xhOUdxVjZ0Z2pZSWcxRG9kaFBtSElNWFphUkhFRTdaMl9YbXYtbVHSAeMBQVVfeXFMTlBSU2FZRHFXazhNSXZjSm11b1FMV081UG5GNXAxRHVYTW53SmtJNk02cTBJNGhaY2syVU10RUNYRFBzck9OczZyNG5xeDJ3N3l1OFlnT2Y0d2F2YnozVmlialpPbHZRd1NySUl6bzNlUmhQdmhVYTFMbFNRd0F3REdsUTMwdHBQMFVfQ1VaZUxfOVB3VDFTLXk1LTVlU1NBQ3pqd2FRbzBpUEd6TjRRZWd0R2o4eTM5U1g0MlRCa0ZCMXRJVnBqNDc3MEFUOVVfRzRHS2NqbE05VXVPcjFWcFg0WDA?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3228,
    "word_count": 554,
    "gnews_title": "Sebi fines NSE Rs 1,100 crore, bans two ex-MDs in brokers’ scam - The Times of India",
    "published_date": "01/05/2019",
    "publisher": "The Times of India",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE gets CFTC exemption for derivatives trades",
    "body": "The National Stock Exchange (NSE) has become the first Indian exchange to get an exemption from the Commodity Futures Trading Commission (CFTC) that will allow members of the Indian bourse to trade in derivatives for U.S. clients. “The order issued to NSE permits its members to accept U.S. customer funds directly for the purpose of trading in futures and options contracts on NSE without the members having to register with the CFTC as a futures commission merchant,” stated a release by the NSE. “The [CFTC] issued a Part 30 exemptive order dated May 17, 2018 to the National Stock Exchange of India (NSE) as part of its program of regulatory deference to foreign regulatory frameworks. Part 30 exemptive program of CFTC provides U.S. customers with increased access to foreign futures markets,” the release added. CFTC is an independent agency of the U.S. government that regulates the futures and options markets and monitors various organisations related to derivatives clearing, futures commission merchants and swap data repositories among others. SEC recognition for BSE Incidentally, the development comes just days after the BSE becoming the first Indian exchange to be recognised as a Designated Offshore Securities Market (DOSM) by the U.S. Securities and Exchange Commission (SEC). The DOSM status allows the sale of securities to U.S. investors through the trading venue of BSE without registration of such securities with the U.S. SEC and thus eases the trades by U.S. investors in India.",
    "url": "https://www.thehindu.com/business/markets/nse-gets-cftc-exemption-for-derivatives-trades/article23930246.ece",
    "original_url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPcGc0UGtGd0JDSS1TN0RXT2pCWUhua1RXOXlJenl5MXplOU1McUJIZUNuczVCRVBxWEVicU0xc2tOci1pUHFKeTJQeEI5ZTJjV3pXdER0NndwWVJpbUhyYUFGb3RpX1ZGdnZqLUlud3VySXMxN01ncFo5SjkyZVBCZEUwajd2V0E0SVBUNmdHWk5qbmlQenk2MnllT0g2dUpqNFBFVDJPZUNzTk1U0gGzAUFVX3lxTE5PRFQtRGFrV0hwLXQzbS04NDEyYkpkMlVXS0tPNVpJbF9XelRVZEQzSkNsaUNPcl9tWko5TF9janpvZGYyc1RBUU13R2xjcEhKb0J6VG1WT0ZuVlhfUEdrY2tpLUI3SWVjMUNodXJkYjZZb3R0cWNIYmRrS3BqSTl1elNLWjJtVEUtdnlYRkxZN1RFelNzeGo3dV9hY0FjQWJZWGVQRTc4WUF5SDhhOWZfQkUw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1504,
    "word_count": 239,
    "gnews_title": "NSE gets CFTC exemption for derivatives trades - The Hindu",
    "published_date": "18/05/2018",
    "publisher": "The Hindu",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE applies for extending equity derivatives trading hours till midnight: Sources",
    "body": "The National Stock Exchange has written to capital and commodity market regulator SEBI, seeking approval to extend the time of equity derivatives trading till nearly midnight, sources told Moneycontrol. The NSE, India's top stock exchange, is looking to start a second trading session between 5:00 pm and 11:55 pm, only for equity derivatives, after the regular session ends at 3.30 pm. It is not clear whether trading will be held in single-stock derivatives or only index derivatives in the absence of a cash market during the second session. In May this year, SEBI hadallowed stock exchangesto hold trading in derivatives between 9 am and 11.55 pm. NSE accounts for about 90 percent market share in equity derivatives in India. The other major exchange, BSE, has not been known to have applied for an extension in trading times, even though both exchanges tend to align their trading sessions with each other. Currently, commodities exchanges such as MCX and NCDEX conduct trading in derivatives of some agri and non-agri commodities. Brokers saythey would resistany move to keep trading open till midnight, as they do not see enough business post regular trading hours to compensate for the additional operating costs they will have to incur. Plus there are also concerns on how effectively an equity derivatives market will work in the absence of a functioning cash market. A market participant told Moneycontrol, \"On the commodity side, SEBI is trying to connect the spot price to the futures price but there will be a disconnect on the equity side, which will close for trading at 3:30 pm.\" Many trades, such as hedging or arbitrage, require traders to initiate positions in both the cash and the derivatives market to work effectively. A source close to SEBI told Moneycontrol that the regulator had \"given the option\" to exchanges on the issue of extending trading times. \"Whether they want to increase it or not, it depends on the exchanges,\" the source said. Discover the latestBusiness News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated! Find the best of Al News in one place, specially curated for you every weekend. Stay on top of the latest tech trends and biggest startup news. You are already a Moneycontrol Pro user.",
    "url": "https://www.moneycontrol.com/news/business/markets/nse-applies-for-extending-equity-derivatives-trading-hours-till-midnight-sources-2758681.html",
    "original_url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxOQnptS2lLS2lTbmFIVnp0S0hJbWRmYk54Y1U1NWRNZjFmdDdIZGFmeXczclZNVzhzaHh1RjlUN3d0MmprQVRCb0sxYkY4TWJ4NzlQYmFMMTZYYzBRUndxN0IwemhRc01zdExocktURnpPdGVpdTVMOTJaSkViUWxBejF4aHhfbXJIUWRfbkpVa2NtcG1DdWxvNVg2LWUzdHlWVkh4NTNFU0NVcUJSUjdhdXF3Z3NJNHIzRmNaRzdURXJZcWtXWklxcnNzQjJsbEVjaU11dlNvMnVZa0tC0gHiAUFVX3lxTE5IX2tUaUpnQndUTXFfOWxfWGNXX1UyZ1VNcjhMWFVhQlN5ZzlhT1lpWW1KbUlWbkVlaER4R2wzRE43MXl2b01wQ3Rsck9YYXlCNC1XSjUyeFBNN21wLXI2MXFqX2gxdExmNWswT0xXcTU2YXJoa2xYdDF3YzdoYzdCUXcyWGVrT2x1c3VjM0phYkpWME1kQ2J6UWxGU2otTDgtVk9iaHRHTm9IOFY5MElua21YZVhUUHY2eXNxenVfT2tPY2JsTHExbUFTNmlJMW5Ga3dRbU9wYjhJZzc4UEdHUFE?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 2339,
    "word_count": 377,
    "gnews_title": "NSE applies for extending equity derivatives trading hours till midnight: Sources - Moneycontrol",
    "published_date": "25/07/2018",
    "publisher": "Moneycontrol",
    "topic": "NSE India trading"
  },
  {
    "title": "Singapore Exchange to continue SGX Nifty trade despite India dispute",
    "body": "An SGX sign is pictured at Singapore Stock Exchange July 19, 2017. REUTERS/Edgar Su/Files Purchase Licensing Rights , opens new tab MUMBAI (Reuters) - The Singapore Exchange (SGX) said on Saturday a court-appointed arbitrator had told it to continue listing and trading SGX Nifty contracts beyond August 2018, during a dispute resolution with India's National Stock Exchange (NSE). The two exchanges have been locked in dispute after India's three main bourses unexpectedly announced in February they would stop licensing their indexes to foreign bourses from August. SGX responded that it would launch successor products to its flagship Indian equity derivative products on June 4. Now NSE and SGX have been ordered \"to facilitate the continued listing of SGX Nifty products for at least two successive contract month maturations beyond the arbitration's completion date\", SGX said in a statement. The arbitrator has also asked SGX not to offer its proposed new India equity derivative products until the final decision, it said. Advertisement · Scroll to continue \"Arbitration proceedings are continuing and the hearings on evidence are expected to commence in early 2019,\" the statement said. SGX had postponed the launch of a set of new India derivatives products after an Indian court in May referred a dispute around the proposed offerings to an arbitrator. In a statement issued on Saturday, NSE also confirmed the interim order of the arbitrator. The NSE had sought an interim injunction against the launch on grounds that the offerings infringed the intellectual property rights of its unit India Index Services and Products (IISL), which runs the Nifty index. Advertisement · Scroll to continue The Bombay High Court then asked a senior retired judge to arbitrate in the matter, and resolve the issue by June 16. However, the June 16 interim order, which was reviewed by Reuters, laid out a timeline for filing of claims and counter-claims and set Nov. 21 for hearing of the issues, with further directions to be provided on June 18. Over the past two decades, SGX has become the most popular market for foreign investors to bet on Indian equity indexes, with Nifty 50 futures SINc1 tracking the NSE's main index .NSEI. Advertisement · Scroll to continue But NSE, BSE Ltd and Metropolitan Stock Exchange moved to end licensing deals with foreign bourses so as to stem the loss of trades to overseas rivals, following SGX's plans to launch trade in single-stock futures contracts. The Indian government backed the decision, as it is keen to draw investors to an international financial centre being developed in Prime Minister Narendra Modi's western home state of Gujarat, sources say. Reporting by Abhirup Roy and Devidutta Tripathy; Editing by Clarence Fernandez and Ros Russell Our Standards: The Thomson Reuters Trust Principles. , opens new tab Share X Facebook Linkedin Email Link Purchase Licensing Rights Read Next 7 mins ago Middle East category Italy and Greece call on Israel not to hurt Gaza flotilla activists 5 hours ago United States category US government shutdown begins as partisan division rules Washington 3 hours ago Europe category Ukraine's frontline cities filled with dread and defiance 1 hour ago ANALYSIS Netanyahu gambles Trump Gaza plan may win back support abroad but risks lurk at home 1 hour ago China category China holds National Day ceremony in waters off atoll claimed by Philippines 1 hour ago Middle East category Israel ramps up Gaza City offensive as Hamas weighs Trump plan",
    "url": "https://www.reuters.com/article/world/singapore-exchange-to-continue-sgx-nifty-trade-despite-india-dispute-idUSKBN1JC092/",
    "original_url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPUV8wbW9qQWxLZExrcnZmZVd2cXp2OGFTQ3JhS3dkVkdCQ3pkV2NxbUhQZldqeU4yclhUMUZGQXdYWE5UT2ZIdkl0ZHlQLTFncDUzeGxZTjBsbTh3bzhNRTR4Vkx0Z29DcjNjQTB1OGxiRS1seHRLUlJtUF92SFBwWGpiYzBuRktUR0RyV1FaTlpUNGtrbFlfcVVaNHdIcGdyNWM2SUx1YkpyN1FnR2JIdjZWelYwSGVMWndwdS13?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3524,
    "word_count": 569,
    "gnews_title": "Singapore Exchange to continue SGX Nifty trade despite India dispute - Reuters",
    "published_date": "16/06/2018",
    "publisher": "Reuters",
    "topic": "NSE India trading"
  },
  {
    "title": "BSE, NSE to conduct special 'Muhurat' trading session tomorrow; markets to be closed on 7 and 8 November",
    "body": "The Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) will conduct a special ‘Muhurat’ trading session on Wednesday, 7 November. The ‘Muhurat’ trading, which is conducted on Diwali day will be held between 1700 hours and 1830 hours, the stock exchanges said. The stock markets would remain closed on Wednesday and Thursday for ‘Diwali Laxmi Pujan’ and ‘Diwali Balipratipada’. [caption id=“attachment_4632741” align=“alignleft” width=“380”]Representational image. Reuters.[/caption] On Tuesday, shares jumped, boosted by strong quarterly corporate earnings so far and gains in large-cap stocks such as Reliance Industries Ltd and Tata Consultancy Services Ltd. The broader Nifty was up 0.24 percent at10,549.7 as of 0546 GMT, while the benchmark Sensex was 0.32 percent higher at 35,064.11. Primarily, a good set of corporate fundamentals is driving the buying and the recovery today, said Deven Choksey, founder, KR Choksey Investment Managers. Broader Asian shares were supported by gains on Wall Street although the trading sentiment was tempered ahead of the US midterm elections, the first major electoral test of President Donald Trump’s big tax cuts and hostile trade policies since assuming office. In India, Jaguar Land Rover-owner Tata Motors Ltd led the gains, rising as much as 5.4 percent to a four-week high after data from a UK auto trade association showed a surge in Jaguar registrations in October.--With inputs from agencies The Tata Harrier EV and Mahindra XEV 9e are new electric SUVs in India. The Harrier EV has a modern, familiar design, while the XEV 9e features a bold, striking look. They cater to different preferences: the Harrier EV for subtle elegance and the XEV 9e for expressive ruggedness.",
    "url": "https://www.firstpost.com/business/bse-nse-to-conduct-special-muhurat-trading-session-tomorrow-markets-to-be-closed-on-7-and-8-november-5511661.html",
    "original_url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxOWXpzYVFJbmp0YzBockRNWFdWa2tuRHVPYlhyQ0dJTVhMaHZIYlFrNVdObERhdmpBRTloY3RaRlBxNnZBQWZqX3FIT2dRVlhib254YmJBVWx3c19ldVFsaE95MVhNMEZERk1NNi1Nay01SHdOMVNsbmRpeGIxWXEzWURVWXdRTjBCRE9fa3F4NWdKLW81WDluOWFmSHE1TkZoV1ZIOHU3emVLdG9vUkpNZ0VESHpOUlNTdTdDQV9SMm9uSW9DU0tZY2dBdUxaTVFfb3lNWlJWLUJXTFdWMUtvZDB30gHnAUFVX3lxTE1DZUotd1ZscE9KLUdkRElGU1NCWTYybW1zRzYtU3NNYkFNWjljSnQ1eWhiYUJrdWJxdjVWY0R0c0lKOEg3SE9zNjdmMmRIZnlBa21aVGVSZDdRRGpDeWtrSzNKS2N2SktKcnljOVBmWjAtUjcyU3hBY19xaE1fS3BWcW9WOFNkbU1pT3ZSdi1zdWdqd1ZrVVR4bTY5azdDLTA5dmU1Q0ZLcmJxZGhQdGEzRlRpYnlBYWVKVXdfcGwteU1Xd0NSYTVRU0xSTUJ3SXhIeG9HX3J5dFo2emdCdWMtRk5tQndzbw?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 1735,
    "word_count": 268,
    "gnews_title": "BSE, NSE to conduct special 'Muhurat' trading session tomorrow; markets to be closed on 7 and 8 November - Firstpost",
    "published_date": "06/11/2018",
    "publisher": "Firstpost",
    "topic": "NSE India trading"
  },
  {
    "title": "Sebi begins probe into trading glitches at NSE and MCX",
    "body": "Market regulator Securities and Exchange Board of India (Sebi) has started investigating last week’s technical glitches and trading halts at the National Stock Exchange of India (NSE) and the Multi Commodity Exchange Ltd (MCX), two people aware of the matter said. “The regulator has sought a report from both the exchanges that have suffered technical glitches and trading halts for the second time within a year. Sebi will analyse the reports by the two exchanges and will respond in terms of corrective measures and actions,” said one of the two people quoted above. An email sent to a Sebi spokesperson was not answered. NSE was forced to halt trading for around three hours at the start of 10 July last year because of technical issues. On Thursday, it’s Neat on Web (NOW) systems suffered a software shutdown during trading hours. Normal trading was not disrupted as the members had alternative modes of connectivity during the disruptions. A spokesperson for NSE said, “NOW is a shared CTCL system which had a temporary disruption and has been rectified on the same day and the system was up and running. NSE trading platform is completely different and functioned smoothly with full efficiency that day.” MCX suffered a trading halt in September last year and a repeat occurred on Friday when trading was halted twice. The first time, the systems halted for more than an hour at 7:12 pm and a second time at 10:11 pm. Normal trading resumed at 11 pm. “Data integrity and other checks have been performed to satisfy and assure that there has been no impact on any of the surveillance, risk margining and any other pre or post-trade activities,” said MCX but declined to comment on a specific query. MCX’s preliminary analysis shows that there was some aberration in the low-level network layer but a detailed analysis of hardware and underlying operating systems is pending. “It is the frequency of trading disruptions that is worrying. While Sebi typically has not penalised exchanges for trading disruptions, it cannot be ruled out if it causes any loss to market sanctity,” said the second person quoted above. “There is certainly a need to strengthen the monitoring system. Sebi will ensure that there is a proper monitoring of the technology being dispensed and that no investor is put at loss due to disruption,” he said. Due to malfunction at NOW, thousands of orders placed by hundreds of brokers were repeated by the system a number of times and in some cases, hundreds of times resulting into unintended trades for brokers/clients. The Association of National Exchanges Members of India (ANMI) in a communication has even requested NSE for compensation as system fired multiple orders on its own, resulting in trades. “It was not a breakdown of trading, rather a malfunction which resulted in firing of multiple orders resulting in trades from NSE’s NOW system,” said ANMI in a communication to Sebi, a copy of which has been reviewed by Mint. The Indian Council of Investors, an investor association, has also written to Sebi calling for unintended trades at NSE to be annulled. “Brokers/investors should not be made to face the adverse consequences and financial loss resulting from this system malfunction of NOW,” said the investor association in the letter. Catch all theBusiness News,Market News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates. Log in to our website to save your bookmarks. It'll just take a moment.",
    "url": "https://www.livemint.com/Money/xoef00NWyeAYWzCTfPHT9O/Market-regulator-begins-probe-into-trading-glitches-at-NSE-a.html",
    "original_url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOQy1RNnE5LVBha0RlZ3N0ME5WZE5HQzlKWDJ5X2tXU25UM0pDeVZFdDJ1UmhoMkw3WUlXdFE5Z1ZxemZ3bFBBVDJ4YUFxbXlYNEcxa0JjMElFajNidFpKTXZGMFVtN09qRjg4TGFGcHN3d1E2em0wRkFQUGstR0xYOGgxUmViN0NKNDR1YnlMUkFuVzNQWHlnVmtHYU9NMTFoXzdhSnVIdUx3bGZpbVUwdE4tSVhJdG5OZGk00gHIAUFVX3lxTE5keUEtaDd0VWMtNGVDVnJTZUpNNEE3YmxTNkUybXpPWTdDQzJVQmpQZ3JNN3FzY2VwOFczSnpqb0hoV1ViQ3RVSVpJRXhDdV9IZ0RIYTFQWUhnZHJxUXRiUE82bGRRcmRZSlA5WGUxWUI4clItRG9URmEzOW00RnFZeHhOMnljSlk2c25hZ0lQNEgzRWZaYlZZRGpIRXFERDNVLXluRnQ5V1I4UFBMU2pFNXFCVGMtRW9SbUtTMzRKQlN5N1J3dkJZ?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 3500,
    "word_count": 578,
    "gnews_title": "Sebi begins probe into trading glitches at NSE and MCX - Mint",
    "published_date": "29/05/2018",
    "publisher": "Mint",
    "topic": "NSE India trading"
  },
  {
    "title": "NSE to launch weekly options on Nifty index",
    "body": "ThinkStock Photos The weekly options of the Nifty index will have seven consecutive weekly expiry contracts excluding the week where monthly contracts expire. NEW DELHI: National Stock Exchange of India has secured permission from the Securities and Exchange Board of India to launch weekly options on the Nifty index. The launch of options contracts on the 50-stock index is likely to increase volumes in the option segment and provide a hedging tool to market participants. The exchange had launched weekly options on the Bank Nifty in 2016 and more recently, it had launched weekly options in the currency derivatives segment on the USD-INR currency pair. “With the successful launch of weekly options on the Nifty Bank index, there was demand from the market participants for a similar product variant of the NIFTY 50 index. The weekly options on Nifty50 index provides an additional hedging tool for market participants to manage the portfolio risk more effectively,\" said Vikram Limaye, MD & CEO of NSE . The NSE said that it is currently evaluating the readiness of market participants for the product launch and will announce a launch date shortly. Live Events The weekly options of the Nifty index will have seven consecutive weekly expiry contracts excluding the week where monthly contracts expire. \"It could push the volume and participation in options segment like in Bank Nifty weekly contracts, which is seeing huge participation. Already, index option segment has contribution of 90 per cent turnover in the total turnover of NSE F&O segment,\" said Chandan Taparia, derivative analyst at Motilal Oswal. Taparia said traders could get opportunity to do pair trading in the Nifty and Bank Nifty weekly options. On expiry of a weekly contract, exchange will introduce next weekly contract on rolling basis. The existing three monthly options contracts, three quarterly and eight semi-annual option contracts will also continue to be available, said NSE. The contracts will expire on Thursday of every week. In case the Thursday is a trading holiday, the previous trading day will be the expiry/last trading day, said NSE. The exchange said that the strike interval for the weekly options will remain the same as monthly contracts. Rajesh Baheti, President of Association of National Exchanges Members of India believes that the weekly options on Nifty index will increase volume across the market but there could be a drawback in terms of higher liquidity in the weekly options contracts compared to the monthly options contracts. \"Liquidity on the monthly Nifty options contracts may go down if market participants start trading more in the weekly options,\" said Baheti. Baheti believes that unlike the Bank Nifty weekly options, the launch of Nifty weekly options will not lead to a significant increase in volatility as the Nifty is a broad based index while Bank Nifty is dominated mainly by two stocks. Add as a Reliable and Trusted News Source Add Now! Read More News on options trading nse Nifty 50 Markets news sebi (What's moving Sensex and Nifty Track latest market news , stock tips , Budget 2025 , Share Market on Budget 2025 and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today . Top Trending Stocks: SBI Share Price , Axis Bank Share Price , HDFC Bank Share Price , Infosys Share Price , Wipro Share Price , NTPC Share Price ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition PVR Inox’s second act: Can a Bata-like pricing save it from OTTs? INR10 lakh crore value unlocked. Who made the most of startup IPOs? Trump’s USD100k shock: Why existing H-1B holders may be sitting on a goldmine Behind Ola’s million-EV triumph, a costly fault line emerges Stock Radar: Tyre stocks seeing some momentum! Apollo Tyres breaks out from falling trendline resistance ET Prime Special Series: Multibagger or IBC - Part 25: Will retrofits help this company reinvent itself in the EV age? 1 2 3 View all Stories",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/nse-gets-sebis-nod-to-launch-weekly-options-on-nifty-50-index/articleshow/67147289.cms?from=mdr",
    "original_url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPY09jbk1WMnozeHA5bG5QZE1WTlhNMGhmYkRfYWx3MDE5R2hWZzdLWkluWWo0SGlIZGFnYTMwX3ZhMl94ODlYNk1kZFpOcDdFQUxfdVdGNmcyUE5XUHVsNmhqSEVqYmgwbzktVy1DQVdEbE9wTmlPUnBKcVNRVEhZM0pwaEktYmhUSWZlcU1YWm5iaU0zc0JIZ2hYaGxLTUlNQ1FPVVNJcUtyRWNKaWZpR2RKTEdRWjNzdVlCaVprcWw5dHcxMHNTaXA0VTJ3YjDSAdQBQVVfeXFMTjllQ09vNkJYSnVHb096SGxIeHAtVmRJV0RjR2ZocjZfWGs5TjlrRmVWaU53VmRQT0QyZ1hrbi1wUTBOak5DczJWOEt2RnBFVTJiMy1naXNOMWVMODAxOFhESmJKemdSLXFyczhWRWREVlpVN2ZNdzBhNkZoTlJhQko2bHJoTXpqRjdFNmdxdi0wY0lTbE9xblpWdXczekhMV0NVaW5EVEI5R2pNbWc0M2FkeE41RGNCV2hPaThub2F3c05BRUhqMjZKS3QybVlMWENsSkM?oc=5&hl=en-IN&gl=IN&ceid=IN:en",
    "scraped_date": "01/10/2025",
    "body_length": 4184,
    "word_count": 687,
    "gnews_title": "NSE to launch weekly options on Nifty index - The Economic Times",
    "published_date": "18/12/2018",
    "publisher": "The Economic Times",
    "topic": "NSE India trading"
  }
]